{"Animal Jokes": ["David received a parrot for his birthday. The parrot was fully grown with a bad attitude and worse vocabulary. Every other word was an obscenity. Those that weren't expletives, were to say the least, rude. David tried hard to change the bird's attitude and was constantly saying polite words, playing soft music, anything he could think of. Nothing worked. He yelled at the bird and the bird yelled back. He shocked the bird and the bird just got more angry and more rude. Finally, in a moment of desperation, David put the bird in the freezer, just for a few moments. He heard the bird squawk and kick and scream-then suddenly, there was quiet.David was frightened that he might have hurt the bird and quickly opened the freezer door. The parrot calmly stepped out and said \"I believe I may have offended you with my rude language and actions. I'll endeavor at once to correct my behavior. I really am truly sorry and beg your forgiveness.\" David was astonished at the bird's change in attitude and was about to ask what had made such a dramatic change when the parrot continued, \"May I ask what did the chicken do?\"", "A man goes into a pet shop and tells the owner that he wants to buy a pet\r\n\nthat can do everything.The shop owner suggests a faithful dog.The man replies, \"Come on, a dog?\"The owner says, \"How about a cat?\"The man replies, \"No way! A cat certainly can't do everything. I want a pet\r\n\nthat can do everything!\"The shop owner thinks for a minute, then says, \"I've got it! A centipede!\"The man says, \"A centipede? I can't imagine a centipede doing everything,\r\n\nbut okay... I'll try a centipede.\" He gets the centipede home and says to\r\n\nthe centipede, \"Clean the kitchen.\"Thirty minutes later, he walks into the kitchen and... it's immaculate! All\r\n\nthe dishes and silverware have been washed, dried, and put away the\r\n\ncounter-tops cleaned the appliances sparkling the floor waxed. He's\r\n\nabsolutely amazed.He says to the centipede, \"Go clean the living room.\"Twenty minutes later, he walks into the living room. The carpet has been\r\n\nvacuumed the furniture cleaned and dusted the pillows on the sofa plumped,\r\n\nplants watered.The man thinks to himself, \"This is the most amazing thing I've ever seen.\r\n\nThis really is a pet that can do everything!\"Next he says to the centipede, \"Run down to the corner and get me a\r\n\nnewspaper.\"The centipede walks out the door. 10 minutes later... no centipede.20 minutes later... no centipede. 30 minutes later... no centipede.By this point the man is wondering what's going on. The centipede should\r\n\nhave been back in a couple of minutes. 45 minutes later... still no\r\n\ncentipede!He can't imagine what could have happened. Did the centipede run away? Did\r\n\nit get run over by a car? Where is that centipede?So he goes to the front door, opens it... and there's the centipede sitting\r\n\nright outside.The man says, \"Hey!!! I sent you down to the corner store 45 minutes ago to\r\n\nget me a newspaper. What's the matter?!\"The centipede says, \"I'm goin'! I'm goin'! I'm just puttin' on my shoes!\"", "An out-of-towner drove his car into a ditch in a desolated area. Luckily, a\r\n\nlocal farmer came to help with his big strong horse named Buddy.\r\n\nHe hitched Buddy up to the car and yelled, \"Pull, Nellie, pull!\" Buddy\r\n\ndidn't move.Then the farmer hollered, \"Pull, Buster, pull!\" Buddy didn't respond.Once more the farmer commanded, \"Pull, Coco, pull!\" Nothing.Then the farmer nonchalantly said, \"Pull, Buddy, pull!\" And the horse easily\r\n\ndragged the car out of the ditch.The motorist was most appreciative and very curious. He asked the farmer why\r\n\nhe called his horse by the wrong name three times.The farmer said, \"Oh, Buddy is blind, and if he thought he was the only one\r\n\npulling, he wouldn't even try!\"", "A lonely frog telephoned the Psychic Hotline and asked what\r\n\nhis future holds.His Personal Psychic Advisor tells him: \"You are going to meet\r\n\na beautiful young girl who will want to know everything about\r\n\nyou.\"The frog is thrilled, \"This is great!\"Will I meet her at a party?\" he croaks.\"No,\" says the psychic, \"in biology class.\"", "A vampire bat came flapping in from the night covered in fresh blood \n\nand parked himself on the roof of the cave to get some sleep.Pretty soon all the other bats smelt the blood and began hassling \n\nhim about where he got it.He told them to go way ! And let him get some sleep, \n\nbut they persisted until he finally gave in.\"OK, follow me,\" he said and flew out of the cave with hundreds of bats \n\nbehind him.Down through a valley they went, across a river and into a forest of \n\ntrees.Finally he slowed down and all the other bats excitedly milled \n\naround him.\"Now, do you see that tree over there?\" he asked.\"Yes, Yes, Yes!\" the bats all screamed in a frenzy.\"Good!\" said the first bat, \"Because I didn't!\"", "", "One morning a blind bunny was hopping down the bunny trail, and he tripped over a large snake and fell, KerPlop!, right on his twitchy little nose. \"Oh, please excuse me!\" said the bunny.  \"I didn't mean to trip over you, but I'm blind and can't see.\"\"That's perfectly all right,\" replied the snake.  \"To be sure, it was my fault.   I didn't mean to trip you, but I'm blind too, and I didn't see you coming.  By the way, what kind of animal are you?\"Well, I really don't know,\" said the bunny.  \"I'm blind, and I've never seen myself.  Maybe you could examine me and find out.\"So the snake felt the bunny all over, and he said, \"Well, you're soft, and cuddly, and you have long silky ears, and a little fluffy tail and a dear twitchy little nose... You must be a bunny rabbit!\"Then he said, \"I can't thank you enough, but by the way, what kind of animal are you?\"And the snake replied that he didn't know, and the bunny agreed to examine him, and when he was finished, the snake said, \"Well, what kind of an animal am I?\"So the bunny felt the snake all over, and he replied, \"You're hard, you're cold, you're slimy and you haven't got any balls... You must be a lawyer.\"", "A gorilla escapes from the zoo and after 3 weeks, the zoo keepers give up looking for him. Some time later, a man calls the zoo complaining of a gorilla in a tree in his back yard. The zoo keeper rushes right over. When he arrives, he has a net, a baseball bat, a shotgun, and a Dachshund.The man asks what the items are for. He's told, \"I'm gonna climb the tree and hit the gorilla in the head with the baseball bat. When he falls out of the tree, you throw the net over him, and the Dachshund will go straight for his balls.\" The man asks, \"But what's the shotgun for?\"The zoo keeper answers, \"If I miss the gorilla and fall out of the tree, you shoot the Dachshund.\"", "Two men went bear hunting. While one stayed in the cabin, the other went out looking for a bear. He soon found a huge bear, shot at it but only wounded it. The enraged bear charged toward him, he dropped his rifle and started running for the cabin as fast as he could.He ran pretty fast but the bear was just a little faster and gained on him with every step. Just as he reached the open cabin door, he tripped and fell flat. Too close behind to stop, the bear tripped over him and went rolling into the cabin.The man jumped up, closed the cabin door and yelled to his friend inside, \"You skin this one while I go and get another one!\"", "Two women that are dog owners are arguing about which dog is smarter....First Woman : \"My dog is so smart, every morning he waits for the paper boy to come around and then he takes the newspaper and brings it to me.Second Woman : \"I know...\"First Woman : \"How?\"Second Woman : \"My dog told me.\"", "A woman wanted a pet so she went to the local pet shop. She looked at the dogs and the cats but finally settled on a parrot that was perched in the back of the store for $50.00.She asked the shopkeeper why the parrot was so cheap, to which he replied, \"Well, I have to tell you, the birds last owner was a madam at a whorehouse and he occasionally makes off color remarks that may offend some people.\"Thinking that the price was right and she could handle anything he might say, she took him. When she got home she set the bird down on the table. He looked around and said, \"New house, new madam\".\"That's not so bad,\" she thought.A little while later, her daughters got home from school, and the parrot spoke again, \"New house, new madam, new whores.\"Even though she felt a little insulted, she thought that wasn't so bad either.Later that evening, her husband Ray came home.The parrot again spoke out...This time it said, \"Hi Ray!\"The woman met with a divorce attorney the next day.", "There once was a lady who was very concerned about her missing parrot.Not knowing what to do, she called 911. \"You gotta help me find my parrot!\"The operator patiently replied, \"We can't help you with that, ma'am. This number only deals with emergencies.\"However, the lady persisted, and then the operator told her not to be concerned, that the parrot should fly back in a few days.Then, out of desperation, the lady begged, \"But you don't understand! The only thing he says is 'Here, kitty, kitty'!!!\"", "A guy walked into a bar with a pet alligator by his side. He put the alligator up on the bar. He turned to the astonished patrons and said, 'I'll make you a deal. I'll open this alligator's mouth and place my genitals inside. Then the 'gator will close his mouth for one minute. He'll then open his mouth and I'll remove my unit unscathed.In return for witnessing this spectacle, each of you will buy me a drink.' The crowd murmured their approval. The man stood up on the bar, dropped his trousers, and placed his privates in the alligator's open mouth. The 'gator closed his mouth as the crowd gasped. After a minute, the man grabbed a beer bottle and rapped the alligator hard on the top of its head.The 'gator opened his mouth and the man removed his genitals unscathed as promised. The crowd cheered and the first of his free drinks were delivered. The man stood up again and made another offer. 'I'll pay anyone $100 who's willing to give it a try.'A hush fell over the crowd. After a while, a hand went up at the end of the bar and a woman timidly spoke up.'I'll try, but you have to promise not to hit me on the head with a beer bottle.'", "A farmer buys several pigs, hoping to breed them for ham and bacon. After several weeks, he notices that none of the pigs are getting pregnant, and calls a vet for help. The vet tells the farmer that he should try artificial insemination.The farmer doesn't have the slightest idea what this means but, not wanting to display his ignorance, he only asks the vet how he will know when the pigs are pregnant. The vet tells him that when pregnant, they will stop standing around and will, instead, lay down and wallow in the mud. The farmer hangs up and gives it some thought. He comes to the conclusion that artificial insemination means he has to impregnate the pigs.So, he loads the pigs into his truck, drives them out into the woods, has sex with them all, brings them back and goes to bed. Next morning, he wakes and looks out at the pigs. Seeing that they are all still standing around, he concludes that the first try didn't take, and loads them in the truck again. He drives them out to the woods, banged each pig twice for good measure, brings them back and goes to bed.Next morning, he wakes to find the pigs still standing around. One more try, he tells himself, and proceeds to load them up and drive them out to the woods. He spends all day shagging the pigs, and, upon returning home, falls listlessly into bed.The next morning, he was woken up by his wife shaking him and saying \"Wake up Dear, the pigs are acting strangely!\". \"What do you mean?\" he asked excitedly, \"Are they wallowing in the mud?\" \"No, \" she says, \"they're all in the truck and one of them is honking the horn.\"", "A mother and baby camel are talking one day when the baby camel asks, \"Mom why have I got these huge three-toed feet?\" The mother replies, \"Well son, when we trek across the desert your toes will help you to stay on top of the soft sand\". \"OK\" said the son.A few minutes later the son asks, \"Mom, why have I got these great long eyelashes?\" \"They are there to keep the sand out of your eyes on the trips through the desert\", \"Thanks Mom\" replies the son. After a short while, the son returns and asks, \"Mom, why have I got these great big humps on my back?\" The mother, now a little impatient with the boy replies, \"They are there to help us store fat for our long treks across the desert, so we can go without water for long periods.\"\"That's great mom, so we have huge feet to stop us sinking, and long eyelashes to keep the sand from our eyes and these humps to store water, but Mom ...\" \"Yes son?\" \"Why the heck are we in the San Diego zoo?\"", "There was this guy and he was driving along until he got a flat. He spotted a near-by farm and decided maybe they had a phone. When he got there he saw a farmer and a pig. The only thing was the pig only had three legs and a wooden leg where the fourth was missing. \"Hey there, you wouldn't happen to have a phone would you?\" the guy said, still thinking about the pig.\"Nope, no phones 'round these parts.\" The farmer looked up at the sky just as the man noticed it was getting darker. \"Well, I guess...ya can stay here for 'da night. 'Dat is if you likes.\"Thinking about his flat he decided to stay. \"I just have one question, what happened to that pig?\" asked the man. \"Well,..he been in a fire not 'dat longs ago. Rescued all 'da childrens too. Yep, 'dat be one fine pig.\"said the farmer. \"Well, how'd he get like that? Did the leg get burnt....or what?\" asked the man. \"Nope, he didn' get hurt.\" \"Then what happened to his leg?\" the man asked getting more & more impatient.\"Well,\" the farmer said annoyed \"everybody knows 'dat you don't eat a pig like 'dat in one sittin\".", "A man walks into a bar and asks the bartender, \"If I show you a really good trick, will you give me a free drink?\" The bartender considers it, then agrees. The man reaches into his pocket and pulls out a tiny rat. He reaches into his other pocket and pulls out a tiny piano. The rat stretches, cracks his knuckles, and proceeds to play the blues.After the man finished his drink, he asked the bartender, \"If I show you an even better trick, will you give me free drinks for the rest of the evening?\" The bartender agrees, thinking that no trick could possibly be better than the first. The man reaches into his pocket and pulls out a tiny rat. He reaches into his other pocket and pulls out a tiny piano. The rat stretches, cracks his knuckles, and proceeds to play the blues. The man reaches into another pocket and pulls out a small bullfrog, who begins to sing along with the rat's music.While the man is enjoying his beverages, a stranger confronts him and offers him $100,000.00 for the bullfrog. \"Sorry,\" the man replies, \"he's not for sale.\" The stranger increases the offer to $250,000.00 cash up front. \"No,\" he insists, \"he's not for sale.\" The stranger again increases the offer, this time to $500,000.00 cash. The man finally agrees, and turns the frog over to the stranger in exchange for the money.\"Are you insane?\" the bartender demanded. \"That frog could have been worth millions to you, and you let him go for a mere $500,000!\" \"Don't worry about it.\" the man answered. \"The frog was really nothing special. You see, the rat's a ventriloquist.\"", "A burglar broke  into a house one night. He shined his flashlight around, looking for valuables,  and when he picked up a CD player to place in his sack, a strange, disembodied voice echoed from the dark saying, \"Jesus is watching  you.\" He nearly jumped out of his skin, clicked his flashlight out, and  froze.When he heard nothing more after a bit, he shook his head, promised himself a  vacation after the next big score, then clicked the light on and began searching  for more valuables. Just as he pulled the stereo out so he could disconnect the  wires, clear as a bell he heard, \"Jesus is watching you,\"Freaked out, he  shined his light around frantically, looking for the source of the voice.  Finally, in the corner of the room, his flashlight beam came to rest  on a parrot. \"Did you say that?\"He hissed at the parrot.\"Yep,\" the parrot  confessed, then squawked, \"I'm just trying to warn you,\" The burglar relaxed. \"Warn me, huh? Who in the world are you?\"\"Moses,\" replied the bird. The  burglar laughed. \"What kind of people would name a bird 'Moses'?\"\"The kind of people that would name a Rottweiler 'Jesus'.\"", "A circus owner walked into a shop to see everyone crowded around a table watching a little show. On the table was an upside down pot and a duck tap dancing on it. The circus owner was so impressed that he offered to buy the duck from its owner.After some wheelin' and dealin' they settled for $10,000 for the duck and the pot.Three days later the circus owner runs back to the shop in anger, \"Your duck is a rip-off! I put him on the pot before a whole audience and he didn't dance a single step!\"\"Hmmm....\" thought the duck's former owner. \"Did you remember to light the candle under the pot?\"", "A man takes the day off work and decides to go out golfing. He is on the second hole when he notices a frog sitting next to the green. He thinks nothing of it and is about to shoot when he hears, \"Ribbit. 9- Iron\".The man looks around and doesn't see anyone. \"Ribbit. 9-Iron.\" He looks at the frog and decides to prove the frog wrong.  He puts his other club away, and grabs a 9-iron. Boom! he hits it 10 inches from the cup. He is shocked!He says to the frog, \"Wow that's amazing. You must be a lucky frog, eh?\"  The frog replies \"Ribbit. Lucky frog.\" The man decides to take the frog with him to the next hole. \"What do you think frog?\" the man asks. \"Ribbit. 3-wood.\"The guy takes out a 3-wood, and boom!  A hole in one.The man is befuddled and doesn't know what to say. By the end of the day, the man has golfed the best game of golf in his life and asks the frog, \"OK where to next?\" The frog replies, \"Ribbit. Las Vegas.\" They go to Las Vegas and the guy says, \"OK frog, now what?\"  The frog says, \"Ribbit. Roulette.\"Upon approaching the roulette table, the man asks, \"What do you think I should bet?\" The frog replies, \"Ribbit. $3000,black 6.\"  Now, this is a million-to-one shot to win, but after the golf game, the man figures what the heck. Boom - tons of cash come sliding back across the table.The man takes his winnings and buys the best room in the hotel.  He sits the frog down and says, \"Frog, I don't know how to repay you. You've won me all this money and I am forever grateful.\" The frog replies, \"Ribbit, Kiss Me.\"He figures, Why not?  After all the frog did for him, it is a small price to pay.  With the kiss, however, the frog turns into a gorgeous 15-year-old girl.\"And that, your honor, is how the girl ended up in my room.\"", "Two hunters are walking through a forest looking for deer. When all of a sudden, a giant bear jumps out and scares the shit out of them. They drop their guns and run like hell.One of the hunters stopped, opened up his backpack and laced up a pair of tennis shoes. His buddy looked at him and said, \"What are you doing? Are you crazy? You can't outrun the bear!\"To this the hunter said, \"I know, all I have to do is outrun you!\"", "A bear is sitting in the middle of a forest taking the biggest shit of his life and feeling dam good about it.He looks down and sees a rabbit dumping a load right next to him. The bear looks at the rabbit and says, \"Hey, uhh Mr. Rabbit, uhh do you have a problem withthe shit sticking to your fur?\" The rabbit shakes his head no and says, \"Nope, never bothers me.\"The bear says, \"Good!\" takes the rabbit and wipes his ass with him and then tosses him aside.", "Lion wakes up in the jungle and finds that a tool is missing, he goes to elephant and asks \"Have you seen my tool?\"Elephant replies \"What does it look like?\"Lion: \"Well it's got four points on it\"Elephant: \"Sorry, I haven't seen it, try mouse\"So the Lion goes to the mouse and asks \"Have you seen my tool?\"Mouse: \"What does it look like?\"Lion: \"Well it's got four points on it.\"Mouse: \"Sorry mate, I've not seen it, try croc.\"So the lion proceeds to the crocodile and asks \"Have you seen my tool\"Croc: \"What does it look like?\"Lion: \"Well it's got four points on it.\"Croc: \"Sorry I've not seen it, try Jaguar\"So the lion goes to Jaguar and asks \"Have you seen my tool?\"Jaguar: \"Of course, I ate it.\"Lion: \"Why did you do that?\"Jaguar: \"Well I'm a four point tool eater Jaguar\"", "Leo, our neighbor, came home with a birdhouse one day.My husband kidded him, asking how many birds could afford deluxe accommodations in our suburban neighborhood.\"Leave that to me,\" Leo replied.Soon that birdhouse was dangling from a tree with a neat sign that read: \"Room for wren--cheep.\"", "A travelling ventriloquist on the road in between jobs decided to practice his craft before his next show. He stopped at a farmhouse and approached the farmer who lived there.\"Hello there, Mr. Farmer, I was just passing by and I was wondering if I might speak to your dog.\" The farmer replied, \"Well, you know, dogs don't talk.\" The ventriloquist said, \"You'd be surprised what a dog might tell you. Can I speak with him?\"The farmer, eyeing the ventriloquist suspiciously, called his dog. \"Hi there, Mr. dog,\" said the ventriloquist. \"How does the farmer treat you?\" To which the dog replied, \"Oh, he's great! He throws a stick for me, scratches my belly, and I just love him!!\" Needless to say, the farmer was dumbfounded.Wanting to see if he could fool the farmer again, the ventriloquist asked if he could speak with the farmer's horse. \"Well, you know, horses don't talk.\" Again the ventriloquist said, \"You'd be surprised what a horse might tell you.\"So the farmer brought out his horse. \"Say, Mr. Horse, how does the farmer treat you?\" asked the ventriloquist. The horse then replied, \"Oh, I think he's great. He feeds me oats, he puts a blanket over me at night, and I just love him!\" Again the farmer was amazed.Wanting to try his luck a third time, the ventriloquist said, \"Mr. Farmer, would you like to hear what the sheep has to say about you?\"\"Well,\" declared the farmer, \"Sheep lie, ya' know.\"", "A rabbit broke out of the laboratory where he had been born and raised. As he scurried away, he felt grass under his little feet and saw the dawn breaking, for the first time in his life. \"Wow,\" he thought. \"This is great.\" It wasn't long before he came to a hedge. After squeezing under it, he saw a wonderful sight -- lots of other bunny rabbits, all free and nibbling at the lush grass.\"Hey,\" he called. \"I'm a rabbit from the laboratory and I've just escaped. Are you wild rabbits?\" \"Yes, come and join us,\" they cried. Our friend hopped over to them and started eating the grass. It tasted so good. \"What else do you wild rabbits do?\", he asked. \"Well,\" one of them said. \"You see that field there? It's got carrots growing in it. We dig them up and eat them.\"This he couldn't resist and he spent the next hour eating the most succulent carrots. They were wonderful. Later, he asked them again, \"What else do you do?\" \"You see that field there? It's got lettuce growing in it. We eat that as well.\"The lettuce tasted just as good and he returned a while later completely full. \"Is there anything else you guys do?\" he asked. One of the other rabbits came a bit closer to him and spoke softly. \"There's one other thing you must try. You see those rabbits there,\" he said, pointing to the far corner of the field. \"They're girls. We have sex with them. Go and try it.\"Well, our friend spent the rest of the morning at this until, completely exhausted, he staggered back over to the guys.\"That was fantastic,\" he panted. \"So are you going to live with us then?\", one of them asked. \"I'm sorry, I had a great time, but I can't.\" The wild rabbits all stared at him, a bit surprised. \"Why? We thought you liked it here.\"\"I do,\" our friend replied. \"But I must get back to the laboratory. I'm dying for a cigarette.\"", "A horse and a chicken are playing in a meadow. The horse falls into a mud hole and is sinking. He calls to the chicken to go and get the farmer to help pull him out to safety. The chicken runs to the farm but the farmer can't be found. So he drives the farmer's Mercedes back to the mud hole and ties some rope around the bumper. He then throws the other end of the rope to his friend, the horse, and drives the car forward saving him from sinking!A few days later, the chicken and horse were playing in the meadow again and the chicken fell into the mud hole. The chicken yelled to the horse to go and get some help from the farmer. The horse said, \"I think I can stand over the hole!\" So he stretched over the width of the hole and said, \"Grab for my 'thingy' and pull yourself up.\" And the chicken did and pulled himself to safety.The moral of the story is:If you are hung like a horse, you don't need a Mercedes to pick up chicks.", "Once there was a golfer whose drive landed on an anthill. Rather than move the ball, he decided to hit it where it lay. He gave a mighty swing. Clouds of dirt and sand and ants exploded from the spot. Everything but the golfball. It sat in the same spot.So he lined up and tried another shot. Clouds of dirt and sand and ants went flying again. The golf ball didn't even wiggle.Two ants survived. One dazed ant said to the other, \"Whoa! What are we going to do?\"Said the other ant: \"I don't know about you, but I'm going to get on the ball.\"", "A duck walks into a bar and asks the bartender for some quackers. The bartender explains that the bar doesn't have any quackers.The next day, the same duck walks into the bar and asks the bartender for some quackers. The bartender again explains that the bar doesn't serve quackers.Sure enough, the very next day, the duck again walks into the bar and asks for some quackers. The bartender screams at the duck, \"If you come in here one more time, I'm going to nail your beak into the wall with a hammer and some nails! \"A few days pass, and then the duck walks into the bar again.The bartender notices the duck and says, \"I'm warning you!\"The duck replies, \"Do you have a hammer?\"The bartender replies, \"No!\"The duck asks, \"Do you have any nails?\"The bartender replies, \"No!\"The duck grins and asks, \"Do you have any quackers?\"", "One day a man went to an auction. While there, he bid on a parrot. He really wanted this bird, so he got caught up in the bidding. He kept on bidding, but kept getting outbid, so he bid higher and higher and higher. Finally, after he bid way more than he intended, he won the bid - the parrot was his at last!As he was paying for the parrot, he said to the auctioneer, \"I sure hope this parrot can talk. I would hate to have paid this much for it, only to find out that he can't talk!\"\"Don't worry,\" said the auctioneer, \"He can talk. Who do you think kept bidding against you?\"", "Mrs. Peterson phoned the repairman because her dishwasher quit working. He couldn't accommodate her with an \"after-hours\" appointment and since she had to go to work, she told him, \"I'll leave the key under the mat. Fix the dish washer, leave the bill on the counter, and I'll mail you a check. By the way, I have a large rotweiler inside named Killer; he won't bother you. I also have a parrot, and whatever you do, do not talk to the bird!\"Well, sure enough the dog, Killer, totally ignored the repairman, but the whole time he was there, the parrot cursed, yelled, screamed, and about drove him nuts.As he was ready to leave, he couldn't resist saying, \"You stupid bird, why don't you shut up!\"To which the bird replied, \"Killer, get him!!!\"", "There once was a snake breeder who had two snakes he was trying to mate. For the life of him, he couldn't get them within two feet of each other. Frustrated, he called up the local zoologist, and explained the situation. She hurried over, picked up the snakes and looked at them. \"You know what I would do?\" she said. \"See that tree over there? Chop it down, chop off a good sized log, split the log in two, and make two tables out of them. Put the tables and the snakes into a cage, and let them go at it.\"Well, the breeder thought that this was insane, but having no other options, he tried it. Sure enough, a few days later he had a whole slew of baby snakes. He called up the zoologist, and asked her how that was possible. She replied, \"Well, you see, those snakes were adders. And everybody knows that to get adders to multiply you need log tables.\"", "A blind rabbit and a blind snake meet each other. Neither one remembers what kind of animal they are, so they decide to feel each other. The rabbit says, \"You feel me first.\" The snake says okay, and he starts feeling the rabbit. He says, \"Well, you have fur all over, and a little cotton tail, and two long ears, and big back feet...\" The rabbit says, \"I know! I'm a rabbit! Yippee!\" Then the rabbit feels the snake. He says, \"Okay, you're long and thin, and slimy all over, and there's a little forked tongue...\" The snake says, \"Oh no, I'm a lawyer.\"", "1.  When you run away in the middle of a perfectly good leg humping.2.  Blaming your farts on me...not funny...not funny at all.3.  Yelling at me for barking...\n\n      I'M A FRIGGIN' DOG YOU IDIOT!!4.  How you naively believe that the stupid cat isn't all over\n\neverything while you're gone.\n\n      (Have you noticed that your toothbrush tastes a little like cat butt?)5.  Taking me for a walk, then not letting me check stuff out.\n\n      Exactly who's walk is this anyway?6.  Any trick that involves balancing food on my nose...stop it.7. Yelling at me for rubbing my ass on your carpet.\n\n      Why'd you buy carpet?8.  Getting upset when I sniff the crotches of your guests.\n\n      Sorry but I haven't quite mastered that handshake thing yet...idiot.9.  How you act disgusted when I lick myself.\n\n      Look, we both know the truth, you're just jealous.10.  Dog sweaters.\n\n      Have you noticed the fur?  Imbecile.11.  Any haircut that involves bows or ribbons.\n\n      Now you know why we chew your shit up when you're not home.12.  When you pick up the crap piles in the yard.\n\n      Do you realize how far behind schedule that puts me?13.  Taking me to the vet for \"the big snip\", then acting surprised\n\nwhen I freak out everytime we go back.14.  The sleight of hand, fake fetch throw.\n\n      You fooled a dog!  What a proud moment for the top of the food chain,\n\nyou nitwit.15.  Invisible fences.\n\n      Why do you insist on screwing with us?  To my knowledge, dogdom hasn't\n\nyet solved the visible fence problem!!", "A lady goes to her priest one day and tells him, \"Father, I have a\n\nproblem.  I have two female parrots, but they only know how to say one\n\nthing.\"\"What do they say?\" the priest inquired.\"They say, 'Hi, we're prostitutes.  Do you want to have some fun?'\"\"That's obscene\" the priest exclaimed, then he thought for a moment.\n\n\"You know,\" he said, \"I may have a solution to your problem.  I have\n\ntwo male talking parrots that I have taught to pray and read the\n\nbible.  Bring your two parrots over to my house, and we'll put them in\n\nthe cage with Francis and Jacob.  My parrots can teach your parrots to\n\npraise and worship, and your parrots are sure to stop saying...that\n\nphrase...in no time.\"\"Thank you,\" the woman responded, \"this may very well be the\n\nsolution.\"The next day, she brought her female parrots to the priest's house.\n\nAs he ushered her in, she saw that his two male parrots were inside\n\ntheir cage, holding rosary beads and praying.  Impressed, she walked\n\nover and placed her parrots in with them.  After a few minutes, the\n\nfemale parrots cried out in unison:  \"Hi, we're prostitutes.  Do you\n\nwant to have some fun?\"There was stunned silence.  Finally, one male parrot looked over at\n\nthe other male parrot and exclaimed, \"Put the beads away, Francis, our\n\nprayers have been answered!\"", "Farmer Gossman goes to the vet and says,\n\n\"My horse is constipated.\"The vet says, \"Take one of these pills,\n\nput it in a long tube, stick the other\n\nend in the horse's ass, and blow the pill\n\nup there.\"Farmer Gossman comes back the next day,\n\nand he looks very sick.The vet says, \"What happened?\"Farmer Gossman says, \"The horse blew first.\"", "Little Nancy was in the garden filling in a hole when her neighbor \n\npeered over the fence. Interested in what the cheeky-faced youngster was up to, he politely asked, \"What are you doing there, Nancy?\"\"My goldfish died,\" replied Nancy tearfully without looking up, \"and \n\nI've just buried him.\"The neighbor was very concerned. \"That's an awfully big hole for a \n\ngoldfish, isn't it?\"Nancy patted down the last heap of dirt then replied, \"That's because he's inside your fricking cat.\"", "Two guys are out hiking. All of a sudden, a bear starts chasing them.They climb a tree, but the bear starts climbing up the tree after them. The first guy gets his sneakers out of his knapsack and starts putting them on.The second guy says, \"What are you doing?\"He says, \"I figure when the bear gets close to us, we'll jump down and make a run for it.\"The second guy says, \"Are you crazy? You can't outrun a bear.\"The first guy says, \"I don\"'t have to outrun the bear. I only have to outrun you.\"", "A city boy was visiting the country and wanted\n\nto go hunting. The farmer lent the boy his\n\ngun, telling him not to kill any farm animals.The city boy headed off and soon after saw a\n\ngoat. He managed to creep into range and\n\nfinally shot it. Not knowing anything about\n\nanimals, the boy didn't know what he'd killed \n\nso he ran to the farmhouse and described his\n\nkill to the farmer.\"It had two saggy tits, a beard, a hard head\n\nand it stunk like hell!\" said the boy.\"Oh, shit!\" said the farmer. \"You've shot\n\nthe wife!\"", "Two buddies were out for a Saturday stroll.\n\nOne had a Doberman and the other had a\n\nChihuahua. As they sauntered down the\n\nstreet, the guy with the Doberman said to\n\nhis friend, \"Let's go over to that bar and\n\nget something to drink.\"The guy with the Chihuahua said, \"We can't\n\ngo in there. We've got dogs with us.\"The one with the Doberman said, \"Just\n\nfollow my lead.\" They walked over to the\n\nbar and the guy with the Doberman put on\n\na pair of dark glasses and started to walk\n\ninto the bar.The bouncer at the door said, \"Sorry, Mac,\n\nno pets allowed.\"The man with the Doberman said, \"You don't\n\nunderstand. This is my Seeing-Eye dog.\"The bouncer said, \"A Doberman pinscher?\"The man said, \"Yes, they're using them now.\n\nThey're very good.\"The bouncer said, \"OK then, come on in.\"The buddy with the Chihuahua figured he'd\n\ntry it too so he put on a pair of dark\n\nglasses and started to walk into the bar.\n\nHe knew his story would be a bit more\n\nunbelievable. Once again the bouncer said,\n\n\"Sorry, pal, no pets allowed.\"The man with the Chihuahua said, \"You don't\n\nunderstand. This is my Seeing-Eye dog.\"The bouncer said, \"A Chihuahua?\"The man with the Chihuahua said, \"A\n\nChihuahua?!? A Chihuahua?!? They gave me\n\na damn Chihuahua??!!!", "This woman goes to a pet store to purchase some dog food. She puts the bag\n\nof food up on the counter and notices a box full of frogs. She reads the\n\nsign on the box...and it says....\"Snatch Eating Frogs..$20 each (comes with\n\ninstructions)\" She looks around to see if anybody's watching her and\n\nwhispers to the man behind the counter... \"I'll take one.\" He packages up a\n\nfrog. The woman grabs her dog food and is on her way home. She gets home,\n\ntakes out the instructions and reads them carefully, doing exactly what it\n\nsays to do.  1. Take a shower. Put on some nice smelling perfume. 2. Put on\n\na very sexy teddy. 3. Crawl into bed, spread your legs and put the frog\n\ndown \"there.\"  To her surprise, nothing happens. So, she thought, perhaps\n\nthe scent she chose is not appealing to the frog. So, she showers again and\n\ntries another perfume. She gets back into bed, puts the frog between her\n\nlegs and...nothing. She's totally frustrated and pissed off at this point.\n\nShe reads the instructions again thinking that there might be something she\n\noverlooked. At the bottom of the paper is says, \"If you have any problems\n\nor questions, please call the pet store.\" So, she does.The man from behind the counter says, \"I've had a few complaints earlier today, I'll be right\n\nover.\"After the man got to her house the woman says, \"See, I've done\n\neverything according to the instructions and the damn thing just sits\n\nthere.\"The man, looking very concerned, picks up the frog, looks directly\n\ninto its eyes and says, \"I'M ONLY GOING TO SHOW YOU HOW TO DO THIS ONE MORE\n\nTIME!\"", "Guy in a bar playing pool has a pet monkey.  Monkey jumps onto the\n\ntable, grabs the cue ball and stuffs it into his mouth and swallows it. Bartender\n\nfreaks and starts yelling about how much cue balls cost , etc. The guy\n\ntries to calm him down and tells him the monkey will pass it in the next day or\n\nso and he'll wash it off real well and bring it back.Sure enough the guy and the monkey come back into the bar and gave\n\nthe bartender his cue ball back.  Meanwhile the monkey reaches into the\n\n peanut bowl, grabs a nut, sticks it in his butt--then eats it.  The bartender stares\n\nat the monkey who continues to repeat this action again and again. So he\n\nasks the guy, \"what's up with that?\"\"What?\"\"your monkey keeps grabbing peanuts one at a time and sticking\n\nthem in his butt then eating them.\"\"Oh, that---well, ever since the pool ball incident, he has to measure everything before he eats it.\"", "A blind man is walking down the street with his seeing-eye dog. They\n\ncome to a busy intersection and the dog, ignoring the high volume of\n\ntraffic zooming by on the street, leads the blind man right out into\n\nthethick of the traffic.  This is followed by the screech of tires and\n\nhorns blaring as panicked drivers try desperately not to run the pair\n\ndown.The blind man and the dog finally reach the safety of the sidewalk on\n\nother side of the street and the blind man pulls a cookie out of his coat\n\npocket which he offers to the dog.A passerby, having observed the near fatal incident, can't control his\n\namazement and says to the blind man, \"Why on earth are you\n\nrewarding your dog with a cookie? He nearly got you killed!\"The blind man turns partially in his direction and replies, \"To find out\n\nwhere his head is, so I can kick his ass.\"", "When Uncle Charlie died of old age, Bill was bequeathed his uncle's\n\nprized Amazon parrot.  This parrot was fully grown -- with a bad attitude\n\nand a worse vocabulary.  Every other word was an expletive.  Those that\n\nweren't expletives were, to say the very least, extremely rude.Bill tried hard to change the bird's attitude and was constantly saying\n\npolite words, playing soft music--anything he could think of to try and\n\nset a good example...  Nothing worked.  Exasperated, he yelled at the\n\nbird.  But the bird just got louder.  Then he shook the parrot.  But the\n\nbird just got more angry and more rude.Finally, in a moment of desperation, Bill put the parrot in the freezer.For a few moments he heard the bird squawking, kicking, and\n\nscreaming...Then, suddenly, all was quiet.  Bill was frightened that he might have\n\nhurt his dead uncle's prized parrot and quickly opened the freezer door.The parrot calmly stepped out onto Bill's extended arm and said, \"I am\n\ntruly sorry that I might have offended you with my language and action\n\nand I humbly ask your forgiveness.  I will now, from this day forth,\n\nendeavor to correct my behavior so that such an ill-perceived outburst\n\nnever again occurs.\"Bill was completely astonished at the bird's change in attitude and was\n\nabout to ask what had caused such a dramatic change when the parrot\n\ncontinued, \"May I ask what the chicken did?\"", "Marine biology researchers have developed\n\na new method to fend off shark attacks. If\n\nyou are diving and are approached by a\n\nshark they recommend that you swim towards\n\nit aggressively and punch it on the nose\n\nas hard as possible.\"\"If this doesn't work, beat the shark with\n\nyour stump.\"", "Eager to try it out, he takes one as soon as\n\nhe gets home, and waits for his wife to come\n\nhome from work, but in his excitement he forgets\n\nand leaves the package open on the table and his\n\ncockatiel eats all of them. Seeing the results\n\nand panicking the man grabs the bird and stuffs\n\nhim into the freezer to cool off.Unfortunately, his Viagra kicks in just as his\n\nwife comes home and it is hours later before he\n\nremembers the cockatiel. He runs and looks in\n\nthe freezer expecting the worst, only to find\n\nthe bird breathing heavily, drained with sweat\n\nand totally exhausted.\"What happened?\" the man asks. \"You were in\n\nthere for hours and yet you're not only alive\n\nbut you're sweating like crazy?\"The cockatiel pants, \"Man, have you ever tried\n\nto pry apart the legs a frozen chicken?\"", "This farmer had an old rooster and he thought it might be time to get a new\n\nyoung rooster to service his hens. He got himself a new rooster and let him\n\nloose with the old rooster. The young rooster went right over to the old\n\nrooster and challenged him to a fight. The old rooster said, \"Sonny, I'm too\n\nold to fight. Just follow me around, and I'll show you the place.\" The young\n\nrooster agreed and started to follow the old rooster around. The old rooster\n\nshowed him the barn, then the hen house...then started to run. The young\n\nrooster thought the old rooster was trying to pull a quick one, so he chased\n\nafter him madly.All of a sudden, there came a loud \"Bang!\" and there stood the farmer,\n\nmuttering \"Dangit, that's the third gay rooster I've had to kill this\n\nmonth.\"", "A magician was working on a cruise ship in the Caribbean. \n\nThe audience would be different each week, so the \n\nmagician allowed himself to do the same tricks over and \n\nover again.There was only one problem: The captain's parrot saw \n\nthe shows every week and began to understand what the \n\nmagician did in every trick. Once he understood that, \n\nhe started shouting in the middle of the show:\"Look, it's not the same hat!\"\"Look, he's hiding the flowers under the table!\"\"Hey, why are all the cards the Ace of Spades?\"The magician was furious but couldn't do anything, it \n\nwas the captain's parrot after all.One day the ship had an accident and sank. The magician \n\nfound himself on a piece of wood, in the middle of the \n\nocean, and of course the parrot was by his side. They \n\nstared at each other with hate, but did not utter a word.This went on for several days. After a week the parrot \n\nfinally said: \"Okay, I give up. What'd you do with the boat?\"", "This guy sees a sign in front of a house \"Talking Dog for Sale.\" He\n\nrings the bell and the owner tells him the dog is in the back yard.The guy goes into the back yard and sees a mutt sitting there.\"You talk?\" he asks.Yep,\" the mutt replies.\"So, what's your story?\"The mutt looks up and says \"Well, I discovered this gift pretty young\n\nand I wanted to help the government, so I told the CIA about my gift,\n\nand in no time they had me jetting from country to country, sitting in\n\nrooms with spies and world leaders, cause no one figured a dog would\n\nbe eavesdropping.I was one of their most valuable spies eight years running. The\n\njetting around really tired me out, and I knew I wasn't getting any\n\nyounger and I wanted to settle down. So I signed up for a job at the\n\nairport to do some undercover security work, mostly wandering near\n\nsuspicious characters and listening in. I uncovered some incredible\n\ndealings there and was awarded a batch of medals.Had a wife, a mess of puppies, and now I'm just retired.\"The guy is amazed. He goes back in and asks the owner what he wants\n\nfor the dog.The owner says \"Ten dollars.\"The guy says he'll buy him but asks the owner, \"This dog is amazing.\n\nWhy on earth are you selling him?\"The owner replies, \"He's a f*cking liar!", "There was a zebra who had lived her entire\n\nlife in a zoo and was getting on in age so\n\nthe zoo keeper decided as a treat that she\n\ncould spend her final years in bliss on a\n\nfarm. The zebra was so excited, she got to\n\nsee this huge space with green grass and\n\nhills and trees and all these strange\n\nanimals. She saw a big fat weird looking\n\nbrown thing and ran up to it all excited,\n\n\"Hi, I'm a zebra! What are you?\"\"I'm a cow.\"\"Right, right. What do you do?\"\"I make milk for the farmer.\"\"Cool.\" The zebra then saw this funny\n\nlooking little white thing and ran over to\n\nit. \"Hi, I'm a zebra. What are you?\"\"I'm a chicken.\"\"Oh, right. What do you do?\"\"I make eggs for the farmer.\"\"Right, great, see ya round.\" Then the zebra\n\nsaw this very handsome beast that looked\n\nalmost exactly like her without the stripes.\n\nShe ran over to it and said, \"Hi, I'm a\n\nzebra. What are you?\"\"I am a Stallion,\" said the stallion.\"Wow,\" said the zebra. \"What do you do?\"\"Take off your pajamas, darling, and I'll\n\nshow you.\"", "The townspeople did a little research and\n\ndiscovered they could get a cow from Moscow\n\nfor 2000 rubles - or one from Minsk for\n\nonly 1000 rubles. So, naturally, they got\n\nthe cow from Minsk.\n\nIt was a great cow had a wonderful disposition,\n\nand gave lots of milk and lots of cream.\n\nEverybody loved it dearly. The people decided\n\nthey would mate the cow and get more cows like\n\nit, and then they would never have to worry\n\nabout their milk supply again.\n\nSo they got a bull and led the cow and the\n\nbull into the pasture. When the bull came in\n\nfrom the right to mount the cow, the cow moved\n\nto the left. When the bull moved in to mount\n\nthe cow from the left, the cow moved to the\n\nright. This went on all day.Finally, in desperation, the people decided\n\nto go ask the rabbi what to do.  After all he was very wise.They told him the story. \"Rabbi, we've tried\n\nall day to mate our cow. When the bull moves\n\nin from the right the cow moves left and when\n\nthe bull moves in from the left the cow moves\n\nto the right. What do we do?\"The Rabbi thought a moment and asked, \"Did\n\nyou buy this cow from Minsk?\"\"Rabbi!\" they replied as one, \"You are so\n\nwise! We never said we bought the cow from\n\nMinsk. How did you know that?\"The Rabbi said, sadly, \"My wife is from Minsk.\"", "A tourist goes into a restaurant in Spain and orders the specialty of\n\nthe house. When his dinner arrives, he asks the waiter what it is.\"These, senor,\" replied the waiter in broken English, \"are the\n\ncojones, how you say, the testicles, of the bull killed in the ring\n\ntoday.\"The tourist swallowed hard but tasted the dish and thought it was\n\ndelicious. So he comes back the next evening and orders the same item.\n\nWhen it is served, he says to the waiter, \"These cojones, or whatever\n\nyou call them...are much smaller than the ones I had last night.\"\"Yes, senor,\" replied the waiter, \"You see...the bull, he does not\n\nalways lose.", "A travelling salesman of agricultural machinery was on a three week tour\n\nthrough the hinterlands of southern Arkansas and was visiting\n\none particular farmer.  He was standing, alongside of the farmer,\n\nleaning on the corral rail - as he always did before pitching \"the new\n\nline of tractors\" - and looking at all of the farm animals in the\n\nbarnyard. Seeing one particular pig, he said: \"Say, that sure is a fine\n\nhog, but, you know, I have never seen a pig with one wooden leg before.\"\n\nThe farmer said: \"You see, that there pig is one valuable animal, I can\n\ntell you.  That there hog saved my life three times.\"\"The first time was about a month ago.  My wife fried potatoes for\n\nsupper, just the way I like them, and left the frying pan on the stove.\n\nAbout midnight or so, the pig must have smelled the smoke, but be broke\n\nout of his pen, butted the house door open with his snout, woke us up\n\nand we got out of the house just in time.\"\"And it wasn't but two weeks later and I was mowing on the back forty\n\nand I tipped the tractor over and it pinned me under the rear wheel. Gas\n\nwas leaking out of the tank onto the hot manifold and that pig must have\n\nheard me yelling, because he broke out again, ran up to me, saw what had\n\nhappened, ran to the neighbour, got help and the neighbour came with his\n\ntractor and pulled me free.\"\"And just last week, I was leading the old dairy bull out to pasture,\n\nand he raised up and pulled the ring out of his nose and, quick as two\n\nshakes of a dog's tail, he  knocked me down. He jumped on me and\n\nstraddled me with his horns and was about to gore me, when the old pig\n\nheard what was going on, broke out again, ran up, got a firm hold on the\n\nold bull's tail and I got away.\"Having heard the explanation, the salesman said: \"All well and good,\n\nbut that doesn't explain why that hog has got a wooden leg.\"\n\nThe farmer replied: \"Well, in a way, it does.  A pig that is that\n\nvaluable is way too valuable to eat all at one time\".", "A group of friends who went deer hunting separated into\n\npairs for the day.  That night, one hunter returned alone, staggering under\n\na hugh buck.\"Where's Harry?\", asked another hunter.\"He fainted a couple miles up the trail,\" Harry's partner\n\nanswered.\"You left him lying there alone and carried\n\nthe deer back?\"\"It was a tough decision,\" said the hunter. \"But I figured\n\nno one is going to steal Harry.\"", "One afternoon while doing some work in the\n\ngarden I noticed my dog dragging something\n\nunder the fence. Upon inspection, to my\n\ndismay, I realized it was the next door\n\nneighbour's daughter's rabbit. For years I\n\nhad watch her come home from school and head\n\nstraight out to its cage, free it and play\n\nwith it in the garden. I knew today would be\n\nno different and fearing for our dog, I had\n\nto think fast.The rabbit was quite dirty, as if it had put\n\nup quite a struggle, so I washed it off with\n\nthe hose, combed it with the dog brush and\n\nblew it dry with the leaf blower. Upon\n\nfinishing its grooming, I jumped the fence\n\nand replaced it back in its cage hoping its\n\ndeath would be written off as \"natural causes\".\n\nWithin the hour, the neighbour's car pulled in\n\nand out popped the little girl, and as usual\n\nshe headed straight for the cage. Only this\n\ntime she stopped about six feet away and\n\nscreamed \"DDDDDAAAADDDDDDDYYYYYYY!!!!!!!!!!!!!!\"Her father, panic stricken, stood looking at\n\nthe cage. Being the good neighbour that I am, I\n\nrushed to fence and asked if there was anything\n\nI could do.Her father less than calmly blurted, \"What kind\n\nof sick individual would dig up a little girl's\n\ndead rabbit and put it back in it's cage?\"", "Frank was excited about his new rifle, and decided to try bear hunting. He \n\nspotted a small brown bear and shot it.There was then a tap on his shoulder, and he turned around to see a big \n\nblack bear.  The black bear said, \"That was my cousin, and you have got \n\ntwo choices. Either I maul you to death, or we have sex.\"After considering briefly, Frank decided to accede to the latter \n\nalternative. Even though he felt sore for two weeks, Frank soon recovered \n\nand vowed revenge for his humiliation.He headed out on another trip where he found the black bear and shot it.There was another tap on his shoulder. This time, a huge grizzly bear stood \n\nright next to him.  The grizzly said, \"That was a huge mistake, Frank. That \n\nwas my cousin and you have got two choices. Either I maul you to death, \n\nor we have rough sex.\"Again, Frank thought it was better to cooperate. Although he survived, it \n\ndid take several months before Frank finally recovered.  Outraged, he headed \n\nback to the woods and he managed to track down the grizzly and shot it.He felt sweet revenge, but then there was a tap on his shoulder. He turned \n\naround to find a giant polar bear standing there.The polar bear said, \"Admit it Frank, you don't come here for the hunting, \n\ndo you?\"", "One Christmas Eve, a frenzied young man ran into a pet shop looking for an unusual Christmas gift for his wife. The shop owner suggested a parrot, named Chet, which could sing famous Christmas carols. This seemed like the perfect gift. \"How do I get him to sing?\" The young man asked, excitedly. \"Simply hold a lighted match directly under his feet.\" was the shop owner's reply.The shop owner held a lighted match under the parrot's left foot. Chet began to sing: \"Jingle Bells! Jingle Bells! ...\" The shop owner then held another match under the parrot's right foot. Then Chet's tune changed, and the air was filled with: \" Silent Night, Holy Night...\"The young man was so impressed that he paid the shop-keeper and ran home as quickly as he could with Chet under his arm. When the wife saw her gift she was overwhelmed.\"How beautiful!\" She exclaimed, \"Can he talk?\" \"No,\" the young man replied, \"But he can sing. Let me show you.\" So the young man whipped out his lighter and placed it under Chet's left foot, as the shop-keeper had shown him, and Chet crooned: \"Jingle Bells! Jingle bells!...\" The man then moved the lighter to Chet's right foot, and out came: \"Silent Night, Holy night...\"The wife, her face filled with curiosity, then asked, \"What if we hold the lighter between his legs?\" The man did not know. \"Let's try it,\" he answered, eager to please his wife. So they held the lighter between Chet's legs. Chet twisted his face, cleared his throat, and the little parrot sang out loudly like it was the performance of his life: \"Chet's nuts roasting on an open fire....\"", "The Scene: The Pearly Gates to Heaven. St Peter\n\nis receptionist at the entrance. - A cat shows up.St Peter says \"I know you! You were a very nice\n\ncat on earth and didn't cause any trouble, so I\n\nwant to offer a gift to you of one special thing\n\nyou have always wanted.\"Cat: \"Well, I did always long to own a nice satin\n\npillow like my master had, so I could lie on it.\"St Peter: \"That's easy. Granted. You shall have\n\nthe satin pillow after you enter in.\"Next a group of mice appeared.St Peter: \"Ah, I remember you. You were such good\n\nmice on earth. You didn't steal food from anyone's\n\nhouse and never hurt other animals. Therefore, I\n\nwant to grant you one special wish you always wanted.\"The Chief Mouse replied, \"Well, we always watched\n\nthe children playing and saw them roller skate, and\n\nit was beautiful, and it looked like so much fun.\n\nSo can we each have some roller skates, please?\"St Peter: \"Granted. You shall have your wish.\"Next day, St Peter is making the rounds inside the\n\nGates, and sees the cat.\"Well, Cat...Did you enjoy the satin pillow?\"Cat: \"Oh, indeed I did. And say...that \"Meals on\n\nWheels\" thing was a nice touch, too!\"", "Baby Bear goes downstairs and sits in his small chair at the big table he\n\nlooks into his small bowl. It is empty. \"Who's been eating my porridge?\"\n\nhe squeaks.Papa Bear arrives at the big table and sits in his big chair. He looks\n\ninto his big bowl, and it is also empty. \"Who's been eating my Porridge?\"\n\nhe roars.Momma Bear puts her head through the serving hatch from the kitchen and\n\nyells, \"For God's sake, how many times do we have to go through this?  It\n\nwas Momma Bear who got up first, it was Momma Bear who woke everyone in\n\nthe house, it was Momma Bear who made the coffee, it was Momma Bear who\n\nunloaded the dishwasher from last night, and put everything away, it was\n\nMomma Bear who went out in the cold early morning air to fetch the\n\nnewspaper, it was Momma Bear who set the table, it was Momma Bear who put\n\nthe cat out, cleaned the litter box, and filled the cat's water and food\n\ndish, and, now that you've decided to drag your sorry bear-butts\n\ndownstairs, and grace Momma Bear's kitchen with your grumpy\n\npresence.....listen good, cause I'm only going to say this one more time\"I HAVEN'T MADE THE DAMN PORRIDGE YET!!!\"", "A man wakes up one morning to find a gorilla on his roof. So he\n\nlooks in the yellow pages and sure enough, there's an ad for\n\n\"Gorilla Removers\". He calls the number, and the gorilla remover\n\nsays he'll be over in 30 minutes.The gorilla remover arrives, and gets out of his van. He's got a\n\nladder, a baseball bat, a shotgun and a mean old pit bull.\"What are you going to do?\" the homeowner asks.\"I'm going to put this ladder up against the roof, then I'm going\n\nto go up there and knock the gorilla off the roof with this\n\nbaseball bat. When the gorilla falls off, the pit bull is trained\n\nto grab his testicles and not let go. The gorilla will then be\n\nsubdued enough for me to put him in the cage in the back of the\n\nvan.\"So the guy puts the ladder up, gets the bat and the shotgun and\n\nwalks towards the ladder. As he gets to the base of the ladder,\n\nhe hands the shotgun to the homeowner.\"What's the shotgun for?\" asks the homeowner.\"If the gorilla knocks me off the roof, shoot the damn dog!\"", "A man was sitting at home one evening, when the doorbell rang. When he\n\nanswered the door, a 6 foot tall cockroach was standing there. The cockroach\n\nimmediately punched him between the eyes and scampered off.The next evening, the man was sitting at home when the doorbell rang again.\n\nWhen he answered the door, the cockroach was there again. This time, it\n\npunched him, kicked him and karate chopped him before running away.The third evening, the man was sitting at home when the doorbell rang. When\n\nhe answered the door, the cockroach was there yet again. It leapt at him and\n\nstabbed him several times before running off. The gravely injured man\n\nmanaged to crawl to the telephone and summoned an ambulance. He was rushed\n\nto intensive care, where they saved his life. The next morning, the doctor\n\nwas doing his rounds. He asked the man what happened, so the man explained\n\nabout the 6 foot cockroach's attacks, culminating in the near fatal\n\nstabbing.The doctor thought for a moment and said, \"Yes, there's a nasty bug going\n\naround.\"", "A burglar broke into a house one night. He shone\n\nhis flashlight  around looking for valuables and\n\nwhen he picked up a CD player to  place in his sack\n\na strange voice echoed from the dark, saying: \n\n\"JESUS IS WATCHING YOU\"He nearly jumped out of his skin, clicked his\n\nflashlight out, and froze.When he heard nothing more after a bit, he shook\n\nhis head, promised himself a holiday after the next\n\nbig score, then clicked the light  back on and began\n\nsearching for more valuables. Just as he pulled the\n\nstereo out so he could disconnect the wires, clear\n\nas a bell he  heard, \"JESUS IS WATCHING YOU\".Freaked out, he shone his light around frantically,\n\nlooking for the source of the voice. Finally, in the\n\ncorner of the room, his  flashlight beam came to rest\n\non a parrot.\"Did you say that?\" he hissed at the parrot.\"Yep\" the parrot confessed, then squawked, \"I'm just\n\ntrying to warn you!\"The burglar relaxed........\"Warn me, huh? Who the heck\n\nare you?\"\"Moses\", replied the bird.\"Moses\"! the burglar laughed. \"What kind of stupid\n\npeople would  name a parrot \"Moses\"?The bird promptly replied \"Probably the same kind of\n\npeople who would name their Rottweiler \"Jesus\"...", "I was driving along the highway, and saw a rabbit hopping across the\n\nmiddle of the road. I swerved to avoid hitting the rabbit, but\n\nunfortunately the rabbit jumped in front of the car and was hit. Being a\n\nsensitive man as well as an animal lover, I pulled over to the side of\n\nthe road and got out to see what had became of the rabbit. Much to my\n\ndismay, the rabbit was dead. I felt so awful I began to cry.A woman driving down the highway saw me crying on the side of the road\n\nso she pulled over. She stepped out of her car and asked me what\n\nwas wrong.\"I feel terrible,\" I explained. \"I accidently hit this rabbit and killed\n\nit.\"The woman told me not to worry. She knew what to do. She went to her car\n\ntrunk and pulled out a spray can. She walked over to the limp, dead\n\nrabbit, and sprayed the contents of the can onto the rabbit.Miraculously, the rabbit came to life, jumped up, waved his paw at us\n\nand hopped down the road. Fifty feet away the rabbit stopped, turned\n\naround, waved at us again, hopped down the road another 50 feet, turned,\n\nwaved and hopped another 50 feet.I tell you, I was flabbergasted. I couldn't figure out what was in the\n\nwoman's spray can. So I ran over to her and asked, \"What was in your\n\nspray can? What did you spray onto the rabbit?\"The woman turned the can around so I could read it. It said:\"Hare Spray - Restores life to dead hare - Adds permanent wave\"", "A vacationing penguin is driving through Arizona and \n\nsees that the car's oil-pressure light is on. He gets \n\nout to look and sees oil dripping out of the motor. He \n\ndrives to the nearest town and stops at the first gas \n\nstation.After dropping the car off, the penguin goes for a \n\nwalk around town. He sees an ice cream shop, and being \n\na penguin in Arizona, decides that something cold \n\nwould really hit the spot. He gets a big dish of \n\nvanilla ice cream and sits down to eat. Having no \n\nhands, he makes a real mess trying to eat with his \n\nlittle flippers. After finishing his ice cream, he \n\ngoes back to the gas station and asks the mechanic if \n\nhe's found the problem.The mechanic looks up from the engine and says, \"It \n\nlooks like you've blown a seal.\"\"No, no,\" the penguin replies, wiping his mouth, \"it's \n\njust ice cream.\"", "A man who absolutely hated his wife's cat decided to get rid of \n\nhim one day by driving him 20 blocks from his home and leaving him \n\nat the park.As he was nearing home, the cat was walking up the driveway.The next day, he decided to drive the cat 40 blocks away and try \n\nthe same thing.As we was driving back into his driveway, there was the cat! He \n\nkept taking the cat farther and farther away, but the darn cat \n\nwould always beat him home.At last, he decided to drive a few miles away, turn right, then \n\nleft, past the bridge, then right again and another right and so \n\non until he reached what he thought was a safe distance from his \n\nhome and he left the cat there.Hours later, the man calls home to his wife: \"Jen, is the cat \n\nthere?\"\"Yes,\" the wife answers.  \"Why do you ask?\"Frustrated, the man answers:  \"Put that damn cat on the phone. I'm \n\nlost and I need directions!\"", "An American woman of 40 wants to get married, but she is only\n\nwilling to marry a man if he has never been with a woman.  After\n\nseveral unsuccessful years of searching, she decides to take out\n\na personal ad.  She ends up corresponding with a man who has\n\nlived his entire life in the Australian outback.They end up getting married.  On their wedding night, she goes\n\ninto the bathroom to prepare for the festivities.  When she\n\nreturns to the bedroom, she finds her new husband standing in the\n\nmiddle of the room, naked and all the furniture from the room\n\npiled in one corner.\"What happened?\" she asks.\"I've never been with a woman,\" he says, \"but if it's anything\n\nlike a kangaroo, I'm gonna need all the room I can get!\"", "A man was out walking a dog, and a woman stopped to admire\n\nthe animal.\"What's your dog's name?\" she asked.\"Herpes,\" replied the dog's owner.\"How....odd,\" said the woman. \"Why Herpes?\"\"Because he won't heel.\"", "This guy walks into a quiet bar. He is carrying three \n\nducks, one in each hand and one under his left arm.\n\nHe places them on the bar. He has a few drinks and chats \n\nwith the Bartender.The Bartender is experienced and has learned not to\n\nask people about the animals that they bring into the bar, so he\n\ndoesn't mention the ducks. They chat for about 30 minutes before the guy with the ducks \n\nhas to go to the restroom.The ducks are left on the bar. The bartender is alone with the\n\nducks. There is an awkward silence. The Bartender decides to \n\ntry to make some conversation.\"What's your name?\" He says to the first duck.\"Huey\" replies the first duck.\"How's your day been, Huey?\"\"Great. Lovely day. Had a ball. Been in and out\n\nof puddles all day.\"\"Oh. That's nice,\" says the Bartender.Then he says to the second duck \"Hi. And what's your\n\nname?\"\"Dewey,\" came the answer.\"So how's your day been, Dewey?\"\"Great. Lovely day. Had a ball. Been in and out\n\nof puddles all day. If I had the chance another day I would do \n\nthe same again.\"So the Bartender turns to the third duck and says \n\n\"So, you must be Louie.\"\"No,\" growls the third duck, \"my \n\nname is Puddles. And don't ask about my day.\"", "A man decides he wants to have a pig roast, so he goes out to a pig farm\n\n to buy one. He agrees on a per pound price with the farmer and then \n\n begins to select a pig. \"How about that one?\"\"OK,\" replies the farmer. The farmer then picks up the pig, puts it`s \n\n tail in his mouth, lets it hang from his mouth and then declares, \"This\n\n one weighs 74 pounds.\"\"That`s amazing,\" the man says, \"Are you sure you can tell a pigs` weight\n\n by using that method?\"\"Yep, says the farmer, we`ve used this method in our family for \n\n generations.\" To prove his accuracy, the farmer puts the pig on a scale\n\n and it weighs exactly 74 pounds.\"My son can do it, too,\" boasts the farmer. Sure enough, the farmer's son\n\n comes over, puts another pigs` tail in his mouth, lets it hang and then\n\n says, \"This one weighs 83 pounds.\" The farmer then confirms his sons`\n\n accuracy with the scale.\"My wife can do it, too,\" says the farmer. \"Son, go get your mother.\"The boy runs off to the house and returns a few minutes later. \"Mom can`t\n\n come out right now,\" says the son. \"She`s busy weighing the mailman.\"", "A vet gets a midnight phone call from a farmer. \"I`ve\n\ngot a very constipated cow - been like it for days, it`s \n\nin great pain, what can I do?\"Sleepy vet, knackered after working all day and all \n\nevening, says: \"If you`ve got one of those small bottles of highly concentrated \n\nmilk of magnesia, get that down it and I`ll call you in \n\nthe morning to see how it is.\"Next morning the vet rings: \"How`s the constipated cow this morning?\"\"Cow?\" says the farmer. \"I said cat.\"\"Oh God,\" says the vet, \"did you give it the \n\nconcentrate?\"\"Yes, I got the whole bottleful down its throat,  I used \n\na small funnel.\"\"Oh Jesus,\" says the vet. \"how is the cat?\"\"It`s out in the garden.\"\"Dead I suppose?\" said the vet.\"God no,\" said the farmer, \"it`s out there with four of \n\nhis mates, two digging and two filling in.\"", "Two gay gentlemen were walking through a zoo. They came across the gorillas and after a while they noticed that the huge male\n\ngorilla had a massive erection. This fascinated the gay men so much they couldn't take their eyes off of it.One of the men just couldn't bear it any longer and he reached into the cage to touch it. The gorilla grabbed him, dragged him into\n\nthe cage and screwed him for six hours non-stop. When he was done, the gorilla threw the gay man back out of the cage.An ambulance was called and the man was taken away to the hospital.The next day his friend visits him in the hospital and asked, \"Are you hurt?\"\"AM I HURT?\" he shouted, \"Wouldn't you be? That big ape hasn't called, he hasn't written...\"", "The Wisconsin State Dept of Fish and Wildlife is advising hikers, hunters, \n\nfishermen and golfers to take extra precautions and be on the alert for \n\nbears this summer.They advise people to wear noise-producing devices such as little bells on \n\ntheir clothing to alert but not startle the bears unexpectedly.They also advise you to carry pepper spray in case of an encounter with a \n\nbear.People should be able to recognize the presence of bears in an area by \n\ntheir droppings:Black bear droppings are smaller and contain berry residue and possibly \n\nsquirrel fur.Grizzly bear droppings have little bells in them and smell like pepper spray.", "A champion jockey is about to enter an important race on a new horse.  The\n\nhorse's trainer meets him before the race and says, \"All you have to\n\nremember with this horse is that every time you approach a jump, you have to\n\nshout, 'ALLLLEEE OOOP!' really loudly in the horse's ear.  Providing you do\n\nthat, you'll be fine.\"The jockey thinks the trainer is mad but promises to shout the command.  The\n\nrace begins and they approach the first hurdle.  The jockey ignores the\n\ntrainer's ridiculous advice and the horse crashes straight through the\n\ncenter of the jump.They carry on and approach the second hurdle.  The jockey, somewhat\n\nembarrassed, whispers 'Aleeee ooop' in the horse's ear.  The same thing\n\nhappens--the horse crashes straight through the center of the jump.At the third hurdle, the jockey thinks, \"It's no good, I'll have to do it,\"\n\nand yells, \"ALLLEEE OOOP!\" really loudly.  Sure enough, the horse sails over\n\nthe jump with no problems.  This continues for the rest of the race, but due\n\nto the earlier problems the horse only finishes third.The trainer is fuming and asks the jockey what went wrong.  The jockey\n\nreplies, \"Nothing is wrong with me - it's this horse.  What is he - deaf or\n\nsomething?\"The trainer replies, \"Deaf??  DEAF??  He's not deaf--he's BLIND!\"", "\"Managing senior programmers is like herding cats.\" -\n\n-Dave Platt\"Do not meddle in the affairs of cats, for they are\n\nsubtle and will piss on your computer.\" --Bruce\n\nGraham\"There is no snooze button on a cat who wants\n\nbreakfast.\" --Unknown\"Thousands of years ago, cats were worshipped as\n\ngods. Cats have never forgotten this.\" --Anonymous\"Cats are smarter than dogs. You can't get eight cats\n\nto pull a sled through the snow.\" --Jeff Valdez\"In a cat's eye, all things belong to cats.\" --\n\nEnglish proverb\"As every cat owner knows, nobody owns a cat.\" --\n\nEllen Perry Berkeley\"One cat just leads to another.\" --Ernest Hemmingway\"Dogs come when they're called; cats take a message\n\nand get back to you later.\" --Mary Bly\"Cats are rather delicate creatures and they are\n\nsubject to a good many ailments, but I never heard of\n\none who suffered from insomnia.\" --Joseph Wood Krutch\"People that hate cats, will come back as mice in\n\ntheir next life.\" --Faith Resnick\"There are many intelligent species in the universe.\n\nThey are all owned by cats.\" --Anonymous\"I have studied many philosophers and many cats. The\n\nwisdom of cats is infinitely superior.\" --Hippolyte\n\nTaine\"No heaven will not ever Heaven be; Unless my cats\n\nare there to welcome me.\" --Unknown\"There are two means of refuge from the miseries of\n\nlife: music and cats.\" --Albert Schweitzer\"The cat has too much spirit to have no heart.\" --\n\nErnest Menaul\"Dogs believe they are human. Cats believe they are\n\nGod.\"\"Time spent with cats is never wasted.\" --Colette\"Some people say that cats are sneaky, evil, and\n\ncruel. True, and they have many other fine qualities\n\nas well.\" --Missy Dizick\"You will always be lucky if you know how to make\n\nfriends with strange cats.\" --Colonial American\n\nproverb\"Cats seem to go on the principle that it never does\n\nany harm to ask for what you want.\" --Joseph Wood\n\nKrutch\"I got rid of my husband. The cat was allergic\"\"My husband said it was either him or the cat ... I\n\nmiss him sometimes.\"\"Dogs have owners....cats have a staff\".", "Mama and Papa bear were splitting up, and baby bear \n\nhad to decide who he was going to live with.So, the judge wanted to talk to baby bear to see what \n\nhe thought about living with either of his parents. \n\nWhen he asked baby bear about living with his father, \n\nbaby bear said \"No, I can't live with Papa bear, he \n\nbeats me terribly.\"\"OK,\" said the judge, \"then you want to live with your \n\nmother, right?\"\"No way!\" replied baby bear, \"She beats me worse than \n\nPapa bear does.\"The judge was a bit confused by this, and didn't quite \n\nknow what to do. \"Well, you have to live with someone, \n\nso is there any relatives you would like to stay with?\" \n\nasked the judge.\"Yes,\" answered baby bear, \"my aunt Bertha bear who lives \n\nin Chicago.\"\"You're sure she will treat you well and won't beat you?\" \n\nasked the judge.\"Definitely,\" said baby bear, \"the Chicago Bears don't \n\nbeat anybody.\"", "Four men were bragging about how smart their cats are.  The first man was an\n\nEngineer, the second man was an Accountant, the third man was a Chemist,   \n\nthe fourth was a Government Employee.To show off, the Engineer called to his cat, \"Tsquare, do your stuff.\"\n\nT-square pranced over to a desk, took out some paper and a pen and promptly\n\ndrew a circle, a square, and a triangle.  Everyone agreed that was pretty\n\nsmart.But the Accountant said his cat could do better.  He called his cat and\n\nsaid, Spreadsheet, do your stuff.\"  Spreadsheet went out into the kitchen\n\nand returned with a dozen cookies.  He divided them into 4 equal piles of 3\n\ncookies each.  Everyone agreed that was good.But the Chemist said his cat could do better.  He called his cat and said,\n\n\"Measure, do your stuff.\" Measure got up, walked over to the fridge, took\n\nout a quart of milk, got a 10 ounce glass from the cupboard and poured\n\nexactly 8 ounces without spilling a drop.  Everyone agreed that was good.Then the three men turned to the Government Employee and said, \"What can\n\nyour cat do?\" The Government Worker called to his cat and said, \"Coffee\n\nBreak, do your stuff.\" Coffee Break jumped to his feet, ate the cookies,\n\ndrank the milk, crapped on the paper, screwed the other three cats, claimed\n\nhe injured his back while doing so, filed a grievance report for unsafe\n\nworking conditions, put in for Workers Compensation and went home for the\n\nrest of the day on sick leave.", "A precious little girl walks into a pet shop and asks in the sweetest little lisp, \"Excuthe me, mithter, do you keep widdle wabbits?\"As the shopkeeper's heart melts, he gets down on his knees so that he's on her level, and asks, \"Do you want a widdle white wabbit or a thoft and fuwwy bwack wabbit or maybe one like that cute widdle bwown wabbit over there?\"She, in turn blushes, rocks on her heels, puts her hands on her knees, leans forward and says in a quiet voice, \"I don't think my pet python weally gives a thit.\"", "Donald Duck and Daisy Duck were spending the night together in a hotel room. Donald wanted to have sex with Daisy.Daisy asked, \"Do you have a condom?\"Donald frowned and said \"No.\"Daisy told Donald that if he didn't get a condom they could not have sex. \"Maybe they sell them at the front\n\ndesk,\" she suggested.So Donald went down to the lobby and asked the hotel clerk if they had condoms.\"Yes, we do,\" the clerk said, and pulled one out from under the counter and gave it to Donald.The clerk asked, \"Would you like me to put that on your bill?\"\"No!\" Donald yelled. \"What kind of a pervert do you think I am?\"", "A wealthy man decided to go on a safari in Africa. He took his\n\nfaithful (and intelligent) pet dachshund along for company.One day, the dachshund starts chasing butterflies and before long the\n\ndachshund discovers that he is lost. Wandering about, he notices a\n\nleopard heading rapidly in his direction with the obvious intention of\n\nhaving lunch. The dachshund thinks, \"I'm in deep trouble now!Then he noticed some bones on the ground close by and immediately\n\nsettles down to chew on the bones with his back to the approaching\n\ncat.Just as the leopard is about to leap, the dachshund exclaims\n\nloudly, \"Boy, that was one delicious leopard. I wonder if there are\n\nany more around here?\"Hearing this, the leopard halts his attack in mid-stride, as a look of\n\nterror comes over him, and slinks away into the trees.\"Whew,\" says the leopard. \"That was close. That dachshund nearly had\n\nme.\"Meanwhile, a monkey who had been watching the whole scene from a\n\nnearby tree figures he can put this knowledge to good use and trade it\n\nfor protection from the leopard. So, off he goes.But the dachshund saw him heading after the leopard with great speed,\n\nand figured that something must be up.The monkey soon catches up with the leopard, spills the beans and\n\nstrikes a deal for himself with the leopard. The leopard is furious at\n\nbeing made a fool of and says, \"Here monkey, hop on my back and see\n\nwhat's going to happen to that conniving canine.\"Now the dachshund sees the leopard coming with the monkey on his back\n\nand thinks \"What am I going to do now?\"But instead of running, the dog sits down with his back to his\n\nattackers, pretending he hasn't seen them yet... and just when they\n\nget close enough to hear, the dachshund says.....................\n\n\"Where's that damn monkey? I sent him off half an hour ago to bring me\n\nanother leopard.\"", "As a butcher is shooing a dog from his shop, he sees $10 and a note in his mouth, reading: \"10 lamb chops, please.\" \n\nAmazed, he takes the money, puts a bag of chops in the dog's mouth, and quickly closes the shop. He follows the dog and watches him wait for a green light, look both ways, and trot across the road to a bus stop. The dog checks the timetable and sits on the bench. When a bus arrives, he walks around to the front and looks at the number, then boards the bus. The butcher follows, dumbstruck.As the bus travels out into the suburbs, the dog takes in the scenery. After awhile he stands on his back paws to push the \"stop\" button, then the butcher follows him off.The dog runs up to a house and drops his bag on the stoop. He goes back down the path, takes a big run, and throws himself -Whap!- against the door. He does this again and again. No answer. So he jumps on a wall, walks around the garden, beats his head against a window, jumps off, and waits at the front door. A big guy opens it and starts cursing and pummeling the dog.The butcher runs up screams at the guy: \"What the hell are you doing? This dog's a genius!\"The owner responds, \"Genius, my ass. It's the second time this week he's forgotten his key!\"", "A Russian and an American wrestler were set to square off for the\n\nOlympic Gold Medal. Before the final match, the American wrestler's\n\ntrainer came to him and said, \"now, don't forget all the research we've done on this Russian. He's\n\nnever lost a match because of this 'Pretzel' hold he has, whatever\n\nyou do don't let him get you in this hold! If he does, you're\n\nfinished!\"The wrestler nodded in acknowledgment.As the match started, the American and the Russian circled each\n\nother several times, looking for an opening. All of a sudden, the\n\nRussian lunged forward, grabbing the American and wrapping him up in the dreaded pretzel hold.A sigh of disappointment arose from the crowd and the trainer buried\n\nhis face in his hands, for he knew all was lost. He couldn't watch\n\nthe inevitable happen. Suddenly, there was a scream, then a cheer from the crowd and the trainer\n\nraised his eyes just in time to watch the Russian go flying up in\n\nthe air. His back hit the mat with a thud and the American collapsed on top of him making the pin and winning the\n\nmatch.The trainer was astounded. When he finally got the American wrestler\n\nalone, he asked, \"how did you ever get out of that hold? No one has\n\never done it before!\"The wrestler answered,\"well, I was ready to give up when he got me\n\nin that hold but at the last moment, I opened my eyes and saw this\n\npair of testicles right in front of my face. I had nothing to lose so with my last\n\nounce of strength I stretched out my neck and bit those babies just as hard as I could.\"\"So, the trainer exclaimed, 'that is what finished him off?!\"\"Not really. You'd be amazed how strong you get when you bite your\n\nown balls.", "A young boy goes off to college, but about 1/3 way through\n\nthe semester, he has foolishly squandered what money his\n\nparents gave him. \"Hmmmm,\" he wonders, \"How am I gonna get more dough?\"Then he gets an idea. He calls his father.\n\n\"Dad,\" he says, \"you won't believe the wonders that modern\n\neducation are coming up with! Why, they actually have a\n\nprogram here that will teach Fido how to talk!\"\"That's absolutely amazing!\" his father says. \"How do I get\n\nhim in that program?\"\"Just send him down here with $1000,\" the boy says, \"I'll get him into the course.\"So, his father sends the dog and the $1000. About 2/3 way\n\nthrough the semester, the money runs out. The boy calls his\n\nfather again. \"So how's Fido doing, son?\" his father asks.\"Awesome, dad, he's talking up a storm,\" he says, \"but you just\n\nwon't believe this - they've had such good results with this\n\nprogram, that they've implemented a new one to teach the animals\n\nhow to READ!\"\"READ!?\" says his father, \"No kidding! What do I \n\nhave to do to get him in that program?\"\"Just send $2,500, I'll get him in the class.\" ....And his father sends the money.\n\nAt the end of the semester, the boy has a problem. When he gets\n\nhome, his father will find out that the dog can neither talk nor\n\nread. So he shoots the dog. When he gets home, his father is\n\nall excited. \"Where's Fido? I just can't wait to hear him talk and listen to him read something!\"\"Dad,\" the boy says, \"I have some grim news. This morning, when I got out of the shower, \n\nFido was in the living room kicking back in the recliner, reading the morning paper, like he \n\nusually does.Then he turned to me and asked, 'So, is your daddy still messin' around with that \n\nlittle redhead who lives on Oak Street?' \"The father says, \"I hope you SHOT that lyin' son of a bitch!\"\"I sure did, Dad!\"\"That's my boy!", "Two robins were sitting in a tree.\"I'm really hungry,\" said the first one. \"Let's fly down and find some lunch.\"They flew down to the ground and found a nice plot of newly plowed ground that was full of worms. They ate and ate and ate till they could eat no more.\"I'm so full, I don't think I can fly back up into the tree,\" said the first one.\"Let's just lay back here and bask in the warm sun,\" said the second.\"O K,\" said the first.So they plopped down, basking in the sun. No sooner than they had fallen asleep, when a big fat tomcat came up and gobbled them up.As the cat sat washing his face after his meal, he thought...\"I JUST LOVE BASKIN ROBINS.\"", "Three mice are sitting at a bar in a pretty rough neighborhood late at \n\nnight trying to impress each other about how tough they are. \n\nThe first mouse throws down a shot of bourbon, slams the empty glass onto \n\nthe bar, turns to the second mouse and says, \"When I see a mousetrap, I lay \n\non my back and set it off with my foot. When the bar comes down, I catch it \n\nin my teeth, bench press it twenty times to work up an appetite, and then \n\nmake off with the cheese.\"The second mouse orders up two shots of tequila, drinks them down one after \n\nthe other, slams both glasses onto the bar, turns to the first mouse and \n\nreplies, \"Oh yeah? When I see rat poison, I collect as much as I \n\ncan, take it home, grind it up to a powder, and add it to my coffee each \n\nmorning so I can get a good buzz going for the rest of the day.\" \n\nThe two then turn to the third mouse.The third mouse finishes the beer he has in front of him, lets out a long \n\nsigh and says to the first two, \"I don't have time for this bullsh*t. Gotta go \n\nhome and have sex with the cat.\"", "One day an out of work mime is visiting the zoo and attempts to earn some money as a street performer.However, as soon as he starts to draw a crowd, the zookeeper grabs him and drags him into his office.The zookeeper explains to the mime that the zoo's most popular attraction, a gorilla, has died suddenly. The keeper fears that attendance at the zoo will fall off. He offers the mime a job to dress up as the gorilla until they can get another one. The mime accepts.The next morning, before the crowd arrives, the mime puts on the gorilla suit and enters the cage. He discovers that it's a great job. He can sleep all he wants, play and make fun of people and he draws bigger crowds than he ever did as a mime.However, eventually the crowds tire of him and he gets bored just swinging on tires. He begins to notice that the people are paying more attention to the lion in the cage next to his.Not wanting to lose the attention of his audience, he climbs to the top of his cage, crawls across a partition, and dangles from the top to the lion's cage. Of course, this makes the lion furious, but the crowd loves it.At the end of the day the zookeeper comes and gives the mime a raise for being such a good attraction as a gorilla.Well, this goes on for some time. The mime keeps taunting the lion, the crowds grow larger, and his salary keeps going up. Then one terrible day when he is dangling over the furious lion, he slips and falls. The mime is terrified. The lion gathers itself and prepares to pounce. The mime is so scared that he begins to run round and round the cage with the lion close behind.Finally, the mime starts screaming and yelling, \"Help, Help me!\", but the lion is quick and pounces. The mime soon finds himself flat on his back looking up at the angry lion and the lion says, \"Shut up you idiot! Do you want to get us both fired?\"", "Rhonda went to a pet shop and immediately spotted a large beautiful parrot. There was a sign on the cage that said $50.00. \"Why so little?\" she asked the pet store owner.The owner replied, \"Look, I should tell you first that this bird used to live in a house of prostitution, and sometimes it says some pretty vulgar stuff.\"The woman thought about this, but decided she had to have the bird anyway. She took it home and hung the bird's cage up in her living room and waited for it to say something. The bird looked around the room, then at her, and said, \"New house, new madam.\" The woman was a bit shocked at the implication, but then thought, \"That's not so bad.\"\n\nWhen her two teenage daughters returned from school the bird saw them and said, \"New house, new madam, new girls.\" The girls and the woman were a bit offended but then began to laugh about the situation. Moments later, the woman's husband, Robert, came home from work. The bird looked at him and said, \"Hi Robert.\"", "A man and his friend meet at the club house and decide to play a round of golf together. The man has a little dog with him and on the first green, when the man holes out a 20 foot putt, the little dog starts to yip and stands up on its hind legs.The friend is quite amazed at this clever trick and says, \"That dog is really talented! What does he do if you miss a putt?\"\"Somersaults,\" says the man.\"Somersaults?!\" says the friend, \"That's incredible. How many does he do?\"\"Hmmm,\" says the man. \"That depends on how hard I kick him in the ass.\"", "Two guys are walking through the woods and come across this big\n\ndeep  hole.\"Wow...that looks deep.\" \"Sure does... toss a few pebbles in there\n\nand see how deep it is.\"They pick up a few pebbles and throw them in and wait... no noise.\"Jeeez. That is REALLY deep... here.. throw one of these great big\n\nrocks down there. Those should make a noise.\"They pick up a couple football-sized rocks and toss them into the\n\nhole and wait... and wait. Nothing.They look at each other in amazement. One gets a determined\n\nlook on his face and says, \"Hey...over here in the weeds, there's a\n\nrailroad tie. Help me carry it over here. When we toss THAT sucker\n\nin, it's GOTTA make some noise.\"The two drag the heavy tie over to the hole and heave it in. Not a\n\nsound comes from the hole.Suddenly, out of the nearby woods, a goat appears, running like the\n\nwind. It rushes toward the two men, then right past them, running as\n\nfast as it's legs will carry it. Suddenly it leaps in the air and\n\ninto the hole.The two men are astonished with what they've just seen...Then, out of the woods comes a farmer who spots the men and\n\nambles over.\"Hey... you two guys seen my goat out here?\"\"You bet we did!  Craziest thing I ever seen!  It came running like\n\ncrazy and just jumped into this hole!\"\"Nah\", says the farmer, \"That couldn't have been MY goat. My goat was\n\nchained to a railroad tie.\"", "Whitey was in the fertilized egg business. He had several hundred \n\nyoung layers called pullets and eight or ten roosters, whose job was to \n\nfertilize the eggs. Whitey kept records and any rooster that didn't \n\nperform went into the soup pot and was replaced.That took an awful lot of Whitey's time so Whitey got a set of \n\ntiny bells and attached them to his roosters.Each bell had a different tone so Whitey could tell from a \n\ndistance, which rooster was performing.Now he could sit on the porch and fill out an efficiency report \n\nsimply by listening to the bells.Whitey's favorite rooster was old Brewster, a very fine specimen \n\nhe was, too. But on this particular morning Whitey noticed old Brewster's \n\nbell hadn't rung at all!Whitey went to investigate. The other roosters were chasing \n\npullets, bells-a-ringing. The pullets, hearing the roosters coming, would run for \n\ncover.BUT, to Whitey's amazement, Brewster had his bell in his beak, so \n\nit couldn't ring. He'd sneak up on a pullet, do his job and walk on to the \n\nnext one.Whitey was so proud of Brewster, he entered him in the county \n\nfair... and Brewster became an overnight sensation among the judges. \n\nThe result...The judges not only awarded Brewster the \"No Bell Piece Prize\" but \n\nthey also awarded him the \"Pulletsurprise\" as well.", "Everybody I know who has a dog usually calls him \"Rover\" or \"Spot\". I call mine Sex. Now, Sex has been very embarrassing to me.When I went to the City Hall to renew the dog's license, I told the clerk that I would like a license for Sex.He said, \"I would like to have one too!\"Then I said, \"But she is a dog!\"He said he didn't care what she looked like.I said, \"You don't understand. ... I have had Sex since I was nine years old.\"He replied, \"You must have been quite a strong boy.\"When I decided to get married, I told the minister that I would like to have Sex at the wedding.He told me to wait until after the wedding was over.I said, \"But Sex has played a big part in my life and my whole world revolves around Sex.\"He said he didn't want to hear about my personal life and would not marry us in his church.I told him everyone would enjoy having Sex at the wedding.The next day we were married at the Justice of the Peace. My family was barred from the church from then on.When my wife and I went on our honeymoon, I took the dog with me.When we checked into the motel, I told the clerk that I wanted a room for me and my wife and a special room for Sex.He said that every room in the motel is a place for sex.I said, \"You don't understand. ... Sex keeps me awake at night.\"The clerk said, \"Me too!\"One day I entered Sex in a contest. But before the competition began, the dog ran away.Another contestant asked me why I was just looking around.I told him that I was going to have Sex in the contest.He said that I should have sold my own tickets.\"You don't understand,\" I said, \"I hoped to have Sex on TV.\"He called me a show off.When my wife and I separated, we went to court to fight for custody of the dog.I said, \"Your Honor, I had Sex before I was married but Sex left me after I was married.\"The Judge said, \"Same here!\"Last night Sex ran off again. I spent hours looking all over for her. A cop came over and asked me what I was doing in the alley at 4 o'clock in the morning.I said, \"I'm looking for Sex.\" -- My case comes up next Thursday.Well now I've been thrown in jail, been divorced and had more damn troubles with that dog than I ever foresaw.Why just the other day when I went for my first session with the psychiatrist, she asked me, \"What seems to be the trouble?\"I replied, \"Sex has been my best friend all my life but now it has left me for ever. I can't live any longer being so lonely.\"And the doctor said, \"Look mister, you should understand that sex isn't a man's best friend so go get yourself a dog.\"", "A man takes the day off work and decides to go out golfing. He is on the second hole when he notices a frog sitting next to the green.\n\nHe thinks nothing of it and is about to shoot when he hears,\"Ribbit. 9 Iron.\" The man looks around and doesn't see anyone.\"Ribbit. 9 Iron.\" He looks at the frog and decides to prove the frog wrong, puts his other club away, and grabs a 9 iron. Boom! He hits it 10 inches from the cup. He is shocked. He says to the frog, \"Wow that's amazing.\"\n\nYou must be a lucky frog, eh?\"The frog replys \"Ribbit. Lucky frog.\"The man decides to take the frog with him to the next hole.\"What do you think frog?\" The man asks.\"Ribbit. 3 wood.\"The guy takes out a 3 wood and Boom! Hole in one. The man is befuddled and doesn't know what to say. By the end of the day, the man golfed the best game of golf in his life and asks the frog, \"OK where to next?\"The frog reply, \"Ribbit.Las Vegas.\"They go to Las Vegas and the guy says, \"OK frog, now what?\"The frog says, \"Ribbit Roulette.\"Upon approaching the roulette table, the man asks, \"What do you think I should bet?\"The frog replies, \"Ribbit. $3000, black 6.\"Now, this is a million-to-one shot to win, but after the golf game, the man figures what the heck. Boom! Tons of cash comes sliding back across the table. The man takes his winnings and buys the best room in the hotel. He sits the frog down and says,\"Frog, I don't know how to repay you. You've won me all this money and I am forever grateful.\"The frog replies, \"Ribbit.......Kiss Me.\"He figures why not, since after all the frog did for him he deserves it. \n\nWith a kiss, the frog turns into a gorgeous 16-year-old girl.\"And that, your honor, is how the girl ended up in my room\".", "A guy is browsing in a pet shop and sees a parrot sitting on a little perch. It doesn't have any feet or legs. The guy says aloud, \"Jeesh, I wonder what happened to this Parrot?\"The parrot says, \"I was born this way. I'm a defective parrot.\"\"Holy crap,\" the guy replies. \"You actually understood and answered me!\"\"I got every word,\" says the parrot. \"I happen to be a highly intelligent, thoroughly educated bird.\"\"Oh yeah?\" the guy asks, \"Then answer this -- how do you hang onto your perch without any feet?\"\"Well,\" the parrot says, \"this is very embarrassing but since you asked, I wrap my weenie around this wooden bar like a little hook. You can't see it because of my feathers.\"\"Wow,\" says the guy. \"You really can understand and speak English can't you?\"\"Actually, I speak both Spanish and English, and I can converse with reasonable competence on almost any topic: politics, religion, sports, physics, philosophy. I'm especially good at ornithology. You really ought to buy me. I'd be a great companion.\"The guy looks at the $200 price tag. \"Sorry, but I just can't afford that.\"\"Pssssssst,\" says the parrot, \"I'm defective, so the truth is, nobody wants me cause I don't have any feet. You can probably get me for $20, just make the guy an offer!\"The guy offers $20 and walks out with the parrot. Weeks go by. The parrot issensational. He has a great sense of humor, he's interesting, he's a great pal, he understands everything, he sympathizes, and he's insightful. The guy is delighted. One day the guy comes home from work and the parrot goes, \"psssssssssssst,\" and motions him over with one wing.\"I don't know if I should tell you this or not, but it's about your wife and the postman.\"\"What are you talking about?\" asks the guy.\"When the postman delivered the mail today, your wife greeted him at the door in a sheer black nightie and kissed him passionately.\"\"WHAT???\" the guy asks incredulously. \"THEN what happened?\"\"Well, then the postman came into the house and lifted up her nightie and began petting her all over,\" reported the parrot.\"Oh No!,\" he exclaims. \"Then what?\"\"Then he lifted up the nightie, got down on his knees and began to kiss her all over, starting with her breasts and slowly going down....\"\"WELL,\" demands the frantic guy, \"THEN WHAT HAPPENED?\"\"Damned if I know. I got a hard-on and fell off my perch!\"", "1. Put both lids of the toilet up and add 1/8 cup of pet shampoo to the water in the bowl.2. Pick up the cat and soothe him while you carry him towards the bathroom.3. In one smooth movement, put the cat in the toilet and close both lids. You may need to stand on the lid.4. The cat will self agitate and make ample suds. Never mind the noises that come from the toilet, the cat is actually enjoying this.5. Flush the toilet three or four times. This provides a \"power wash\" and \"rinse\".6. Have someone open the front door of your home. Be sure that there are no people between the bathroom and the front door.7. Stand behind the toilet as far as you can and quickly lift both lids.8. The cat will rocket out of the toilet , streak through the bathroom and run outside where he will dry himself off.9. Both the commode and the cat will be sparkling clean.Sincerely,The Dog", "Mrs. Broomfield's dishwasher quit working, so she called a repairman.He couldn't accommodate her with an evening appointment, and since she had \n\nto go to work the next day, she told him,\"I'll leave the key under the mat. Fix the dishwasher, leave the bill on the \n\ncounter, and I'll mail you the check. By the way, don't worry about my \n\nRottweiler, Brutus. He won't bother you. But, whatever you do, do not under \n\nany circumstances talk to my parrot!\"When the repairman arrived at Mrs. Broomfield's apartment the next day, he \n\ndiscovered the biggest and meanest looking Rottweiler he had ever seen. But, \n\njust like she had said, the dog just lay there on the carpet, watching the \n\nrepairman go about his business.However, the whole time he was there, the parrot drove him nuts with his \n\nincessant squawking and talking. Finally the repairman couldn't contain \n\nhimself any longer and yelled: \"Shut up, you stupid bird!\"To which the parrot replied:\"Get him, Brutus!\"", "A guy walks into a bar with his dog on a leash the barman says, \"Geez that's a weird dog: he's stumpy-legged, pink, and doesn't have a tail, but I bet my rottweiler would beat the heck out of it.\"\n\n50 bucks is laid down. Out in the yard the rottweiler gets mauled to pieces.Another drinker says his pit bull will win but the bet is 100 bucks.Another trip to the yard and when it's all over there are bits of pit-bull terrier all over the place. The drinker pays up and says, \"Say what breed is that anyway?\"The owner says,\"Until I cut his tail off and painted it pink it was the same breed as every other alligator\"", "One day a farmer's donkey fell down into a well. The animal cried \n\npiteously for hours as the farmer tried to figure out what to do.\n\nFinally, he decided the animal was old, and the well needed to be covered \n\nup anyway; it just wasn't worth it to retrieve the donkey. He invited all his neighbors to come over and\n\nhelp him. They all grabbed a shovel and began to shovel dirt into the \n\nwell.At first, the donkey realized what was happening and cried horribly. Then,\n\nto everyone's amazement he quieted down. A few shovel loads later, the\n\nfarmer finally looked down the well. He was astonished at what he saw. \n\nWith each shovel of dirt that hit his back, the donkey was doing something\n\namazing. He would shake it off and take a step up. As the farmer's neighbors continued to shovel dirt on top of the animal, \n\nhe would shake it off and take a step up. Pretty soon, everyone was amazed as the donkey stepped up over \n\nthe edge of the well and happily trotted off!Life is going to shovel dirt on you, all kinds of dirt. The trick to \n\ngetting out of the well is to shake it off and take a step up. Each of our troubles is a steppingstone. \n\nWe can get out of the deepest wells just by not stopping, never giving up!\n\nShake it off and take a step up.Remember the five simple rules to be happy:1. Free your heart from hatred - Forgive.2. Free your mind from worries - Most never happen.3. Live simply and appreciate what you have.4. Give more.5. Expect lessNOW --------Enough of that crap . .The donkey later came back and bit the sh*t out of\n\nthe farmer who had tried to bury him. The gash from the\n\nbite got infected, and the farmer eventually died in\n\nagony from septic shock.MORAL FROM TODAY'S LESSON:When you do something wrong and try to cover your\n\nass, it always comes back to bite you.", "Once upon a time there was a non-conforming sparrow who decided not to fly south for the winter. However, soon the weather turned so cold that he reluctantly decided to fly south. In a short time ice began to form on his wings and he fell to Earth in a barnyard, nearly frozen solid. A cow passed by where he had fallen, and crapped on the little sparrow.The sparrow thought it was the end, but the manure warmed him and defrosted his wings!Warm and happy, able to breath, he started to sing.Just then a large cat came by, and hearing the chirping he investigated the sounds. The cat cleared away the manure, found the chirping bird, and promptly ate him.The Moral of the Story:Everyone who craps on you is not necessarily your enemyEveryone who gets you out of crap is not necessarily your friend.And if you're warm and happy in a pile of crap, you might just want to keep your mouth shut.", "Two guys were walking in the woods one day, and they all of a sudden came across a bear. The bear noticed them, and started growling and generally getting really mean.The bear started to chase one of the guys, who, as it turns out, was from Czechoslovakia. The bear soon caught up with him, and ate him alive. The other guy turned around and ran for his life.A little while later, the second guy found a park ranger station and told his story. The ranger took his gun, and they both went out in search of the bear, in order to destroy it.Soon, they came across two bears, one male, and one female. The ranger turned to the other guy and said: \"Quick... tell me which bear ate your friend!\" The ranger levelled his gun and got ready to shoot.\"I'm not really sure,\" said the other guy, \"they both look similar.\"\"QUICK! Make up your mind!\" said the ranger.\"O.K.,\" said the other, \"it was the male.\"The ranger promptly aimed and shot the female bear. The male ran off. Using his knife, the ranger cut open the belly of the female and found the body of the other man.\"But why didn't you shoot the male when I thought it was the male who ate my friend?\" the other man asked.\"Well,\" said the ranger...\"I never trust anyone who says that the Czech's in the male!\"", "If your dog is fat, you aren't getting enough exercise.- UnknownSome days you're the dog; some days you're the hydrant.- UnknownWhoever said you can't buy happiness forgot about puppies.- Gene HillIn dog years, I'm dead.- UnknownTo his dog, every man is Napoleon; hence the constant popularity of dogs.- Aldous HuxleyA dog teaches a boy fidelity, perseverance, and to turn around three times \n\nbefore lying down.- Robert BenchleyDid you ever walk into a room and forget why you walked in? I think that's \n\nhow dogs spend their lives.- Sue MurphyI loathe people who keep dogs. They are cowards who haven't got the guts to \n\nbite people themselves.- August StrindbergNo animal should ever jump up on the dining room furniture unless absolutely \n\ncertain that he can hold his own in the conversation.- Fran LebowitzEver consider what they must think of us? I mean, here we come back from a \n\ngrocery store with the most amazing haul -- chicken, pork, half a cow. They \n\nmust think we're the greatest hunters on earth!- Anne TylerI wonder if other dogs think poodles are members of a weird religious cult.- Rita RudnerMy dog is worried about the economy because Alpo is up to 99 cents a can.That's almost $7.00 in dog money.\n\n- Joe WeinsteinIf I have any beliefs about immortality, it is that certain dogs I have \n\nknown will go to heaven, and very, very few persons.- James ThurberYou enter into a certain amount of madness when you marry a person with \n\npets.\n\n- Nora EphronDon't accept your dog's admiration as conclusive evidence that you are \n\nwonderful.- Ann LandersWomen and cats will do as they please, and men and dogs should relax and get \n\nused to the idea.- Robert A. HeinleinIn order to keep a true perspective of one's importance, everyone should \n\nhave a dog that will worship him and a cat that will ignore him.- Dereke Bruce, Taipei, TaiwanOf all the things I miss from veterinary practice, puppy breath is one of \n\nthe most fond memories!- Dr. Tom CatThere is no psychiatrist in the world like a puppy licking your face.- Ben WilliamsWhen a man's best friend is his dog, that dog has a problem.- Edward AbbeyCat's motto: No matter what you've done wrong, always try to make it look \n\nlike the dog did it.- UnknownMoney will buy you a pretty good dog, but it won't buy the wag of his tail.- UnknownNo one appreciates the very special genius of your conversation as the dog \n\ndoes.- Christopher MorleyA dog is the only thing on earth that loves you more than he loves himself.- Josh BillingsMan is a dog's idea of what God should be.- Holbrook JacksonThe average dog is a nicer person than the average person.\n\n- Andrew A. RooneyHe is your friend, your partner, your defender, your dog. You are his life, \n\nhis love, his leader. He will be yours, faithful and true, to the last beat \n\nof his heart. You owe it to him to be worthy of such devotion.- UnknownIf you pick up a starving dog and make him prosperous, he will not bite you; \n\nthat is the principal difference between a dog and a man.- Mark TwainThings that upset a terrier may pass virtually unnoticed by a Great Dane.- Smiley BlantonI've seen a look in dogs' eyes, a quickly vanishing look of amazed contempt, \n\nand I am convinced that basically dogs think humans are nuts.- John Steinbeck", "An out-of-towner drove his car into a ditch\n\nin a desolated area. Luckily, a local farmer\n\ncame to help with his big strong horse named\n\nBuddy.He hitched Buddy up to the car and yelled,\n\n\"Pull, Nellie, pull!\" Buddy didn't move.Then the farmer hollered, \"Pull, Buster, pull!\"\n\nBuddy didn't respond.Once more the farmer commanded, \"Pull, Coco,\n\npull!\" Nothing.Then the farmer nonchalantly said, \"Pull, Buddy,\n\npull!\" And the horse easily dragged the car out\n\nof the ditch.The motorist was most appreciative and very\n\ncurious. He asked the farmer why he called his\n\nhorse by the wrong name three times.\"Well... Buddy is blind and if he thought he\n\nwas the only one pulling, he wouldn't even try!\"", "Old Farmer Went To Town To See A Movie The Ticket Agent\n\nAsked, \"sir, What's That On Your Shoulder?\" The Old Farmer\n\nSaid, \"that's My Pet Rooster Chucky . Wherever I Go, Chucky\n\nGoes.\"I Am Sorry Sir,\" Said The Ticket Agent . \"we Can't Allow\n\nAnimals In The Theater.\"The Old Farmer Went Around The Corner And Stuffed The Bird Down His Overalls . He Returned To The Booth, Bought A Ticket And Entered The Theater .He Sat Down Next To Two Old Widows Named Mildred And Marge.The Movie Started And The Rooster Began To Squirm . The Old Farmer Unbuttoned His Fly So Chucky Could Stick His Head Out And Watch The Movie .\"Marge,\" Whispered Mildred . \"What?\" Said Marge\"I Think The Guy Next To Me Is A Pervert.\"\"What Makes You Think So?\" Asked Marge .\"He Undid His Pants And He Has His Thing Out,\" Whispered\n\nMildred .\"Well, Don't Worry A Bout It,\" Said Marge.\" At Our Age We've Seen 'em All\"\"I Thought So Too,\" Said Mildred,But This One's Eatin My Popcorn!\"", "How many dogs does it take to change a light bulb?\"Golden Retriever: The sun is shining, the day is young, we have our whole lives ahead of us, and you're inside worrying about a stupid burned out bulb?Border Collie: Just one. And then I'll replace any wiring that's not up to code.Dachshund: You know I can't reach that stupid lamp!Rottweiler: Make me.Boxer: Who cares? I can still play with my squeaky toys in the dark.Lab: Oh, me, me!!!!! Pleeeeeeeeeze let me change the light bulb! Can I? Can I? Huh? Huh? Huh? Can I? Pleeeeeeeeeze, please, please, please!German Shepherd: I'll change it as soon as I lead these people from the dark, check to make sure I don't miss any, and make just one more perimeter patrol to see that no one takes advantage of the situation.Jack Russell Terrier: I'll just pop it in while I'm bouncing off the walls and furniture.Old English Sheep Dog: Light bulb? I'm sorry, but I don't see a light bulb!Cocker Spaniel: Why change it? I can still pee on the carpet in the dark.Chihuahua: Yo quiero Taco Bulb.Pointer: I see it, there it is, there it is, right there.....Greyhound: It isn't moving. Who cares?Australian Shepherd: First, I'll put all the light bulbs in a little circle...Poodle: I'll just blow in the Border Collie's ear and he'll do it. By the time he finishes rewiring the house, my nails will be dry.\"Dogs do not change light bulbs. People change light bulbs. So, the real question is: How long will it be before I can expect some light, some dinner, and a massage?\" \n\nAll of which proves, once again, that while dogs have masters, cats have staff.", "What is a Cat?Cats do what they want. They rarely listen to you. They're totally \n\nunpredictable. When you want to play, they want to be alone. \n\nWhen you want to be alone, they want to play. They expect you \n\nto cater to their every whim. They're moody. They leave hair everywhere.Conclusion: They're tiny women in little fur coats.What is a Dog?Dogs spend all day sprawled on the most comfortable piece of furniture \n\nin the house. They can hear a package of food opening half a block \n\naway, but don't hear you when you're in the next room. They can look \n\ndumb and lovable at the same time. They growl when they are not happy. \n\nWhen you want to play, they want to play. When you want to be alone, \n\nthey want to play. They leave their toys everywhere. They do disgusting \n\nthings with their mouths and then try to give you a kiss. They go right for \n\nyour crotch as soon as they meet you.Conclusion: They're tiny men in little fur coats.", "A man walks into a restaurant with a full-grown ostrich behind him.As he sits, the waitress comes over and asks for their orders.The man says, \"I'll have a hamburger, fries and a coke,\" and turns to the \n\nostrich, \"What's yours?\"\"I'll have the same,\" says the ostrich.A short time later the waitress returns with the order. \"That will be $6.40 \n\nplease,\" and the man reaches into his pocket and pulls out the exact change \n\nfor payment.The next day, the man and the ostrich come again and the man says, \"I'll \n\nhave a hamburger, fries and a coke,\" and the ostrich says, \"I'll have the \n\nsame.\"Once again the man reaches into his pocket and pays with exact change.This becomes a routine until late one evening, the two enter again.\"The usual?\" asks the waitress. \"No, this is Friday night, so I will have a \n\nsteak, baked potato and salad,\" says the man, \"same for me,\" says the \n\nostrich.A short time later the waitress comes with the order and says, \"That will be \n\n$12.62.\"Once again the man pulls exact change out of his pocket and places \n\nit on the table.The waitress can't hold back her curiosity any longer.\"Excuse me, sir.How do you manage to always come up with the exact change \n\nout of your pocket every time?\"\"Well,\" says the man, \"several years ago I was cleaning the attic and I \n\nfound an old lamp. When I rubbed it a Genie appeared and offered me two \n\nwishes. My first wish was that if I ever had to pay for anything, I would \n\njust put my hand in my pocket and the right amount of money would always be \n\nthere.\"\"That's brilliant!\"says the waitress. \"Most people would wish for a million \n\ndollars or something, but you'll always be as rich as you want for as long \n\nas you live!\"\"That's right. Whether it's a gallon of milk or a Rolls Royce, the exact \n\nmoney is always there,\" says the man.The waitress asks, \"One other thing, sir, what's with the ostrich?\"The man sighs, pauses, and answers, \"My second wish was for a tall chick \n\nwith long legs who agrees with everything I say.\"", "A monkey is sitting in a tree smoking a joint when a lizard walks\n\npast and looks up and says to the monkey,  \"Hey! What are you doing?\"The monkey says, \"Smoking a joint, come up and have some.\"So the lizard climbs up and sits next to the monkey and they have a\n\nfew tokes together.After a while the lizard says his mouth is 'dry' and that he's going\n\nto get a drink from the river.The lizard climbs down the tree, ditty bops on thru the jungle to\n\nthe river and leans over the river to get his drink.Well, the lizard is so stoned that he leans too far over and falls\n\ninto the river.A Crocodile sees this and swims over to the lizard and helps him to\n\nthe side, then asks the lizard, \"What's the matter with you?\"The lizard explains to the crocodile that he was sitting in a tree\n\nand smoking a joint with the monkey and got too stoned and then fell\n\ninto the river while taking a drink.The crocodile says he's gotta check this hippie monkey out and walks\n\noff into the jungle where he finds the tree where the monkey is\n\nstill sitting and toking on the joint.He looks up and says \"hey you!\"The Monkey looks down and says, \"ffuuucccckkkk dude.............how much water did you drink?!!\"", "This is true !! It details what to do if an anaconda attacks you.\n\nExcerpt is from the US Government Peace Corps Manual for volunteers working in the Amazon Jungle.Related to the boa constrictor, the anaconda is the largest snake species in the world. It grows to thirty-five feet in length and weighs 300 to 400 pounds.1. If you are attacked by an anaconda, do not run. The snake is faster than you are.2. Lie flat on the ground. Put your arms tight against your sides, your legs tight against one another.3. Tuck your chin in.4. The snake will begin to nudge and climb over your body.5. Do not panic.6. After the snake has examined you, it will begin to swallow you from the feet end - always from the feet end. Permit the snake to swallow your feet and ankles. Do not panic!7. The snake will now begin to suck your legs into its body. You must lie perfectly still. This will take a long time.8. When the snake has reached your knees, slowly and with as little movement as possible, reach down, take your knife and very gently slide it into the side of the snake's mouth between the edge of its mouth and your leg, then suddenly rip upwards, severing the snake's head.9. Be sure you have your knife.10. Be sure your knife is sharp.", "A city boy, Kenny, moved to the country and bought a donkey from an old farmer for $100.00. The farmer agreed to deliver the donkey the next day, so early in the morning he drove over to Kenny's.Farmer: \"Sorry son, I have some bad news, the donkey died.\"Kenny: \"Well then, just give me my money back.\"Farmer: \"Can't do that. I went and spent it already.\"Kenny: \"OK then, just unload the donkey.\"Farmer: \"What ya gonna do with him?\"Kenny: \"I'm going to raffle him off.\"Farmer: \"You can't raffle off a dead donkey!\"Kenny: \"Sure I can. Watch me. I just won't tell anybody he's dead.\"A month later the farmer met up with Kenny.Farmer: \"What happened with that dead donkey?\"Kenny: \"I raffled him off. I sold 500 tickets at two dollars a piece and made a profit of $898.00.\"Farmer: \"Didn't anyone complain?\"Kenny: \"Just the guy who won. So I gave him his two dollars back.\"Kenneth Lay grew up and eventually became founder, chairman and CEO of Enron Corporation!", "A turkey was chatting with a bull. \"I would love to be Able to get to the top of that tree,\" sighed the turkey, but I haven't got the energy.\"\"Well, why don't you nibble on my droppings?\" replied the bull. \"They're packed with nutrients.\"The turkey pecked at a lump of dung and found that it gave him enough strength to reach the lowest branch of the tree. The next day, after eating some more dung, he reached the second branch. Finally after a fourth night, there he was proudly perched at the top of the tree. Soon he was spotted by a farmer, who shot the turkey out of the tree.Moral of the story: Bullsh*t might get you to the top, but it won't keep you there.", "Three bulls heard via the grapevine that the rancher was going to bring another bull onto the ranch, and the prospect raised a discussion among them.The first bull says, \"Boys, we all know I've been here 5 years. Once we settled our differences, we agreed on which 100 of the cows would be mine. Now, I don't know where this newcomer is going to get HIS cows, but I ain't' givin' him any of mine.\"The second bull says, \"That pretty much says it for me, too. I've been here 3 years and have earned my right to the 50 cows we've agreed are mine. I'll fight 'im till I run him off or kill 'im, but I'M KEEPIN' ALL MY COWS.\"The third bull says, \"I've only been here a year, and so far you guys have only let me have 10 cows to \"take care of\". I may not be as big as you fellows yet, but I am young and virile, so I simply MUST keep all MY cows.\"They had just finished their big talk when an eighteen-wheeler pulls up in the middle of the pasture with only ONE ANIMAL IN IT: the biggest Son-of-Another-Bull these guys had ever seen! At 4700 pounds, each step he took toward the ground strained the steel ramp to the breaking point.The first bull says, \"Ahem...You know, it's actually been some time since I really felt I was doing all my cows justice, anyway. I think I can spare a few for our new friend.\"The second bull says, \"I'll have plenty of cows to take care of if I just stay on the opposite end of the pasture from HIM. I'm certainly not looking for an argument.\"They look over at their young friend, the third bull, and find him pawing the dirt, shaking his horns, and snorting up a storm.The first bull says, \"Son, let me give you some advice real quick. Let him have some of your cows and live to tell about it.\"The third bull says, \"Heck, he can have ALL my cows. I'm just making sure he knows I'M a bull!\"", "A man took his old duck to the Doctor, concerned because the duck wouldn't eat.The Doctor explained to the man that as ducks age their upper bills grow down over their lower bills and make it difficult for the animal to pick up it's food.\"What you need to do is gently file the upper bill down even with the lower bill.But you must be extra careful because the duck's nostrils are located in the upper bill and if you file down too far, when the duck takes a drink of water it'll drown.\"The man goes about his business and about a week later the Doctor runs into his patient.\"Well, how is that duck of yours?\" the Doctor inquires.\"He's dead,\" declared the heartbroken man.\"I told you not to file his upper bill down too far!He took a drink of water and drowned didn't he?\" insisted the Doctor.\"No.\" lamented the man. \"I think he was dead before I took him out of the vise.\"", "Dear Dogs and Cats,The dishes with the paw print are yours and contain your food. The other dishes are mine and contain my food. Please note, placing a paw print in the middle of my plate of food does not stake a claim for it becoming your food and dish, nor do I find that aesthetically pleasing in the slightest.The stairway was not designed by NASCAR and is not a racetrack. Beating me to the bottom is not the object. Tripping me doesn't help because I fall faster than you can run.I cannot buy anything bigger than a king sized bed. I am very sorry about this. Do not think I will continue sleeping on the couch to ensure your comfort. Dogs and cats can actually curl up in a ball when they sleep. It is not necessary to sleep perpendicular to each other stretched out to the fullest extent possible. I also know that sticking tails straight out and having tongues hanging out the other end to maximize space is nothing but sarcasm.For the last time, there is not a secret exit from the bathroom. If by some miracle I beat you there and manage to get the door shut, it is not necessary to claw, whine, meow, try to turn the knob or get your paw under the edge and try to pull the door open. I must exit through the same door I entered. Also, I have been using the bathroom for years - canine or feline attendance is not mandatory.The proper order is kiss me, then go smell the other dog or cat's butt. I cannot stress this enough!To pacify you, my dear pets, I have posted the following message on our front door:Rules for Non-Pet Owners Who Visit and Like to Complain About Our Pets:1. They live here. You don't.2. If you don't want their hair on your clothes, stay off the furniture (That's why they call it \"fur\"niture.)3. I like my pets a lot better than most people.4. To you, it's an animal. To me, he/she is an adopted son/daughter who is short, hairy, walks on all fours and doesn't speak clearly.Dogs and cats are better than kids .they eat less, don't ask for money all the time, are easier to train, usually come when called, never drive your car, don't hang out with drug-using friends, don't smoke or drink, don't worry about having to buy the latest fashions, don't wear your clothes, and don't need a gazillion dollars for college - and if they get pregnant, you can sell their children.", "A blind man was describing his favorite sport, parachuting.\n\nWhen asked how this was accomplished, he said that things were all\n\ndone for him:\"I am placed in the door and told when to jump\"\"My hand is placed on my release ring for me, and out I go\"\"But how do you know when you are going to land?\" he was asked.\"I have a very keen sense of smell and I can smell the trees and grass\n\nwhen I am 300 feet from the ground\" he answered.\"But how do you know when to lift your legs for the final arrival on\n\nthe ground?\" he was again asked.He quickly answered \"Oh, the dog's leash goes slack\".", "One day a man went to an auction. While there, he bid on an exotic parrot. \n\nHe really wanted this bird, so he got caught up in the bidding. He kept on \n\nbidding, but kept getting outbid, so he bid higher and higher and higher.\n\nFinally, after he bid way more than he intended, he won the bid. The fine \n\nbird was finally his! As he was paying for the parrot, he said to the \n\nAuctioneer, \"I sure hope this parrot can talk. I would hate to have paid \n\nthis much for it, only to find out that he can't talk!\"\"Don't worry,\" said the Auctioneer, \"He can talk. Who do you think kept \n\nbidding against you?\"", "Young Chuck, moved to Texas and bought a donkey from a farmer for $100.00.\n\nThe farmer agreed to deliver the donkey the next day. The next day he drove\n\nup and said, \"Sorry son, but I have some bad news, the donkey died.\"Chuck replied, \"Well, then,just give me my money back.\"The farmer said, \"Can't do that. I went and spent it already.\"Chuck said, \"Ok, then, just bring me the dead donkey.\"The farmer asked, \"What ya gonna do with him?Chuck said, \"I'm going to raffle him off.\"The farmer said, \"You can't raffle off a dead donkey!\"Chuck said, \"Sure I can. Watch me. I just won't tell anybody he's dead.\"A month later, the farmer met up with Chuck and asked, \"What happened with\n\nthat dead donkey?\"Chuck said, \"I raffled him off. I sold 500 tickets at two dollars a piece\n\nand made a profit of $898.00.\"The farmer said, \"Didn't anyone complain?\"Chuck said, \"Just the guy who won. So I gave him his two dollars back.\"Chuck grew up and eventually became the chairman of Enron.....", "In light of the rising frequency of human - grizzly bear  \n\nconflicts, the Alaska Department of Fish and Game is  \n\nadvising hikers, hunters, and fishermen to take extra  \n\nprecautions and keep alert of bears while in the field. They \n\n advise that outdoorsmen wear noisy little bells on their  \n\nclothing so as not to startle bears that aren't expecting  \n\nthem. They also advise outdoorsmen to carry pepper spray  \n\nwith them in case of an encounter with a bear. It is also a  \n\ngood idea to watch out for fresh signs of bear activity.  \n\nOutdoorsmen should recognize the difference between black  \n\nbear and grizzly bear dung. Black bear dung is smaller and  \n\ncontains lots of berries and squirrel fur. Grizzly bear dung \n\n has little bells in it and smells like pepper.", "A friend of mine has a big Labrador retriever. While I was buying a large bag of Purina at Wal-Mart for him, a woman behind me in the check out line asked if it was for a dog (duh?).On impulse, I told her no, I was starting The Purina Diet again, although I probably shouldn't because I'd ended up in the hospital last time. I'd lost 50 pounds before I awakened in an intensive care ward with tubes coming out of most of my orifices and IVs in both arms. I told her that it was essentially a perfect diet. The way that it works is you load all your pockets with Purina nuggets and simply eat one or two every time you feel hungry. The food is nutritionally complete so I was going to try it again.I have to mention here that practically everyone in the line was by now enthralled with my story, particularly a tall guy who was behind her.Horrified, she asked if I ended up in the hospital last time because I'd been poisoned. I told her no; I was sitting in the street licking my balls when a car hit me. I thought the guy behind her was going to have a cardiac, and would require need help as he laughed so hard he fell to the floor.", "The only cow in a small town in Arkansas stopped giving milk. The\n\npeople did some research and found they could buy a cow in North\n\nCarolina, for $200.00.They bought the cow from N. C. and the cow was wonderful. It\n\nproduced lots of milk all of the time, and the people were pleased\n\nand very happy.They decided to acquire a bull to mate with the cow and produce more\n\ncows like it. They would never have to worry about their milk\n\nsupply again They bought a bull and put it in the pasture with their\n\nbeloved cow.However, whenever the bull came close to the cow, the cow would move away.No matter what approach the bull tried, the cow would move away from\n\nthe bull and he could not succeed in his quest. The people were\n\nvery upset and decided to ask the local Vet; who was very wise; what to do.They told the Vet what was happening. \"Whenever the bull approaches\n\nour cow, she moves away. If he approaches from the back, she moves forward.When he approaches her from the front, she backs off. An approach\n\nfrom the side and she walks away to the other side.\"The Vet thinks about this for a minute and asked, \"Did you buy this\n\ncow in North Carolina?\"The people were dumbfounded, since they had never mentioned where\n\nthey bought the cow. \"You are truly a wise Vet,\" they said. \"But\n\nhow did you know we got the cow in North Carolina?\"The Vet replied with a distant look in his eye; \"My wife is from\n\nNorth Carolina.\"", "A man took his old duck to the Doctor, concerned because the \n\n duck  wouldn't eat.The Doctor explained to the man that as ducks age their  \n\nupper  bills grow down over their lower bills and make it  \n\ndifficult for  the animal to pick up it's food.\"What you need to do is gently file the upper bill down even \n\n with  the lower bill. But you must be extra careful because \n\n the duck's  nostrils are located in the upper bill and if  \n\nyou file down too  far, when the duck takes a drink of water \n\n it'll drown.\"The man goes about his business and about a week later the  \n\nDoctor  runs into his patient.\"Well, how is that duck of yours?\" the Doctor inquires.\"He's dead.\" declared the heartbroken man.\"I told you not to file his upper bill down too far! He took \n\n a  drink of water and drowned didn't he?\" insisted the  \n\nDoctor.\"No.\" lamented the man. \"I think he was dead before I took  \n\nhim  out of the vise.\"", "A Hawaii woodpecker and a California woodpecker were arguing about which\n\nplace had the toughest trees. The Hawaii woodpecker said Hawaii had a tree\n\nthat no woodpecker could peck. The California woodpecker accepted his\n\nchallenge, and promptly pecked a hole in the tree with no problem. The\n\nHawaiian woodpecker was in awe.The California woodpecker then challenged the Hawaiian woodpecker to peck\n\na tree in California that was absolutely unpeckable. The Hawaiian\n\nwoodpecker expressed confidence he could do it, so accepted the challenge.\n\nAfter flying to California, the Hawaii woodpecker successfully pecked the\n\ntree with no problem.So the two woodpeckers were now confused. How is it that the Californian\n\nwoodpecker was able to peck the Hawaiian tree and the Hawaiian woodpecker\n\nwas able to peck the Californian tree, but neither one was able to peck\n\nthe tree in their own state?After much woodpecker-pondering, they both came to the same conclusion -\n\nyour pecker is always harder when you're away from home.", "A chicken and an egg are lying in bed.The chicken is leaning against the headboard smoking a cigarette,\n\nwith a satisfied smile on its face. The egg, looking a bit pissed\n\noff, grabs the sheet, rolls over, and says,\"Well, I guess we finally answered THAT question!\"", "An out-of-towner drove his car into a ditch in a desolated area. Luckily, a local farmer came to help with his big strong horse named Buddy. He hitched Buddy up to the car and yelled, \"Pull, Nellie, pull!\" \n\nBuddy didn't move. Then the farmer hollered, \"Pull, Buster, pull!\" Buddy didn't respond. Once more the farmer commanded, \"Pull, Coco, pull!\" Nothing. Then the farmer nonchalantly said, \"Pull, Buddy, pull!\" \n\nAnd the horse easily dragged the car out of the ditch.The motorist was most appreciative and very curious. He asked the farmer why he called his horse by the wrong name three times.\"Well... Buddy is blind and if he thought he was the only one pulling, he wouldn't even try!\"", "A highly timid little man, ventured into a biker bar in the Bronx and clearing his throat asked, \"Um, err, which of you gentlemen owns the Doberman tied outside to the parking meter?\"A giant of a man, wearing biker leathers, his body hair growing out through the seams, turned slowly on his stool, looked down at the quivering little man and said, \"It's my dog. Why?\"\"Well,\" squeaked the little man, obviously very nervous, \"I believe my dog just killed it, sir.\"\"What?\" roared the big man in disbelief. \"What in the hell kind of dog do you have?\"\"Sir,\" answered the little man, \"it's a little four week old female puppy.\"\"Bull!\" roared the biker, \"how could your puppy kill my Doberman?\"\"It appears that your dog choked on her, sir.\"", "A dog thinks, \"Hey, these people I live with feed me, love me, provide me with a nice warm, dry house, pet me, and take good care of me. They must be Gods!\"A cat thinks, \"Hey, these people I live with feed me, love me, provide me with a nice warm, dry house, pet me, and take good care of me. I must be a God!\"", "A frog goes into a bank and approaches the teller. He can see from her nameplate that her name is Patricia Whack.\n\n\"Miss Whack, I'd like to get a $30,000 loan to take a holiday.\"Patty looks at the frog in disbelief and asks his name. The frog says his name is Kermit Jagger, his dad is Mick Jagger, and that it's okay, he knows the bank manager.\n\nPatty explains that he will need to secure the loan with some collateral.The frog says, \"Sure . I have this,\" and produces a tiny porcelain elephant, about an inch tall, bright pink and perfectly formed.Very confused, Patty explains that she'll have to consult with the bank manager and disappears into a back office.\n\nShe finds the manager and says, \"There's a frog called Kermit Jagger out there who claims to know you and wants to borrow $30,000, and he wants to use this as collateral.\"\n\nShe holds up the tiny pink elephant. \"I mean, what in the world is this?\"The bank manager looks back at her and says...\"It's a knickknack, Patty Whack. Give the frog a loan. His old man's a Rolling Stone.\"", "There was a fly buzzing around a barn one day when he happened on a pile of fresh cow manure. Due to the fact that it had been hours since his last meal, he flew down and began to eat. He ate and ate and ate. Finally, he decided he had eaten enough and tried to fly away. He had eaten too much though, and could not get off the ground. As he looked around wondering what to do now, he spotted a pitchfork leaning up against the wall. He climbed to the top of the handle and jumped off, thinking that once he got airborne, he would be able to take flight. Unfortunately he was wrong and dropped like a rock, splatting when he hit the floor.The moral to the story is: Never fly off the handle when you're full of sh*t.", "A man calls the Animal Control in his town, because there is a crazed gorilla on his roof, and he can't figure out how to get it down safely. Soon, a van pulls up, and an old man gets out, carrying a small dog, a baseball bat, and a gun. He hands the man the gun.''Okay, here's what we do. I'm going to go up onto your roof, and threaten the gorilla with this baseball bat until he falls down. When he falls down, this little dog will bite him in the balls until he's incapacitated.''''Great,'' says the man. ''But what's the gun for?''''In case I fall down instead of the gorilla, shoot the dog.''", "Far away in the tropical waters of the Caribbean,  two prawns\n\nwere swimming around in the sea - one called Justin & the\n\nother called Christian.The prawns were constantly being harassed & threatened by\n\nsharks that inhabited the area.  Finally one day Justin said to\n\nChristian, \"I'm fed up with being a prawn, I wish I was a shark,\n\nthen I wouldn't have any worries about being eaten.\"A large mysterious cod appeared & said, \"Your wish is granted\"\n\n& lo & behold, Justin turned into a shark.Horrified, Christian immediately swam away, afraid of being\n\neaten by his old mate.Time passed (as it invariably does) & Justin found life as a shark\n\nboring & lonely. All his old mates simply swam away whenever\n\nhe came close to them. Justin didn't realize that his new menacing\n\nappearance was the cause of his sad plight.While swimming alone one day he saw the mysterious cod again\n\n& he thought perhaps the mysterious fish could change him back\n\ninto a prawn. He approached the cod & begged to be changed\n\nback, & lo & behold, he found  himself turned back into a prawn.With tears of joy in his tiny little eyes Justin swam back to his\n\nfriends & bought them all a cocktail.Looking around the gathering at the reef he realized he couldn't see\n\nhis old  pal. \"Where's Christian?\" he asked.\"He's at home, still distraught that his best friend changed sides to the\n\nenemy & became a shark\",came the reply.Eager to put things right again & end the mutual pain & torture, he\n\nset off to Christian's abode.As he opened the coral gate memories came flooding back. He\n\nbanged on the door & shouted, \"It's me, Justin, your old friend,\n\ncome out & see me again.\"Christian replied,\"No way man, you'll eat me. You're now a shark,\n\nthe enemy, & I'll not be tricked into being your dinner.\"Justin cried back \"No, I'm not. That was the old me. I've changed....\n\nI've found Cod.  I'm a Prawn again Christian.\"", "Entries in a Dog's Diary:7 am - Oh boy! A walk! My favorite!8 am - Oh boy! Dog food! My favorite!9 am - Oh boy! The kids! My favorite!Noon - Oh boy! The yard! My favorite!2 pm - Oh boy! A car ride! My favorite!3 pm - Oh boy! The kids! My favorite!4 pm - Oh boy! Playing ball! My favorite!6 pm - Oh boy! Welcome home Mom! My favorite!7 pm - Oh boy! Welcome home Dad! My favorite!8 pm - Oh boy! Dog food! My favorite!9 pm - Oh boy! Tummy rubs on the couch! My favorite!11 pm -Oh boy! Sleeping in my people's bed! My favorite!Entries in a Cat's Diary:Day 183 of my captivity ... My captors continued to taunt me with bizarre little dangling objects. They dine lavishly on fresh meat, while I am forced to eat dry cereal.The only thing that keeps me going is the hope of escape, and the mild satisfaction I get from clawing the furniture.Tomorrow I may eat another house plant.Today my attempt to kill my captors by winding around their feet while they were walking almost succeeded. Must try this at the top of the stairs.In an attempt to disgust and repulse these vile oppressors, I once again induced myself to vomit on their favorite chair. Must try this on their bed.Decapitated a mouse and brought them the headless body in an attempt to make them aware of what I am capable of, and to try to strike fear in their hearts. They only cooed and condescended about what a good little cat I was. Hmmm, not working according to plan.There was some sort of gathering of their accomplices. I was placed in solitary throughout the event. However, I could hear the noise and smell the food. More important, I overheard that my confinement was due to my powers of inducing \"allergies.\" Must learn what this is and how to use it to my advantage.I am convinced the other captives are flunkies and maybe snitches.The dog is routinely released and seems more than happy to return. He is obviously a half-wit.The bird, on the other hand, has got to be an informant. She speaks with them regularly. I am certain she reports my every move. Due to her current placement in the metal container, her safety is assured.But I can wait; it is only a matter of time.", "Dogs' Views on Changing Light BulbsHow many dogs does it take to change a light bulb? Depends on the dog's point of view....GOLDEN RETRIEVER: The sun is shining, the day is young, we've got our whole lives ahead of us, and you're inside worrying about a stupid burned out bulb?BORDER COLLIE: Just one. And then I'll replace any wiring that's not up to code.DACHSHUND: You know I can't reach that stupid bulb!ROTTWEILER: Make me.LAB: Oh, me, me!!!! Pleeeeeeze let me change the light bulb! Can I? Can I? Huh? Huh? Huh? Can I?MALAMUTE: Let the Border Collie do it. You can feed me while he's busy.JACK RUSSELL TERRIER: I'll just pop it in while I'm bouncing off the walls and furniture.POODLE: I'll blow in the Border Collie's ear and he'll do it. By the time he finishes rewiring the house, my nails will be dry.COCKER SPANIEL: Why change it? I can pee on the carpet in the dark.DOBERMAN PINSCHER: While it's dark, I'm going to sleep on the sofa.BOXER: Who cares? I can play with my squeaky toys in the dark.MASTIFF: Mastiffs are NOT afraid of the dark.CHIHUAHUA: Yo quiero Taco Bulb.IRISH WOLFHOUND: Can somebody else do it? I've got this hangover and..........POINTER: I see it, there it is, there it is, right there!GREYHOUND: It isn't moving. Who cares?AUSTRALIAN SHEPHERD: First, I'll put all the light bulbs in a little circle....OLD ENGLISH SHEEP DOG: Light bulb? That thing I just ate was a light bulb?HOUND DOG: ZZZZZZZZZZZZZZZZZZZZZZZZZZZZAnd the CAT: Dogs do not change light bulbs. People change light bulbs and I am not one of them. So, the question is, how long will it be before I get some light in here?", "Calling in sick to work makes me uncomfortable. No matter how legitimate my excuse, I always get the feeling that my boss thinks I'm lying. On one recent occasion, I had a valid reason but lied anyway, because the truth was just too darned humiliating. I simply mentioned that I had sustained a head injury, and I hoped I would feel up to coming in the next day.By then, I reasoned, I could think up a doozy to explain the bandage on the top of my head. The accident occurred mainly because I had given in to my wife's wishes to adopt a cute little kitty. Initially, the new acquisition was no problem. Then one morning, I was taking my shower after breakfast when I heard my wife, Deb, call out to me from the kitchen. \"Honey! The garbage disposal is dead again. Please come reset it.\" \"You know where the button is, \"I protested through the shower pitter-patter and steam. \"Reset it yourself!\"\"But I'm scared!\" she persisted. \"What if it starts going and sucks me in?\" There was a meaningful pause and then, \"C'mon, it'll only take you a second\" So out I came, dripping wet and buck naked, hoping that my silent outraged nudity would make a statement about how I perceived her behavior as extremely cowardly. Sighing loudly, I squatted down and stuck my head under the sink to find the button. It is the last action I remember performing.It struck without warning, and without any respect to my circumstances.No, it wasn't the hexed disposal, drawing me into its gnashing metal teeth. It was our new kitty, who discovered the fascinating dangling objects she spied hanging between my legs. She had been poised around the corner and stalked me as I reached under the sink. And, at the precise moment when I was most vulnerable, she leapt at the toys I unwittingly offered and snagged them with her needle-like claws. I lost all rational thought to control orderly bodily movements, blindly rising at a violent rate of speed, with the full weight of a kitten hanging from my masculine region.Wild animals are sometimes faced with a \"fight or flight\" syndrome. Men in this predicament, choose only the \"flight\" option. I know this from experience. I was fleeing straight up into the air when the sink and cabinet bluntly and forcefully impeded my ascent. The impact knocked me out cold.When I awoke, my wife and the paramedics stood over me. Now there are not many things in this life worse than finding oneself lying on the kitchen floor buck naked in front of a group of \"been-there,done-that\" paramedics. Even worse, having being fully briefed by my wife, the paramedics were all snorting loudly as they tried to conduct their work,all the while trying to suppress their hysterical laughter... and not succeeding.Somehow I lived through it all. A few days later I finally made it back in to the office, where colleagues tried to coax an explanation out of me about my head injury. I kept silent, claiming it was too painful to talk about, which it was.\"What's the matter?\" They all asked, \"Cat got your tongue?\"If they only knew.....", "A man took his old duck to the Doctor, concerned because the \n\nduck  wouldn't eat.The Doctor explained to the man that as ducks age their   \n\nupper  bills grow down over their lower bills and make it   \n\ndifficult for  the animal to pick up it's food.\"What you need to do is gently file the upper bill down even \n\nwith  the lower bill. But you must be extra careful because \n\nthe duck's  nostrils are located in the upper bill and if   \n\nyou file down too  far, when the duck takes a drink of water \n\nit'll drown.\"The man goes about his business and about a week later the   \n\nDoctor  runs into his patient.\"Well, how is that duck of yours?\" the Doctor inquires.\"He's dead.\" declared the heartbroken man.\"I told you not to file his upper bill down too far! He took \n\na  drink of water and drowned didn't he?\" insisted the   \n\nDoctor.\"No.\" lamented the man. \"I think he was dead before I took   \n\nhim  out of the vise.\"", "After a day fishing on Lake Michigan, a fisherman is walking \n\nfrom the pier carrying two brown trout in a bucket. He is   \n\napproached by a Conservation Officer who asks him for his   \n\nfishing license.The fisherman says to the warden, \"I was not fishing and I   \n\ndid not catch these browns, they are my pets. Every day I   \n\ncome down to the water and dump these fish into the water   \n\nand take them for a walk to the end of the pier and back.   \n\nWhen I'm ready to go I whistle and they jump back into the   \n\nbucket and we go home.  The officer not believing him,   \n\nreminds him that it is illegal to fish without a license.The fisherman turns to the warden and says, \"If you don't   \n\nbelieve me then watch,\" as he throws the trout back into the \n\nwater.The warden says, \"Now whistle to your fish and show me that   \n\nthey will jump out of the water and into the bucket.\"The fisherman turns to the officer and says, \"What fish?\"", "A farmer in the country noticed that a gentleman would fish   \n\nat the lake (close to the farmer's house) and would always   \n\nleave with a stringer full of fish.The fellow had a boat but a fishing pole was not to be seen. \n\nThe farmer mentioned the situation to the game warden. The   \n\nwarden then started watching this man and all that the   \n\nfarmer said was true! The man would arrive at the lake in   \n\nthe morning and by early afternoon, he had a stringer full   \n\nof fish.The warden dressed like a fisherman one day and approached   \n\nthe man. They exchanged pleasantries and the stranger asked   \n\nthe warden in disguise to come fish with him. They boated   \n\nfor 45 minutes and arrived at a secluded spot.The stranger then pulled out a stick of dynamite. The warden \n\nsaid, \"I'm going to have to place you under arrest--I am a   \n\ngame warden and you are fishing illegally!\"The stranger calmly lit the stick of dynamite and handed it   \n\nto the warden. The stranger then said, \"Are you gonna talk   \n\nor fish?\"", "An Amish lady is trotting down the road in her horse and buggy\n\nwhen she is pulled over by a cop.\"Ma'am, I'm not going to ticket you, but I do have to issue you a\n\nwarning. You have a broken reflector on your buggy.\"\"Oh, I'll let my husband, Jacob, know as soon as I get home.\"\"That's fine. Another thing, ma'am. I don't like the way that one\n\nrein loops across the horse's back and around one of his balls. I\n\nconsider that animal abuse. That's cruelty to animals. Have your\n\nhusband take care of that right away!\"Later that day, the lady is home telling her husband about her\n\nencounter with the cop.\"Well, dear, what exactly did he say?\"\"He said the reflector is broken.\"\"I can fix that in two minutes. What else?\"\"I'm not sure, Jacob ... something about the emergency brake.\"", "Once upon a time there was a non-conforming sparrow who decided not to fly south for the winter. However, soon the weather turned so cold that he reluctantly decided to fly south. In a short time ice began to form on his wings and he fell to Earth in a barnyard, nearly frozen solid. A cow passed by where he had fallen, and crapped on the little sparrow.The sparrow thought it was the end, but the manure warmed him and defrosted his wings!Warm and happy, able to breath, he started to sing.Just then a large cat came by, and hearing the chirping he investigated the sounds. The cat cleared away the manure, found the chirping bird, and promptly ate him.The Moral of the Story:Everyone who craps on you is not necessarily your enemyEveryone who gets you out of crap is not necessarily your friend.And if you're warm and happy in a pile of crap, you might just want to keep your mouth shut.", "Irish greyhound racing authorities have banned trainers from giving\n\ndogs the anti-impotence drug Viagra in case it is used to boost their\n\nperformance on the track...\" and \"... Viagra could be used to raise\n\nthe dogs' blood pressure and therefore heart rate, making them run\n\nfaster in the early stages of a race.\"If Viagra really does offer an advantage to these dogs, wouldn't the\n\nwhole plan backfire? I mean, come on, it'd be really easy to spot\n\nwhich one was going to be the winner, wouldn't it? \".. and it looks\n\nlike the winner is going to be Rover, by a nose... wait, that's not\n\nhis nose...\"", "A mother and a baby camel were talking one day when the baby camel\n\nasked, \"Mom, why do we have these huge three-toed feet?\"The mother replied, \"Well son, when we trek across the desert, our\n\ntoes will help us stay on top of the soft sand.\"Two minutes later the young camel asked, \"Mom, why do we have these\n\nlong eyelashes?\"They are there to keep the sand out of our eyes on the trips through\n\nthe desert,\" the mother said.\"Mom, why have we got these great big humps on our back?\"\"They are there to help us store water for our long treks across the\n\ndesert, so we can go without drinking for long periods of time.\"\"So we have huge feet to stop us from sinking, long eyelashes to keep\n\nthe sand out of our eyes, and these humps to store water.\"\"Yes dear,\" said the mother.\"So why are we in the San Diego Zoo?\"", "An engineer was crossing a road one day when a frog called out to him and \n\nsaid, \"If you kiss me, I'll turn into a beautiful princess.\"\n\nHe bent over, picked up the frog and put it in his pocket.The frog spoke up again and said, \"If you kiss me and turn me back into a \n\nbeautiful princess, I will stay with you for one week.\"The engineer took the frog out of his pocket, smiled at it and returned it \n\nto the pocket.The frog then cried out, \"If you kiss me and turn me back into a princess, \n\nI'll stay with you and do ANYTHING you want.\"Again the engineer took the frog out, smiled at it and put it back into his \n\npocket.Finally, the frog asked, \"What is the matter? I've told you I'm a beautiful \n\nprincess, that I'll stay with you for a week and do anything you want. Why \n\nwon't you kiss me?\"The engineer said, \"Look I'm an engineer.I don't have time for a girlfriend, but a talking frog, now that's cool.\"", "I believe that earlier this year the US Postal Service also issued a set of\n\nstamps featuring american racehorses.This must be one of the great ironies of the horse racing industry. If a\n\nhorse wins its races it gets put on the front of a postage stamp. If it\n\nloses it gets put on the back!", "A teacher is explaining biology to her 4th grade students. 'Human beings  are the only animals that stutter', she says.A little girl raises her hand. 'I had a kitty-cat who stuttered', she\n\nvolunteered.The teacher, knowing how precious some of these stories could become,\n\nasked the girl to describe the incident.'Well', she began, 'I was in the back yard with my kitty and the\n\nRottweiler that lives next door got a running start and before we knew it, he jumped over the fence into our yard!''That must've been scary', said the teacher.'It sure was', said the little girl. 'My kitty raised his back, went\n\n'Fffff, Fffff, Fffff'...And before he could say 'F*ck', the Rottweiler\n\nate him!'The teacher wet her pants laughing.......", "This postman is working on a new beat. He comes to a garden gate marked BEWARE OF THE PARROT! He looks down the garden and, sure enough, there's a parrot sitting on its perch. He has a little chuckle to himself at the sign and the parrot there on its perch. He opens the gate and walks into the garden.He gets as far as the parrot's perch, when suddenly, it calls out: \"REX, ATTACK!\"", "Two ducks were flying South for Winter when an Airforce jet overtook them at around mach 5...After about 40 mid-air somersaults and feathers flying everywhere, they managed to compose themselves and one duck says to the other: \"DID YOU SEE THAT?\"\"I SURE DID!!!!!\" says the other duck.\"AND GEEZ, WASN\"T HE MOVING!!!!\"\"He sure was,\" says the other duck: \"but so would you if you had two assh*les and both were on fire!\"", "There was a fly buzzing around a barn one day when she happened upon a pile of fresh cow manure. Due to the fact that it had been hours since she had had her last meal, she flew down and began to eat. She ate and ate. Finally, she decided she had eaten enough and tried to fly away. She had eaten too much though, and could not get off the ground. As she looked around wondering what to do, she spotted a pitchfork leaning up against the wall. She climbed to the top of the handle and jumped off, thinking that once she got airborne, she would be able to take flight. Unfortunately she was wrong and she dropped like a rock, and smashed when she hit the floor. Dead!ARE YOU READY FOR THE MORAL OF THE STORY?Never fly off the handle when you know you're full of shi*t.", "Dave came home from the pub late one Friday evening stinking\n\ndrunk, as he often did, and crept into bed beside his wife who was\n\nalready asleep.He gave her a peck on the cheek and fell asleep. When he awoke, he\n\nfound a strange man standing at the end of his bed. 'Who the hell are\n\nyou?', demanded Dave, 'and what are you doing in my bedroom ?'The mysterious man answered, 'This isn't your bedroom and I'm St Peter.'Dave was stunned. 'You mean I'm dead !!! That can't be, I have so much\n\nto live for - and I haven't said goodbye to my family. . .. You've got\n\nto send me back straight away.'St Peter replied, 'Yes, you can be reincarnated but there is a catch.\n\nWe can only send you back as a dog or a hen.'Dave was devastated, but knowing there was a farm not far from his\n\nhouse, he asked to be sent back as a hen.A flash of light later, he was covered in feathers and clucking\n\naround, pecking the ground.'This ain't so bad', he thought until he felt this strange feeling\n\nwelling up inside him. The farmyard rooster strolled over and said,\n\n'So you're the new hen, How are you enjoying your first day here ?''It's not so bad', replies Dave, 'but I have this strange feeling\n\ninside like I'm about to explode.''You're ovulating', explained the rooster. 'Don't tell me you've never\n\nlaid an egg before.''Never', replies Dave.'Well just relax and let it happen'.And so he did and after a few uncomfortable seconds later, an egg pops\n\nout from under his tail. An immense feeling of relief swept over him\n\nand his emotions got the better of him as he experienced motherhood\n\nfor the first time.When he laid his second egg, the feeling of happiness was overwhelming\n\nand he knew that being reincarnated as a hen was the best thing that\n\never happened to him . . . Ever!!!The joy kept coming and as he was just about to lay his third egg, he\n\nfelt an enormous smack on the back of his head and heard his wife\n\nshouting...'Dave, wake up, you drunken bastard. You've crapped the bed!..", "1. The later you are, the more excited your dogs are to see you.2. Dogs don't notice if you call them by another dog's name.3. Dogs like it if you leave a lot of things on the floor.4. A dog's parents never visit.5. Dogs agree that you have to raise your voice to get your point across.6. You never have to wait for a dog; they're ready to go 24 hours a day.7. Dogs find you amusing when you're drunk.8. Dogs like to go hunting and fishing.9. A dog will not wake you up at night to ask, If I died, would you get\n\nanother dog??10. If a dog has babies, you can put an ad in the paper and give them away.11. A dog will let you put a studded collar on it without calling you a\n\npervert.12. If a dog smells another dog on you, they don't get mad. They just think\n\nit's interesting..13. Dogs like to ride in the back of a pickup truck.And last, but not least:14. If a dog leaves, it won't take half of your stuff.", "An old, tired-looking dog wandered into the yard. I could tell from his collar and well-fed belly that he had a home.He followed me into the house, down the hall, and fell asleep on the couch. An hour later, he went to the door, and I let him out. The next day he was back, resumed his position on the couch and slept for an hour. This continued for several weeks. Curious, I pinned a note to his collar: \"Every afternoon your dog comes to my house for a nap.\"The next day he arrived with a different note pinned to his collar: \"He lives in a home with four children -- he's trying to catch up on his sleep. Can I come with him tomorrow?\"", "Mrs. Peterson phoned the repairman because her dishwasher quit working.He couldn't accommodate her with an \"after-hours\" appointment and since she had to go to work, she told him, \"I'll leave the key under the mat. Fix the dish washer, leave the bill on the counter, and I'll mail you a check. By the way, I have a large rotweiler inside named Killer; he won't bother you. I also have a parrot, and whatever you do, do not talk to the bird!\"Well, sure enough the dog, Killer, totally ignored the repairman, but the whole time he was there, the parrot cursed, yelled, screamed, and about drove him nuts.As he was ready to leave, he couldn't resist saying, \"You stupid bird, why don't you shut up!\" To which the bird replied, \"Killer, get him!\"", "A mother and baby camel are talking one day when the baby camel asks, \"Mom, why have I got these huge three toed feet?\"The mother replies, \"Well son, when we trek across the desert your toes will help you to stay on top of the soft sand.\"\"Okay,\" says the son.A few minutes later the son asks, \"Mom, why have I got these great long eyelashes?\"\"They are there to keep the sand out of your eyes on the trips through the desert.\"\"Thanks Mom,\" replies the son.After a short while, the son returns and asks, \"Mom, why have I got these great big humps on my back??\"His mother replies impatiently, \"They are there to help us store water for our long treks across the desert.\"\"That's great Mom. So we have huge feet to stop us sinking, and long eyelashes to keep the sand from our eyes, and these humps to store water, but Mom...\"\"Yes, son?\"\"Do we really need all of these in the zoo?\"", "A police officer came upon a terrible wreck where the driver and passenger had been killed. As he looked upon the wreckage a little monkey came out of the brush and hopped around the crashed car.The officer looked down at the monkey and said \"I wish you could talk.\"The monkey looked up at the officer and shook his head up and down. \"You can understand what I'm saying?\" asked the officer.Again, the monkey shook his head up and down. \"Well, did you see this?\"\"Yes,\" motioned the monkey.\"What happened?\"The monkey pretended to have a can in his hand and turned it up by his mouth.\"They were drinking?\" asked the officer.The monkey shakes his head \"Yes.\"\"What else?\" The monkey pinched his fingers together and held them to his mouth.\"They were smoking marijuana?\"The monkey shakes his head \"Yes.\"\"What else?\" The monkey motioned \"kissing.\"\"They were kissing, too?\" asked the astounded officer.The monkey shakes his head \"Yes.\"\"Now wait, you're saying your owners were drinking, smoking and kissing before they wrecked.\"The monkey shakes his head \"Yes.\"\"What were you doing during all this?\"\"Driving,\" motioned the monkey.", "A farmer named Clyde had a car accident. In court, the trucking company's fancy lawyer was questioning Clyde.\"Didn't you say, at the scene of the accident, 'I'm fine,'?\" asked the lawyer.Clyde responded, \"Well, I'll tell you what happened. I had just loaded my favorite mule, Bessie...\"\"I didn't ask for any details\", the lawyer interrupted. \"Just answer the question. Did you not say, at the scene of the accident, 'I'm fine!'?\"Clyde said, \"Well, I had just got Bessie into the trailer and I was driving down the road.....\"The lawyer interrupted again and said, \"Judge, I am trying to establish the fact that, at the scene of the accident, this man told the Highway Patrolman on the scene that he was just fine. Now several weeks after the accident he is trying to sue my client. I believe he is a fraud.Please tell him to simply answer the question.\"By this time, the Judge was fairly interested in Clyde's answer and said to the lawyer, \"I'd like to hear what he has to say about his favorite mule, Bessie\".Clyde thanked the Judge and proceeded.\"Well as I was saying, I had just loaded Bessie, my favorite mule, into the trailer and was driving her down the highway when this huge semi-truck and trailer ran the stop sign and smacked my truck right in the side.\n\nI was thrown into one ditch and Bessie was thrown into the other. I was hurting, real bad and didn't want to move. However, I could hear ole Bessie moaning and groaning.\n\nI knew she was in terrible shape just by her groans. Shortly after the accident a Highway Patrolman came on the scene. He could hear Bessie moaning and groaning so he went over to her. After he looked at her, and saw her fatal condition, he took out his gun and shot her between the eyes.Then the Patrolman came across the road, gun still in hand, looked at me and said, \"How are you feeling?\"\"Now what the hell would you say?\"", "A monkey is sitting in a tree smoking a joint when a lizard walks past and looks up and says to the monkey \"Hey! What are you doing?\"The monkey says \"Smoking a joint, come up and have some.\"So the lizard climbs up and sits next to the monkey and they share a joint. After a while the lizard says his mouth is 'dry' and is going to get a drink from the river.The lizard climbs down the tree, walks thru the jungle to the river and leans over the river to get his drink. The lizard is so stoned that he leans too far over and falls into the river.A Crocodile sees this and swims over to the lizard and helps him to the side, then asks the lizard, \"What's the matter with you?\"The lizard explains to the crocodile that he was sitting smoking a joint with a monkey in a tree, got too stoned and then fell into the river while taking a drink.The crocodile says he has to check this out and walks into the jungle, finds the tree where the monkey is sitting, finishing a joint. He looks up and says \"Hey you!\"The Monkey looks down and says, \"Duuuuuuuuuude.......how much water did you drink?!\"", "A frog goes into a bank and approaches the teller. He can see from her nameplate that her name is Patricia Whack.'Miss Whack, I'd like to get a $30,000 loan to take a holiday.'Patty looks at the frog in disbelief and asks his name. The frog says his name is Kermit Jagger, his dad is Mick Jagger, and that it's okay, he knows the bank manager.Patty explains that he will need to secure the loan with some collateral.The frog says, 'Sure. I have this,' and produces a tiny porcelain elephant, about an inch tall, bright pink and perfectly formed.Very confused, Patty explains that she'll have to consult with the bank manager and disappears into a back office.She finds the manager and says, 'There's a frog called Kermit Jagger out there who claims to know you and wants to borrow $30,000, and he wants to use this as collateral.'She holds up the tiny pink elephant. 'I mean, what in the world is this?'(you're gonna love this)The bank manager looks back at her and says...'It's a knickknack, Patty Whack. Give the frog a loan, His old man's a Rolling Stone.'(You're singing it, aren't you? Yeah, I know you are........)Never take life too seriously! Come on now, you grinned, I know you did!!!", "This guy was so lonely that he decided life would be more fun\n\nif he had a pet. So he went to the pet store and told\n\nthe owner that he wanted to buy an unusual pet.After some discussion he finally bought a centipede (100-leg\n\nbug), which came in a little white box to use for his house.He took the box home, found a good location for the box, and\n\ndecided he would start off by taking his new pet to the bar\n\nfor a drink. So, he asked the centipede in the box, \"Would\n\nyou like to go to Frank's place with me and have a beer?\"But there was no answer from his new pet. This bothered him\n\na bit, but he waited a few minutes and then asked him again,\n\n\"How about going to the bar and having a drink with me?\"But again there was no answer from his new friend and pet.\n\nSo he waited a few minutes more, thinking about the\n\nsituation. He decided to ask him one more time, this time\n\nputting his face up against the centipede's house and\n\nshouting, \"Hey, in there! Would you like to go to Frank's\n\nplace and have a drink with me?\"A little voice came out of the box:\"I heard you the first time! I'm putting my shoes on!\"", "Two campers where hiking in the forest when all of a sudden a bear jumps out of a bush and starts chasing them.Both campers start running for their lives when one of them stops and starts to put on his running shoes.His partner says, \"What are you doing? You can't outrun a bear!\"His friend replies, \"I don't have to outrun the bear, I only have to outrun you!\"", "This lady found out her dog could hardly hear so she took it to the veterinarian. He found that the problem was hair in its ears. He cleaned both ears and the dog could hear fine. The vet then proceeded to tell the lady that if she wanted to keep this from recurring she should go to the store and get some \"Nair\" hair remover and rub it in the dog's ears once a month.The lady goes to the drug store and gets some \"Nair\" hair remover.At the register the druggist tells her, \"If you're going to use this under your arms don't use deodorant for a few days.\"The lady says: \"I'm not using it under my arms.\"The druggist says: \"If you're using it on your legs don't shave for a couple of days.\"The lady says: \"I'm not using it on my legs either; if you must know, I'm using it on my schnauzer..\"The druggist says: \"Stay off your bicycle for at least a week.\"", "A life-long city man, tired of the rat race, decided he was going to\n\ngive up the city life, move to the country, and become a chicken\n\nfarmer. He found a nice, used chicken farm, which he bought. Turns\n\nout that his next door neighbor was also a chicken farmer. The\n\nneighbor came for a visit one day and said, \"Chicken farming isn't\n\neasy. Tell you what. To help you get started, I'll give you 100\n\nchickens.\"The new chicken farmer was thrilled. Two weeks later the new\n\nneighbor stopped by to see how things were going. The new farmer\n\nsaid, \"Not too good. All 100 chickens died.\"The neighbor said, \"Oh,\n\nI can't believe that. I've never had any trouble with my chickens.\n\nI'll give you 100 more.\"Another two weeks went by, and the neighbor stops in again. The new\n\nfarmer says, \"You're not going to believe this, but the second 100\n\nchickens died too.\"Astounded, the neighbor asked, \"what went wrong?\n\nWhat did you do to them?\"Well, says the new farmer, \"I'm not sure whether I'm planting them too\n\ndeep or not far apart enough.\"", "", "Three Little Pigs went out to dinner one night.. The waiter came and took their drink order.'I would like a Sprite,' said the first little piggy.'I would like a Coke,' said the second little piggy.'I want beer, lots and lots of beer,' said the third little piggy.The drinks were brought out and the waiter took their orders for dinner'I want a nice big steak,' said the first piggy..'I would like the salad plate,' said the second piggy.'I want beer, lots and lots of beer,' said the third little piggy.The meals were brought out and a while later the waiter approached the table and asked if the piggies would like any dessert.'I want a banana split,' said the first piggy.'I want a cheesecake,' said the second piggy.'I want beer, lots and lots of beer,' exclaimed the third little piggy.'Pardon me for asking,' said the waiter to the third little piggy,'But why have you only ordered beer all evening?'The third piggy says -'Well, somebody has to go 'Wee, wee, wee, all the way home!", "Why do Sharks circle you before attacking?Two great white sharks, swimming in the ocean, spied survivors of a sunken ship.\n\n\"Follow me, son.\" the father shark said to the son shark and they swam to the mass of people .\"First we swim around them a few times with just the tip of our fins showing.\" And they did .\"Well done, son! Now we swim around them a few times with all of our fins showing.\" And they did .\"Now we eat everybody.\" And they did .When they were both gorged, the son asked, \"Dad, why didn't we just eat them all at first? Why did we swim around and around them?\"His wise father replied, \"Because they taste better without the sh*t inside!\"", "A turkey was chatting with a bull.\n\n\"I would love to be able to get to the top of that tree,\" sighed the turkey.\n\n\"But I just haven't got the energy.\"\"Well, why don't you nibble on some of my droppings?\" replied the bull.\n\n\"They're packed with nutrients.\"The turkey pecked at a lump of dung and found that it\n\nactually gave him enough strength to reach the first branch of the tree.\n\nThe next day, after eating some more dung, he reached the second branch.\n\nFinally after a week, there he was proudly perched at the top of the tree.He was promptly spotted by a farmer, who shot the turkey out of the tree.Moral of the story:\n\nBull crap might get you to the top, but it won't keep you there.", "The Texas Department of Safety is cracking down on speeders heading\n\ninto Dallas.\n\n  For the first offense, they give you 2 Dallas Cowboy tickets.\n\n  If you get stopped a second time, they make you use them.Q.What do you call 47 millionaires around a TV watching the Super Bowl?A..The Dallas CowboysQ.What do the Dallas Cowboys and Billy Graham have in common?A.They both can make 70,000 people stand up and yell \"Jesus Christ\".Q.How do you keep a Dallas Cowboy out of your yard?A.Put up a goal post.Q.What do you call a Dallas Cowboy with a Super Bowl ring?A.OldQ.What's the difference between the Dallas\n\n  Cowboys and a dollar bill?A.You can still get four quarters out of a dollar bill.Q.How many Dallas Cowboys does it take to win a Super Bowl?A.Nobody remembers.Q.What do the Cowboys and possums have in common?A.Both play dead at home and get killed on the road!", "If your dog is fat, you aren't getting enough exercise.- UnknownSome days you're the dog; some days you're the hydrant.- UnknownWhoever said you can't buy happiness forgot about puppies.- Gene HillIn dog years, I'm dead.- UnknownTo his dog, every man is Napoleon; hence the constant popularity of dogs.- Aldous HuxleyA dog teaches a boy fidelity, perseverance, and to turn around three times \n\nbefore lying down.- Robert BenchleyDid you ever walk into a room and forget why you walked in? I think that's \n\nhow dogs spend their lives.- Sue MurphyI loathe people who keep dogs. They are cowards who haven't got the guts to \n\nbite people themselves.- August StrindbergNo animal should ever jump up on the dining room furniture unless absolutely \n\ncertain that he can hold his own in the conversation.- Fran LebowitzEver consider what they must think of us? I mean, here we come back from a \n\ngrocery store with the most amazing haul -- chicken, pork, half a cow. They \n\nmust think we're the greatest hunters on earth!- Anne TylerI wonder if other dogs think poodles are members of a weird religious cult.- Rita RudnerMy dog is worried about the economy because Alpo is up to 99 cents a can.That's almost $7.00 in dog money.\n\n- Joe WeinsteinIf I have any beliefs about immortality, it is that certain dogs I have \n\nknown will go to heaven, and very, very few persons.- James ThurberYou enter into a certain amount of madness when you marry a person with \n\npets.\n\n- Nora EphronDon't accept your dog's admiration as conclusive evidence that you are \n\nwonderful.- Ann LandersWomen and cats will do as they please, and men and dogs should relax and get \n\nused to the idea.- Robert A. HeinleinIn order to keep a true perspective of one's importance, everyone should \n\nhave a dog that will worship him and a cat that will ignore him.- Dereke Bruce, Taipei, TaiwanOf all the things I miss from veterinary practice, puppy breath is one of \n\nthe most fond memories!- Dr. Tom CatThere is no psychiatrist in the world like a puppy licking your face.- Ben WilliamsWhen a man's best friend is his dog, that dog has a problem.- Edward AbbeyCat's motto: No matter what you've done wrong, always try to make it look \n\nlike the dog did it.- UnknownMoney will buy you a pretty good dog, but it won't buy the wag of his tail.- UnknownNo one appreciates the very special genius of your conversation as the dog \n\ndoes.- Christopher MorleyA dog is the only thing on earth that loves you more than he loves himself.- Josh BillingsMan is a dog's idea of what God should be.- Holbrook JacksonThe average dog is a nicer person than the average person.\n\n- Andrew A. RooneyHe is your friend, your partner, your defender, your dog. You are his life, \n\nhis love, his leader. He will be yours, faithful and true, to the last beat \n\nof his heart. You owe it to him to be worthy of such devotion.- UnknownIf you pick up a starving dog and make him prosperous, he will not bite you; \n\nthat is the principal difference between a dog and a man.- Mark TwainThings that upset a terrier may pass virtually unnoticed by a Great Dane.- Smiley BlantonI've seen a look in dogs' eyes, a quickly vanishing look of amazed contempt, \n\nand I am convinced that basically dogs think humans are nuts.- John Steinbeck", "If your dog is fat, you aren't getting enough exercise.- UnknownSome days you're the dog; some days you're the hydrant.- UnknownWhoever said you can't buy happiness forgot about puppies.- Gene HillIn dog years, I'm dead.- UnknownTo his dog, every man is Napoleon; hence the constant popularity of dogs.- Aldous HuxleyA dog teaches a boy fidelity, perseverance, and to turn around three times \n\nbefore lying down.- Robert BenchleyDid you ever walk into a room and forget why you walked in? I think that's \n\nhow dogs spend their lives.- Sue MurphyI loathe people who keep dogs. They are cowards who haven't got the guts to \n\nbite people themselves.- August StrindbergNo animal should ever jump up on the dining room furniture unless absolutely \n\ncertain that he can hold his own in the conversation.- Fran LebowitzEver consider what they must think of us? I mean, here we come back from a \n\ngrocery store with the most amazing haul -- chicken, pork, half a cow. They \n\nmust think we're the greatest hunters on earth!- Anne TylerI wonder if other dogs think poodles are members of a weird religious cult.- Rita RudnerMy dog is worried about the economy because Alpo is up to 99 cents a can.That's almost $7.00 in dog money.\n\n- Joe WeinsteinIf I have any beliefs about immortality, it is that certain dogs I have \n\nknown will go to heaven, and very, very few persons.- James ThurberYou enter into a certain amount of madness when you marry a person with \n\npets.\n\n- Nora EphronDon't accept your dog's admiration as conclusive evidence that you are \n\nwonderful.- Ann LandersWomen and cats will do as they please, and men and dogs should relax and get \n\nused to the idea.- Robert A. HeinleinIn order to keep a true perspective of one's importance, everyone should \n\nhave a dog that will worship him and a cat that will ignore him.- Dereke Bruce, Taipei, TaiwanOf all the things I miss from veterinary practice, puppy breath is one of \n\nthe most fond memories!- Dr. Tom CatThere is no psychiatrist in the world like a puppy licking your face.- Ben WilliamsWhen a man's best friend is his dog, that dog has a problem.- Edward AbbeyCat's motto: No matter what you've done wrong, always try to make it look \n\nlike the dog did it.- UnknownMoney will buy you a pretty good dog, but it won't buy the wag of his tail.- UnknownNo one appreciates the very special genius of your conversation as the dog \n\ndoes.- Christopher MorleyA dog is the only thing on earth that loves you more than he loves himself.- Josh BillingsMan is a dog's idea of what God should be.- Holbrook JacksonThe average dog is a nicer person than the average person.\n\n- Andrew A. RooneyHe is your friend, your partner, your defender, your dog. You are his life, \n\nhis love, his leader. He will be yours, faithful and true, to the last beat \n\nof his heart. You owe it to him to be worthy of such devotion.- UnknownIf you pick up a starving dog and make him prosperous, he will not bite you; \n\nthat is the principal difference between a dog and a man.- Mark TwainThings that upset a terrier may pass virtually unnoticed by a Great Dane.- Smiley BlantonI've seen a look in dogs' eyes, a quickly vanishing look of amazed contempt, \n\nand I am convinced that basically dogs think humans are nuts.- John Steinbeck", "One afternoon while doing some work in the\n\ngarden I noticed my dog dragging something\n\nunder the fence. Upon inspection, to my\n\ndismay, I realized it was the next door\n\nneighbour's daughter's rabbit. For years I\n\nhad watch her come home from school and head\n\nstraight out to its cage, free it and play\n\nwith it in the garden. I knew today would be\n\nno different and fearing for our dog, I had\n\nto think fast.The rabbit was quite dirty, as if it had put\n\nup quite a struggle, so I washed it off with\n\nthe hose, combed it with the dog brush and\n\nblew it dry with the leaf blower. Upon\n\nfinishing its grooming, I jumped the fence\n\nand replaced it back in its cage hoping its\n\ndeath would be written off as \"natural causes\".\n\nWithin the hour, the neighbour's car pulled in\n\nand out popped the little girl, and as usual\n\nshe headed straight for the cage. Only this\n\ntime she stopped about six feet away and\n\nscreamed \"DDDDDAAAADDDDDDDYYYYYYY!!!!!!!!!!!!!!\"Her father, panic stricken, stood looking at\n\nthe cage. Being the good neighbour that I am, I\n\nrushed to fence and asked if there was anything\n\nI could do.Her father less than calmly blurted, \"What kind\n\nof sick individual would dig up a little girl's\n\ndead rabbit and put it back in it's cage?\"", "Two guys are out hiking. All of a sudden, a bear starts chasing them.They climb a tree, but the bear starts climbing up the tree after them. The first guy gets his sneakers out of his knapsack and starts putting them on.The second guy says, \"What are you doing?\"He says, \"I figure when the bear gets close to us, we'll jump down and make a run for it.\"The second guy says, \"Are you crazy? You can't outrun a bear.\"The first guy says, \"I don't have to outrun the bear. I only have to outrun you.\"", "Two robins were sitting in a tree.\"I'm really hungry,\" said the first one. \"Let's fly down and find some lunch.\"They flew down to the ground and found a nice plot of newly plowed ground that was full of worms. They ate and ate and ate till they could eat no more.\"I'm so full, I don't think I can fly back up into the tree,\" said the first one.\"Let's just lay back here and bask in the warm sun,\" said the second.\"OK,\" said the first.So they plopped down, basking in the sun. No sooner than they had fallen asleep, when a big fat tomcat came up and gobbled them up.As the cat sat washing his face after his meal, he thought...\"I JUST LOVE BASKIN ROBINS.\"", "A Hawaii woodpecker and a California woodpecker were arguing about which\n\nplace had the toughest trees. The Hawaii woodpecker said Hawaii had a tree\n\nthat no woodpecker could peck. The California woodpecker accepted his\n\nchallenge, and promptly pecked a hole in the tree with no problem. The\n\nHawaiian woodpecker was in awe.The California woodpecker then challenged the Hawaiian woodpecker to peck\n\na tree in California that was absolutely unpeckable. The Hawaiian\n\nwoodpecker expressed confidence he could do it, so accepted the challenge.\n\nAfter flying to California, the Hawaii woodpecker successfully pecked the\n\ntree with no problem.So the two woodpeckers were now confused. How is it that the Californian\n\nwoodpecker was able to peck the Hawaiian tree and the Hawaiian woodpecker\n\nwas able to peck the Californian tree, but neither one was able to peck\n\nthe tree in their own state?After much woodpecker-pondering, they both came to the same conclusion -\n\nyour pecker is always harder when you're away from home.", "The following ad in the Atlanta Journal is reported to have received numerous calls:\"Single Black Female seeks male companionship, ethnicity unimportant. I am a very good-looking girl who loves to play. I love long walks in the woods, riding in your pickup truck, hunting, camping, and fishing trips, cozy winter nights lying by the fire. Candlelight dinners will have me eating out of your hand. Rub me the right way and watch me respond. I'll be at the front door when you get home from work, wearing only what nature gave me.\n\nKiss me and I'm yours. Call xxx-xxxx and ask for Daisy.\"Over 15,000 men found themselves talking to the local Humane Society about an eight week-old black Labrador retriever.", "A man took his old duck to the Doctor, concerned because the \n\nduck  wouldn't eat.The Doctor explained to the man that as ducks age their   \n\nupper  bills grow down over their lower bills and make it   \n\ndifficult for  the animal to pick up it's food.\"What you need to do is gently file the upper bill down even \n\nwith  the lower bill. But you must be extra careful because \n\nthe duck's  nostrils are located in the upper bill and if   \n\nyou file down too  far, when the duck takes a drink of water \n\nit'll drown.\"The man goes about his business and about a week later the   \n\nDoctor  runs into his patient.\"Well, how is that duck of yours?\" the Doctor inquires.\"He's dead.\" declared the heartbroken man.\"I told you not to file his upper bill down too far! He took \n\na  drink of water and drowned didn't he?\" insisted the   \n\nDoctor.\"No.\" lamented the man. \"I think he was dead before I took   \n\nhim  out of the vise.\"", "A lion woke up one morning feeling really rowdy and mean.He went out and cornered a small monkey, and roared, \"Who is mightiest\n\nof all jungle animals?\"The trembling monkey says, \"You are, mighty lion!\"Later, the lion confronts an ox and fiercely bellows, \"Who is the\n\nmightiest of all jungle animals?\"The terrified ox stammers, \"Oh great lion, you are the mightiest\n\nanimal in the jungle!\"On a roll now, the lion swaggers up to an elephant and roars, \"Who is\n\nmightiest of all jungle animals?\"Fast as lightning, the elephant snatches up the lion with his trunk,\n\nslams him against a tree half a dozen times leaving the lion feeling\n\nlike it'd been run over by a safari wagon.The elephant then stomps on the lion till it looks like a corn\n\ntortilla and rambles away.The lion lets out a moan of pain, lifts his head weakly and hollers\n\nafter the elephant, \"Just because you don't know the answer, you don't\n\nhave to get so upset about it!\"", "I went fishing this morning but after a short time I ran out of worms. Then I saw a cottonmouth with a frog in his mouth. Frogs are good bass bait.Knowing the snake couldn't bite me with the frog in his mouth I grabbed him right behind the head, took the frog, and put it in my bait bucket.Now the dilemma was how to release the snake without getting bit. So, I grabbed my bottle of Jack Daniels and poured a little whiskey in its mouth. His eyes rolled back, he went limp. I released him into the lake without incident and carried on fishing using the frog.A little later, I felt a nudge on my foot. It was that snake, with two more frogs.", "A highly timid little man, ventured into a biker bar in the Bronx and clearing his throat asked, \"Um, err, which of you gentlemen owns the Doberman tied outside to the parking meter?\"A giant of a man, wearing biker leathers, his body hair growing out through the seams, turned slowly on his stool, looked down at the quivering little man and said, \"It's my dog. Why?\"\"Well,\" squeaked the little man, obviously very nervous, \"I believe my dog just killed it, sir.\"\"What?\" roared the big man in disbelief. \"What in the hell kind of dog do you have?\"\"Sir,\" answered the little man, \"it's a little four week old female puppy.\"\"Bull!\" roared the biker, \"how could your puppy kill my Doberman?\"\"It appears that your dog choked on her, sir.\"", "When Uncle Charlie died of old age, Bill was bequeathed his uncle's\n\nprized Amazon parrot.  This parrot was fully grown -- with a bad attitude\n\nand a worse vocabulary.  Every other word was an expletive.  Those that\n\nweren't expletives were, to say the very least, extremely rude.Bill tried hard to change the bird's attitude and was constantly saying\n\npolite words, playing soft music--anything he could think of to try and\n\nset a good example...  Nothing worked.  Exasperated, he yelled at the\n\nbird.  But the bird just got louder.  Then he shook the parrot.  But the\n\nbird just got more angry and more rude.Finally, in a moment of desperation, Bill put the parrot in the freezer.For a few moments he heard the bird squawking, kicking, and\n\nscreaming...Then, suddenly, all was quiet.  Bill was frightened that he might have\n\nhurt his dead uncle's prized parrot and quickly opened the freezer door.The parrot calmly stepped out onto Bill's extended arm and said, \"I am\n\ntruly sorry that I might have offended you with my language and action\n\nand I humbly ask your forgiveness.  I will now, from this day forth,\n\nendeavor to correct my behavior so that such an ill-perceived outburst\n\nnever again occurs.\"Bill was completely astonished at the bird's change in attitude and was\n\nabout to ask what had caused such a dramatic change when the parrot\n\ncontinued, \"May I ask what the chicken did?\"", "Three bulls heard via the grapevine that the rancher was going to bring another bull onto the ranch, and the prospect raised a discussion among them.The first bull says, \"Boys, we all know I've been here 5 years. Once we settled our differences, we agreed on which 100 of the cows would be mine. Now, I don't know where this newcomer is going to get HIS cows, but I ain't' givin' him any of mine.\"The second bull says, \"That pretty much says it for me, too. I've been here 3 years and have earned my right to the 50 cows we've agreed are mine. I'll fight 'im till I run him off or kill 'im, but I'M KEEPIN' ALL MY COWS.\"The third bull says, \"I've only been here a year, and so far you guys have only let me have 10 cows to \"take care of\". I may not be as big as you fellows yet, but I am young and virile, so I simply MUST keep all MY cows.\"They had just finished their big talk when an eighteen-wheeler pulls up in the middle of the pasture with only ONE ANIMAL IN IT: the biggest Son-of-Another-Bull these guys had ever seen! At 4700 pounds, each step he took toward the ground strained the steel ramp to the breaking point.The first bull says, \"Ahem...You know, it's actually been some time since I really felt I was doing all my cows justice, anyway. I think I can spare a few for our new friend.\"The second bull says, \"I'll have plenty of cows to take care of if I just stay on the opposite end of the pasture from HIM. I'm certainly not looking for an argument.\"They look over at their young friend, the third bull, and find him pawing the dirt, shaking his horns, and snorting up a storm.The first bull says, \"Son, let me give you some advice real quick. Let him have some of your cows and live to tell about it.\"The third bull says, \"Heck, he can have ALL my cows. I'm just making sure he knows I'M a bull!\"", "A man was out walking a dog, and a woman stopped to admire\n\nthe animal.\"What's your dog's name?\" she asked.\"Herpes,\" replied the dog's owner.\"How....odd,\" said the woman. \"Why Herpes?\"\"Because he won't heel.\"", "A monkey is sitting in a tree smoking a joint when a lizard walks\n\npast and looks up and says to the monkey,  \"Hey! What are you doing?\"The monkey says, \"Smoking a joint, come up and have some.\"So the lizard climbs up and sits next to the monkey and they have a\n\nfew tokes together.After a while the lizard says his mouth is 'dry' and that he's going\n\nto get a drink from the river.The lizard climbs down the tree, ditty bops on thru the jungle to\n\nthe river and leans over the river to get his drink.Well, the lizard is so stoned that he leans too far over and falls\n\ninto the river.A Crocodile sees this and swims over to the lizard and helps him to\n\nthe side, then asks the lizard, \"What's the matter with you?\"The lizard explains to the crocodile that he was sitting in a tree\n\nand smoking a joint with the monkey and got too stoned and then fell\n\ninto the river while taking a drink.The crocodile says he's gotta check this hippie monkey out and walks\n\noff into the jungle where he finds the tree where the monkey is\n\nstill sitting and toking on the joint.He looks up and says \"hey you!\"The Monkey looks down and says, \"wwoooowww dude.............how much water did you drink?!!\"", "A man took his old duck to the Doctor, concerned because the \n\nduck  wouldn't eat.The Doctor explained to the man that as ducks age their   \n\nupper  bills grow down over their lower bills and make it   \n\ndifficult for  the animal to pick up it's food.\"What you need to do is gently file the upper bill down even \n\nwith  the lower bill. But you must be extra careful because \n\nthe duck's  nostrils are located in the upper bill and if   \n\nyou file down too  far, when the duck takes a drink of water \n\nit'll drown.\"The man goes about his business and about a week later the   \n\nDoctor  runs into his patient.\"Well, how is that duck of yours?\" the Doctor inquires.\"He's dead.\" declared the heartbroken man.\"I told you not to file his upper bill down too far! He took \n\na  drink of water and drowned didn't he?\" insisted the   \n\nDoctor.\"No.\" lamented the man. \"I think he was dead before I took   \n\nhim  out of the vise.\"", "A chicken and an egg are lying in bed.The chicken is leaning against the headboard smoking a cigarette,\n\nwith a satisfied smile on its face. The egg, looking a bit pissed\n\noff, grabs the sheet, rolls over, and says,\"Well, I guess we finally answered THAT question!\"", "One day the first grade teacher was reading the story of the Three Little\n\nPigs to her class. She came to the part of the story where the first pig\n\nwas trying to accumulate the building materials for his home. She read,\n\n\"...and so the pig went up to the man with the wheel barrow full of straw\n\nand said, \"Pardon me sir, but may I have some of that straw to build my\n\nhouse?\" The teacher paused then asked the class, \"And what do you think\n\nthat man said?\"One little boy raised his hand and said, \"I think he said\n\n'Holy Sh*t! A talking pig!'\"The teacher was unable to teach for the next\n\n10 minutes.", "A group of friends who went deer hunting separated into\n\npairs for the day.  That night, one hunter returned alone, staggering under\n\na hugh buck.\"Where's Harry?\", asked another hunter.\"He fainted a couple miles up the trail,\" Harry's partner\n\nanswered.\"You left him lying there alone and carried\n\nthe deer back?\"\"It was a tough decision,\" said the hunter. \"But I figured\n\nno one is going to steal Harry.\"", "If your dog is fat, you aren't getting enough exercise.- UnknownSome days you're the dog; some days you're the hydrant.- UnknownWhoever said you can't buy happiness forgot about puppies.- Gene HillIn dog years, I'm dead.- UnknownTo his dog, every man is Napoleon; hence the constant popularity of dogs.- Aldous HuxleyA dog teaches a boy fidelity, perseverance, and to turn around three times \n\nbefore lying down.- Robert BenchleyDid you ever walk into a room and forget why you walked in? I think that's \n\nhow dogs spend their lives.- Sue MurphyI loathe people who keep dogs. They are cowards who haven't got the guts to \n\nbite people themselves.- August StrindbergNo animal should ever jump up on the dining room furniture unless absolutely \n\ncertain that he can hold his own in the conversation.- Fran LebowitzEver consider what they must think of us? I mean, here we come back from a \n\ngrocery store with the most amazing haul -- chicken, pork, half a cow. They \n\nmust think we're the greatest hunters on earth!- Anne TylerI wonder if other dogs think poodles are members of a weird religious cult.- Rita RudnerMy dog is worried about the economy because Alpo is up to 99 cents a can.That's almost $7.00 in dog money.\n\n- Joe WeinsteinIf I have any beliefs about immortality, it is that certain dogs I have \n\nknown will go to heaven, and very, very few persons.- James ThurberYou enter into a certain amount of madness when you marry a person with \n\npets.\n\n- Nora EphronDon't accept your dog's admiration as conclusive evidence that you are \n\nwonderful.- Ann LandersWomen and cats will do as they please, and men and dogs should relax and get \n\nused to the idea.- Robert A. HeinleinIn order to keep a true perspective of one's importance, everyone should \n\nhave a dog that will worship him and a cat that will ignore him.- Dereke Bruce, Taipei, TaiwanOf all the things I miss from veterinary practice, puppy breath is one of \n\nthe most fond memories!- Dr. Tom CatThere is no psychiatrist in the world like a puppy licking your face.- Ben WilliamsWhen a man's best friend is his dog, that dog has a problem.- Edward AbbeyCat's motto: No matter what you've done wrong, always try to make it look \n\nlike the dog did it.- UnknownMoney will buy you a pretty good dog, but it won't buy the wag of his tail.- UnknownNo one appreciates the very special genius of your conversation as the dog \n\ndoes.- Christopher MorleyA dog is the only thing on earth that loves you more than he loves himself.- Josh BillingsMan is a dog's idea of what God should be.- Holbrook JacksonThe average dog is a nicer person than the average person.\n\n- Andrew A. RooneyHe is your friend, your partner, your defender, your dog. You are his life, \n\nhis love, his leader. He will be yours, faithful and true, to the last beat \n\nof his heart. You owe it to him to be worthy of such devotion.- UnknownIf you pick up a starving dog and make him prosperous, he will not bite you; \n\nthat is the principal difference between a dog and a man.- Mark TwainThings that upset a terrier may pass virtually unnoticed by a Great Dane.- Smiley BlantonI've seen a look in dogs' eyes, a quickly vanishing look of amazed contempt, \n\nand I am convinced that basically dogs think humans are nuts.- John Steinbeck", "WARNING: After a recent wave of identify thefts, the FBI estimates there are over 500 fake Obamacare websites set up for the sole purpose of stealing your personal information. So protect yourself and remember: the real one is the one that doesn't work.", "Whitey was in the fertilized egg business. He had several hundred \n\nyoung layers called pullets and eight or ten roosters, whose job was to \n\nfertilize the eggs. Whitey kept records and any rooster that didn't \n\nperform went into the soup pot and was replaced.That took an awful lot of Whitey's time so Whitey got a set of \n\ntiny bells and attached them to his roosters.Each bell had a different tone so Whitey could tell from a \n\ndistance, which rooster was performing.Now he could sit on the porch and fill out an efficiency report \n\nsimply by listening to the bells.Whitey's favorite rooster was old Brewster, a very fine specimen \n\nhe was, too. But on this particular morning Whitey noticed old Brewster's \n\nbell hadn't rung at all!Whitey went to investigate. The other roosters were chasing \n\npullets, bells-a-ringing. The pullets, hearing the roosters coming, would run for \n\ncover.BUT, to Whitey's amazement, Brewster had his bell in his beak, so \n\nit couldn't ring. He'd sneak up on a pullet, do his job and walk on to the \n\nnext one.Whitey was so proud of Brewster, he entered him in the county \n\nfair... and Brewster became an overnight sensation among the judges. \n\nThe result...The judges not only awarded Brewster the \"No Bell Piece Prize\" but \n\nthey also awarded him the \"Pulletsurprise\" as well.", "Two bats are going for their midnight feed.\n\nAfter an hour or so, one bat gets tired of looking and goes home with no blood.The other bat comes home with blood dripping from its mouth. The first bat says enviously, \"Where did you get all that blood from?\"The second bat replies, \"Follow me. I'll show you.\"After awhile the second bat leads them to a cave. He says, \"You see that wall over there?\"The hungry bat excitedly says, \"Yes!\"Other bat says, \"I didn't.\"", "If your dog is fat, you aren't getting enough exercise.- UnknownSome days you're the dog; some days you're the hydrant.- UnknownWhoever said you can't buy happiness forgot about puppies.- Gene HillIn dog years, I'm dead.- UnknownTo his dog, every man is Napoleon; hence the constant popularity of dogs.- Aldous HuxleyA dog teaches a boy fidelity, perseverance, and to turn around three times \n\nbefore lying down.- Robert BenchleyDid you ever walk into a room and forget why you walked in? I think that's \n\nhow dogs spend their lives.- Sue MurphyI loathe people who keep dogs. They are cowards who haven't got the guts to \n\nbite people themselves.- August StrindbergNo animal should ever jump up on the dining room furniture unless absolutely \n\ncertain that he can hold his own in the conversation.- Fran LebowitzEver consider what they must think of us? I mean, here we come back from a \n\ngrocery store with the most amazing haul -- chicken, pork, half a cow. They \n\nmust think we're the greatest hunters on earth!- Anne TylerI wonder if other dogs think poodles are members of a weird religious cult.- Rita RudnerMy dog is worried about the economy because Alpo is up to 99 cents a can.That's almost $7.00 in dog money.\n\n- Joe WeinsteinIf I have any beliefs about immortality, it is that certain dogs I have \n\nknown will go to heaven, and very, very few persons.- James ThurberYou enter into a certain amount of madness when you marry a person with \n\npets.\n\n- Nora EphronDon't accept your dog's admiration as conclusive evidence that you are \n\nwonderful.- Ann LandersWomen and cats will do as they please, and men and dogs should relax and get \n\nused to the idea.- Robert A. HeinleinIn order to keep a true perspective of one's importance, everyone should \n\nhave a dog that will worship him and a cat that will ignore him.- Dereke Bruce, Taipei, TaiwanOf all the things I miss from veterinary practice, puppy breath is one of \n\nthe most fond memories!- Dr. Tom CatThere is no psychiatrist in the world like a puppy licking your face.- Ben WilliamsWhen a man's best friend is his dog, that dog has a problem.- Edward AbbeyCat's motto: No matter what you've done wrong, always try to make it look \n\nlike the dog did it.- UnknownMoney will buy you a pretty good dog, but it won't buy the wag of his tail.- UnknownNo one appreciates the very special genius of your conversation as the dog \n\ndoes.- Christopher MorleyA dog is the only thing on earth that loves you more than he loves himself.- Josh BillingsMan is a dog's idea of what God should be.- Holbrook JacksonThe average dog is a nicer person than the average person.\n\n- Andrew A. RooneyHe is your friend, your partner, your defender, your dog. You are his life, \n\nhis love, his leader. He will be yours, faithful and true, to the last beat \n\nof his heart. You owe it to him to be worthy of such devotion.- UnknownIf you pick up a starving dog and make him prosperous, he will not bite you; \n\nthat is the principal difference between a dog and a man.- Mark TwainThings that upset a terrier may pass virtually unnoticed by a Great Dane.- Smiley BlantonI've seen a look in dogs' eyes, a quickly vanishing look of amazed contempt, \n\nand I am convinced that basically dogs think humans are nuts.- John Steinbeck", "How many dogs does it take to change a light bulb?\"Golden Retriever: The sun is shining, the day is young, we have our whole lives ahead of us, and you're inside worrying about a stupid burned out bulb?Border Collie: Just one. And then I'll replace any wiring that's not up to code.Dachshund: You know I can't reach that stupid lamp!Rottweiler: Make me.Boxer: Who cares? I can still play with my squeaky toys in the dark.Lab: Oh, me, me!!!!! Pleeeeeeeeeze let me change the light bulb! Can I? Can I? Huh? Huh? Huh? Can I? Pleeeeeeeeeze, please, please, please!German Shepherd: I'll change it as soon as I lead these people from the dark, check to make sure I don't miss any, and make just one more perimeter patrol to see that no one takes advantage of the situation.Jack Russell Terrier: I'll just pop it in while I'm bouncing off the walls and furniture.Old English Sheep Dog: Light bulb? I'm sorry, but I don't see a light bulb!Cocker Spaniel: Why change it? I can still pee on the carpet in the dark.Chihuahua: Yo quiero Taco Bulb.Pointer: I see it, there it is, there it is, right there.....Greyhound: It isn't moving. Who cares?Australian Shepherd: First, I'll put all the light bulbs in a little circle...Poodle: I'll just blow in the Border Collie's ear and he'll do it. By the time he finishes rewiring the house, my nails will be dry.\"Dogs do not change light bulbs. People change light bulbs. So, the real question is: How long will it be before I can expect some light, some dinner, and a massage?\" \n\nAll of which proves, once again, that while dogs have masters, cats have staff.", "A young Southern boy goes off to college, but about 1/3 of the way\n\nthrough the semester, he has foolishly squandered away all of the money his\n\nparents gave him.Then he gets an idea. He calls his daddy. \"Dad,\" he says, \"you won't\n\nbelieve the wonders that modern education are coming up with! Why,\n\nthey actually have a program here at college that will teach our dog Ole\n\nBlue how to talk!\"\"That's absolutely amazing,\" his father says. \"How do I get him in\n\nthat program?\"\"Just send him down here with $1,000\" the boy says. \"I'll get him\n\ninto the course.\" So, his father sends the dog and the $1,000.About 2/3 way through the semester, the money runs out. The boy calls\n\nhis father again. \"So how's Ole Blue doing, son,\" his father asks.\"Awesome, Dad, he's talking up a storm,\" he says, \"but you just won't believe\n\nthis they've had such good results with this program that they've\n\nimplemented a new one to teach the animals how to READ!\"\"READ,\" says his father, \"No kidding! What do I have to do to get him\n\nin that program? \"Just send $2,500, I'll get him in the class.\" His father sends the\n\nmoney.The boy now has a problem. At the end of the year, his father will\n\nfind out that the dog can neither talk, nor read. So he shoots the dog.When he gets home at the end of the semester, his father is all\n\nexcited. \"Where's Ole Blue? I just can't wait to see him talk and read\n\nsomething!\"\"Dad,\" the boy says, \"I have some grim news. Yesterday morning, just\n\nbefore we left to drive home, Ole Blue was in the living room kicking back\n\nin the recliner, reading the morning paper, like he usually does. Then he\n\nturned to me and asked, ' So, is your daddy still messin' around with that\n\nlittle redhead who lives on Oak Street ?'The father says, \"I hope you SHOT that son of a bitch before he talks\n\nto your Mother!\"\"I sure did, Dad!\"\"That's my boy!\"", "Dogs' Views on Changing Light BulbsHow many dogs does it take to change a light bulb? Depends on the dog's point of view....GOLDEN RETRIEVER: The sun is shining, the day is young, we've got our whole lives ahead of us, and you're inside worrying about a stupid burned out bulb?BORDER COLLIE: Just one. And then I'll replace any wiring that's not up to code.DACHSHUND: You know I can't reach that stupid bulb!ROTTWEILER: Make me.LAB: Oh, me, me!!!! Pleeeeeeze let me change the light bulb! Can I? Can I? Huh? Huh? Huh? Can I?MALAMUTE: Let the Border Collie do it. You can feed me while he's busy.JACK RUSSELL TERRIER: I'll just pop it in while I'm bouncing off the walls and furniture.POODLE: I'll blow in the Border Collie's ear and he'll do it. By the time he finishes rewiring the house, my nails will be dry.COCKER SPANIEL: Why change it? I can pee on the carpet in the dark.DOBERMAN PINSCHER: While it's dark, I'm going to sleep on the sofa.BOXER: Who cares? I can play with my squeaky toys in the dark.MASTIFF: Mastiffs are NOT afraid of the dark.CHIHUAHUA: Yo quiero Taco Bulb.IRISH WOLFHOUND: Can somebody else do it? I've got this hangover and..........POINTER: I see it, there it is, there it is, right there!GREYHOUND: It isn't moving. Who cares?AUSTRALIAN SHEPHERD: First, I'll put all the light bulbs in a little circle....OLD ENGLISH SHEEP DOG: Light bulb? That thing I just ate was a light bulb?HOUND DOG: ZZZZZZZZZZZZZZZZZZZZZZZZZZZZAnd the CAT: Dogs do not change light bulbs. People change light bulbs and I am not one of them. So, the question is, how long will it be before I get some light in here?", "If your dog is fat, you aren't getting enough exercise.- UnknownSome days you're the dog; some days you're the hydrant.- UnknownWhoever said you can't buy happiness forgot about puppies.- Gene HillIn dog years, I'm dead.- UnknownTo his dog, every man is Napoleon; hence the constant popularity of dogs.- Aldous HuxleyA dog teaches a boy fidelity, perseverance, and to turn around three times \n\nbefore lying down.- Robert BenchleyDid you ever walk into a room and forget why you walked in? I think that's \n\nhow dogs spend their lives.- Sue MurphyI loathe people who keep dogs. They are cowards who haven't got the guts to \n\nbite people themselves.- August StrindbergNo animal should ever jump up on the dining room furniture unless absolutely \n\ncertain that he can hold his own in the conversation.- Fran LebowitzEver consider what they must think of us? I mean, here we come back from a \n\ngrocery store with the most amazing haul -- chicken, pork, half a cow. They \n\nmust think we're the greatest hunters on earth!- Anne TylerI wonder if other dogs think poodles are members of a weird religious cult.- Rita RudnerMy dog is worried about the economy because Alpo is up to 99 cents a can.That's almost $7.00 in dog money.\n\n- Joe WeinsteinIf I have any beliefs about immortality, it is that certain dogs I have \n\nknown will go to heaven, and very, very few persons.- James ThurberYou enter into a certain amount of madness when you marry a person with \n\npets.\n\n- Nora EphronDon't accept your dog's admiration as conclusive evidence that you are \n\nwonderful.- Ann LandersWomen and cats will do as they please, and men and dogs should relax and get \n\nused to the idea.- Robert A. HeinleinIn order to keep a true perspective of one's importance, everyone should \n\nhave a dog that will worship him and a cat that will ignore him.- Dereke Bruce, Taipei, TaiwanOf all the things I miss from veterinary practice, puppy breath is one of \n\nthe most fond memories!- Dr. Tom CatThere is no psychiatrist in the world like a puppy licking your face.- Ben WilliamsWhen a man's best friend is his dog, that dog has a problem.- Edward AbbeyCat's motto: No matter what you've done wrong, always try to make it look \n\nlike the dog did it.- UnknownMoney will buy you a pretty good dog, but it won't buy the wag of his tail.- UnknownNo one appreciates the very special genius of your conversation as the dog \n\ndoes.- Christopher MorleyA dog is the only thing on earth that loves you more than he loves himself.- Josh BillingsMan is a dog's idea of what God should be.- Holbrook JacksonThe average dog is a nicer person than the average person.\n\n- Andrew A. RooneyHe is your friend, your partner, your defender, your dog. You are his life, \n\nhis love, his leader. He will be yours, faithful and true, to the last beat \n\nof his heart. You owe it to him to be worthy of such devotion.- UnknownIf you pick up a starving dog and make him prosperous, he will not bite you; \n\nthat is the principal difference between a dog and a man.- Mark TwainThings that upset a terrier may pass virtually unnoticed by a Great Dane.- Smiley BlantonI've seen a look in dogs' eyes, a quickly vanishing look of amazed contempt, \n\nand I am convinced that basically dogs think humans are nuts.- John Steinbeck", "Two robins were sitting in a tree.\"I'm really hungry,\" said the first one. \"Let's fly down and find some lunch.\"They flew down to the ground and found a nice plot of newly plowed ground that was full of worms. They ate and ate and ate till they could eat no more.\"I'm so full, I don't think I can fly back up into the tree,\" said the first one.\"Let's just lay back here and bask in the warm sun,\" said the second.\"O K,\" said the first.So they plopped down, basking in the sun. No sooner than they had fallen asleep, when a big fat tomcat came up and gobbled them up.As the cat sat washing his face after his meal, he thought...\"I JUST LOVE BASKIN ROBINS.\"", "In light of the rising frequency of human - grizzly bear  \n\nconflicts, the Alaska Department of Fish and Game is  \n\nadvising hikers, hunters, and fishermen to take extra  \n\nprecautions and keep alert of bears while in the field. They \n\n advise that outdoorsmen wear noisy little bells on their  \n\nclothing so as not to startle bears that aren't expecting  \n\nthem. They also advise outdoorsmen to carry pepper spray  \n\nwith them in case of an encounter with a bear. It is also a  \n\ngood idea to watch out for fresh signs of bear activity.  \n\nOutdoorsmen should recognize the difference between black  \n\nbear and grizzly bear dung. Black bear dung is smaller and  \n\ncontains lots of berries and squirrel fur. Grizzly bear dung \n\n has little bells in it and smells like pepper.", "I believe that earlier this year the US Postal Service also issued a set of\n\nstamps featuring american racehorses.This must be one of the great ironies of the horse racing industry. If a\n\nhorse wins its races it gets put on the front of a postage stamp. If it\n\nloses it gets put on the back!", "The only cow in a small Kentucky town stopped giving milk. The people did\n\nsome research and found that they could buy a cow just across the state\n\nline in Illinois for $200.They brought the cow from Illinois and the cow was wonderful. It produced\n\nlots of milk all of the time, and the people were very happy.They decided to acquire a bull to mate with the cow to produce more cows\n\nlike it. They would never have to worry about their milk supply again.They bought the bull and put it in the pasture with their beloved cow.\n\nHowever, whenever the bull tried to mount the cow, the cow would move\n\naway. No matter what approach the bull tried, the cow would move away from\n\nthe bull and he could not succeed in his quest. The people were very upset\n\nand decided to ask the Vet, who was very wise, what to do.They told the Vet what was happening. \"Whenever the bull tries to mount\n\nour cow, she moves away. If he approaches from the back, she moves\n\nforward. When he approaches her from the front, she backs off. An attempt\n\nfrom the side, she walks away to the other side.\"The Vet thought about this for a minute and asked, \"Did you by chance, buy\n\nthis cow in Illinois?\"The people were dumbfounded, since no one had ever mentioned where they\n\nbought the cow. \"You are truly a wise Vet,\" they said. \"How did you know\n\nwe got the cow in Illinois?\"The Vet replied with a distant look in his eye, \"My wife is from\n\nIllinois.\"", "Everybody I know who has a dog usually calls him \"Rover\" or \"Spot\". I call mine Sex. Now, Sex has been very embarrassing to me.When I went to the City Hall to renew the dog's license, I told the clerk that I would like a license for Sex.He said, \"I would like to have one too!\"Then I said, \"But she is a dog!\"He said he didn't care what she looked like.I said, \"You don't understand. ... I have had Sex since I was nine years old.\"He replied, \"You must have been quite a strong boy.\"When I decided to get married, I told the minister that I would like to have Sex at the wedding.He told me to wait until after the wedding was over.I said, \"But Sex has played a big part in my life and my whole world revolves around Sex.\"He said he didn't want to hear about my personal life and would not marry us in his church.I told him everyone would enjoy having Sex at the wedding.The next day we were married at the Justice of the Peace. My family was barred from the church from then on.When my wife and I went on our honeymoon, I took the dog with me.When we checked into the motel, I told the clerk that I wanted a room for me and my wife and a special room for Sex.He said that every room in the motel is a place for sex.I said, \"You don't understand. ... Sex keeps me awake at night.\"The clerk said, \"Me too!\"One day I entered Sex in a contest. But before the competition began, the dog ran away.Another contestant asked me why I was just looking around.I told him that I was going to have Sex in the contest.He said that I should have sold my own tickets.\"You don't understand,\" I said, \"I hoped to have Sex on TV.\"He called me a show off.When my wife and I separated, we went to court to fight for custody of the dog.I said, \"Your Honor, I had Sex before I was married but Sex left me after I was married.\"The Judge said, \"Same here!\"Last night Sex ran off again. I spent hours looking all over for her. A cop came over and asked me what I was doing in the alley at 4 o'clock in the morning.I said, \"I'm looking for Sex.\" -- My case comes up next Thursday.Well now I've been thrown in jail, been divorced and had more damn troubles with that dog than I ever foresaw.Why just the other day when I went for my first session with the psychiatrist, she asked me, \"What seems to be the trouble?\"I replied, \"Sex has been my best friend all my life but now it has left me forever. I can't live any longer being so lonely.\"And the doctor said, \"Look mister, you should understand that sex isn't a man's best friend so go get yourself a dog.\"", "Whitey was in the fertilized egg business. He had several hundred \n\nyoung layers called pullets and eight or ten roosters, whose job was to \n\nfertilize the eggs. Whitey kept records and any rooster that didn't \n\nperform went into the soup pot and was replaced.That took an awful lot of Whitey's time so Whitey got a set of \n\ntiny bells and attached them to his roosters.Each bell had a different tone so Whitey could tell from a \n\ndistance, which rooster was performing.Now he could sit on the porch and fill out an efficiency report \n\nsimply by listening to the bells.Whitey's favorite rooster was old Brewster, a very fine specimen \n\nhe was, too. But on this particular morning Whitey noticed old Brewster's \n\nbell hadn't rung at all!Whitey went to investigate. The other roosters were chasing \n\npullets, bells-a-ringing. The pullets, hearing the roosters coming, would run for \n\ncover.BUT, to Whitey's amazement, Brewster had his bell in his beak, so \n\nit couldn't ring. He'd sneak up on a pullet, do his job and walk on to the \n\nnext one.Whitey was so proud of Brewster, he entered him in the county \n\nfair... and Brewster became an overnight sensation among the judges. \n\nThe result...The judges not only awarded Brewster the \"No Bell Piece Prize\" but \n\nthey also awarded him the \"Pulletsurprise\" as well.", "A cowboy named Bud was overseeing his herd in a remote mountainous pasture in California when suddenly a brand-new BMW advanced toward him out of a cloud of dust.The driver, a young man in a Brioni suit, Gucci shoes, RayBan sunglasses and YSL tie, leaned out the window and asked the cowboy, \"If I tell you exactly how many cows and calves you have in your herd, Will you give me a calf?\"Bud looks at the man, obviously a yuppie, then looks at his peacefully grazing herd and calmly answers, \"Sure, Why not?\"The yuppie parks his car, whips out his Dell notebook computer, connects it to his Cingular RAZR V3 cell phone, and surfs to a NASA page on the Internet, where he calls up a GPS satellite to get an exact fix on his location which he then feeds to another NASA satellite that scans the area in an ultra-high-resolution photo.The young man then opens the digital photo in Adobe Photoshop and exports it to an image processing facility in Hamburg , Germany.Within seconds, he receives an email on his Palm Pilot that the image has been processed and the data stored. He then accesses an MS-SQL database through an ODBC connected Excel spreadsheet with email on his Blackberry and, after a few minutes, receives a response.Finally, he prints out a full-color, 150-page report on his hi-tech, miniaturized HP LaserJet printer, turns to the cowboy and says, \"You have exactly 1,586 cows and calves.\"\"That's right. Well, I guess you can take one of my calves,\" says Bud.He watches the young man select one of the animals and looks on with amusement as the young man stuffs it into the trunk of his car.Then Bud says to the young man, \"Hey, if I can tell you exactly what your business is, will you give me back my calf?\"The young man thinks about it for a second and then says, \"Okay, why not?\"\"You're a Congressman for the U.S. Government\", says Bud.\"Wow! That's correct,\" says the yuppie, \"but how did you guess that?\"\"No guessing required.\" answered the cowboy. \"You showed up here even though nobody called you. You want to get paid for an answer I already knew, to a question I never asked. You used millions of dollars worth of equipment trying to show me how much smarter than me you are, and you don't know a thing about how working people make a living, or about cows for that matter. This is a herd of sheep.Now give me back my dog.", "1. Put both lids of the toilet up and add 1/8 cup of pet shampoo to the water in the bowl.2. Pick up the cat and soothe him while you carry him towards the bathroom.3. In one smooth movement, put the cat in the toilet and close both lids. You may need to stand on the lid.4. The cat will self agitate and make ample suds. Never mind the noises that come from the toilet, the cat is actually enjoying this.5. Flush the toilet three or four times. This provides a \"power wash\" and \"rinse\".6. Have someone open the front door of your home. Be sure that there are no people between the bathroom and the front door.7. Stand behind the toilet as far as you can and quickly lift both lids.8. The cat will rocket out of the toilet , streak through the bathroom and run outside where he will dry himself off.9. Both the commode and the cat will be sparkling clean.Sincerely,The Dog", "\"Managing senior programmers is like herding cats.\" -\n\n-Dave Platt\"Do not meddle in the affairs of cats, for they are\n\nsubtle and will piss on your computer.\" --Bruce\n\nGraham\"There is no snooze button on a cat who wants\n\nbreakfast.\" --Unknown\"Thousands of years ago, cats were worshipped as\n\ngods. Cats have never forgotten this.\" --Anonymous\"Cats are smarter than dogs. You can't get eight cats\n\nto pull a sled through the snow.\" --Jeff Valdez\"In a cat's eye, all things belong to cats.\" --\n\nEnglish proverb\"As every cat owner knows, nobody owns a cat.\" --\n\nEllen Perry Berkeley\"One cat just leads to another.\" --Ernest Hemmingway\"Dogs come when they're called; cats take a message\n\nand get back to you later.\" --Mary Bly\"Cats are rather delicate creatures and they are\n\nsubject to a good many ailments, but I never heard of\n\none who suffered from insomnia.\" --Joseph Wood Krutch\"People that hate cats, will come back as mice in\n\ntheir next life.\" --Faith Resnick\"There are many intelligent species in the universe.\n\nThey are all owned by cats.\" --Anonymous\"I have studied many philosophers and many cats. The\n\nwisdom of cats is infinitely superior.\" --Hippolyte\n\nTaine\"No heaven will not ever Heaven be; Unless my cats\n\nare there to welcome me.\" --Unknown\"There are two means of refuge from the miseries of\n\nlife: music and cats.\" --Albert Schweitzer\"The cat has too much spirit to have no heart.\" --\n\nErnest Menaul\"Dogs believe they are human. Cats believe they are\n\nGod.\"\"Time spent with cats is never wasted.\" --Colette\"Some people say that cats are sneaky, evil, and\n\ncruel. True, and they have many other fine qualities\n\nas well.\" --Missy Dizick\"You will always be lucky if you know how to make\n\nfriends with strange cats.\" --Colonial American\n\nproverb\"Cats seem to go on the principle that it never does\n\nany harm to ask for what you want.\" --Joseph Wood\n\nKrutch\"I got rid of my husband. The cat was allergic\"\"My husband said it was either him or the cat ... I\n\nmiss him sometimes.\"\"Dogs have owners....cats have a staff\".", "In light of the rising frequency of human - grizzly bear  \n\nconflicts, the Alaska Department of Fish and Game is  \n\nadvising hikers, hunters, and fishermen to take extra  \n\nprecautions and keep alert of bears while in the field. They \n\n advise that outdoorsmen wear noisy little bells on their  \n\nclothing so as not to startle bears that aren't expecting  \n\nthem. They also advise outdoorsmen to carry pepper spray  \n\nwith them in case of an encounter with a bear. It is also a  \n\ngood idea to watch out for fresh signs of bear activity.  \n\nOutdoorsmen should recognize the difference between black  \n\nbear and grizzly bear dung. Black bear dung is smaller and  \n\ncontains lots of berries and squirrel fur. Grizzly bear dung \n\n has little bells in it and smells like pepper.", "A highly timid little man, ventured into a biker bar in the Bronx and clearing his throat asked, \"Um, err, which of you gentlemen owns the Doberman tied outside to the parking meter?\"A giant of a man, wearing biker leathers, his body hair growing out through the seams, turned slowly on his stool, looked down at the quivering little man and said, \"It's my dog. Why?\"\"Well,\" squeaked the little man, obviously very nervous, \"I believe my dog just killed it, sir.\"\"What?\" roared the big man in disbelief. \"What in the hell kind of dog do you have?\"\"Sir,\" answered the little man, \"it's a little four week old female puppy.\"\"Bull!\" roared the biker, \"how could your puppy kill my Doberman?\"\"It appears that your dog choked on her, sir.\"", "", "Three bulls heard via the grapevine that the rancher was going to bring another bull onto the ranch, and the prospect raised a discussion among them.The first bull says, \"Boys, we all know I've been here 5 years. Once we settled our differences, we agreed on which 100 of the cows would be mine. Now, I don't know where this newcomer is going to get HIS cows, but I ain't' givin' him any of mine.\"The second bull says, \"That pretty much says it for me, too. I've been here 3 years and have earned my right to the 50 cows we've agreed are mine. I'll fight 'im till I run him off or kill 'im, but I'M KEEPIN' ALL MY COWS.\"The third bull says, \"I've only been here a year, and so far you guys have only let me have 10 cows to \"take care of\". I may not be as big as you fellows yet, but I am young and virile, so I simply MUST keep all MY cows.\"They had just finished their big talk when an eighteen-wheeler pulls up in the middle of the pasture with only ONE ANIMAL IN IT: the biggest Son-of-Another-Bull these guys had ever seen! At 4700 pounds, each step he took toward the ground strained the steel ramp to the breaking point.The first bull says, \"Ahem...You know, it's actually been some time since I really felt I was doing all my cows justice, anyway. I think I can spare a few for our new friend.\"The second bull says, \"I'll have plenty of cows to take care of if I just stay on the opposite end of the pasture from HIM. I'm certainly not looking for an argument.\"They look over at their young friend, the third bull, and find him pawing the dirt, shaking his horns, and snorting up a storm.The first bull says, \"Son, let me give you some advice real quick. Let him have some of your cows and live to tell about it.\"The third bull says, \"Heck, he can have ALL my cows. I'm just making sure he knows I'M a bull!\"", "Two robins were sitting in a tree.\"I'm really hungry,\" said the first one. \"Let's fly down and find some lunch.\"They flew down to the ground and found a nice plot of newly plowed ground that was full of worms. They ate and ate and ate till they could eat no more.\"I'm so full, I don't think I can fly back up into the tree,\" said the first one.\"Let's just lay back here and bask in the warm sun,\" said the second.\"O K,\" said the first.So they plopped down, basking in the sun. No sooner than they had fallen asleep, when a big fat tomcat came up and gobbled them up.As the cat sat washing his face after his meal, he thought...\"I JUST LOVE BASKIN ROBINS.\"", "A lion woke up one morning feeling really rowdy and mean.He went out and cornered a small monkey, and roared, \"Who is mightiest\n\nof all jungle animals?\"The trembling monkey says, \"You are, mighty lion!\"Later, the lion confronts an ox and fiercely bellows, \"Who is the\n\nmightiest of all jungle animals?\"The terrified ox stammers, \"Oh great lion, you are the mightiest\n\nanimal in the jungle!\"On a roll now, the lion swaggers up to an elephant and roars, \"Who is\n\nmightiest of all jungle animals?\"Fast as lightning, the elephant snatches up the lion with his trunk,\n\nslams him against a tree half a dozen times leaving the lion feeling\n\nlike it'd been run over by a safari wagon.The elephant then stomps on the lion till it looks like a corn\n\ntortilla and rambles away.The lion lets out a moan of pain, lifts his head weakly and hollers\n\nafter the elephant, \"Just because you don't know the answer, you don't\n\nhave to get so upset about it!\"", "How many dogs does it take to change a light bulb?\"Golden Retriever: The sun is shining, the day is young, we have our whole lives ahead of us, and you're inside worrying about a stupid burned out bulb?Border Collie: Just one. And then I'll replace any wiring that's not up to code.Dachshund: You know I can't reach that stupid lamp!Rottweiler: Make me.Boxer: Who cares? I can still play with my squeaky toys in the dark.Lab: Oh, me, me!!!!! Pleeeeeeeeeze let me change the light bulb! Can I? Can I? Huh? Huh? Huh? Can I? Pleeeeeeeeeze, please, please, please!German Shepherd: I'll change it as soon as I lead these people from the dark, check to make sure I don't miss any, and make just one more perimeter patrol to see that no one takes advantage of the situation.Jack Russell Terrier: I'll just pop it in while I'm bouncing off the walls and furniture.Old English Sheep Dog: Light bulb? I'm sorry, but I don't see a light bulb!Cocker Spaniel: Why change it? I can still pee on the carpet in the dark.Chihuahua: Yo quiero Taco Bulb.Pointer: I see it, there it is, there it is, right there.....Greyhound: It isn't moving. Who cares?Australian Shepherd: First, I'll put all the light bulbs in a little circle...Poodle: I'll just blow in the Border Collie's ear and he'll do it. By the time he finishes rewiring the house, my nails will be dry.\"Dogs do not change light bulbs. People change light bulbs. So, the real question is: How long will it be before I can expect some light, some dinner, and a massage?\" \n\nAll of which proves, once again, that while dogs have masters, cats have staff.", "If your dog is fat, you aren't getting enough exercise.- UnknownSome days you're the dog; some days you're the hydrant.- UnknownWhoever said you can't buy happiness forgot about puppies.- Gene HillIn dog years, I'm dead.- UnknownTo his dog, every man is Napoleon; hence the constant popularity of dogs.- Aldous HuxleyA dog teaches a boy fidelity, perseverance, and to turn around three times \n\nbefore lying down.- Robert BenchleyDid you ever walk into a room and forget why you walked in? I think that's \n\nhow dogs spend their lives.- Sue MurphyI loathe people who keep dogs. They are cowards who haven't got the guts to \n\nbite people themselves.- August StrindbergNo animal should ever jump up on the dining room furniture unless absolutely \n\ncertain that he can hold his own in the conversation.- Fran LebowitzEver consider what they must think of us? I mean, here we come back from a \n\ngrocery store with the most amazing haul -- chicken, pork, half a cow. They \n\nmust think we're the greatest hunters on earth!- Anne TylerI wonder if other dogs think poodles are members of a weird religious cult.- Rita RudnerMy dog is worried about the economy because Alpo is up to 99 cents a can.That's almost $7.00 in dog money.\n\n- Joe WeinsteinIf I have any beliefs about immortality, it is that certain dogs I have \n\nknown will go to heaven, and very, very few persons.- James ThurberYou enter into a certain amount of madness when you marry a person with \n\npets.\n\n- Nora EphronDon't accept your dog's admiration as conclusive evidence that you are \n\nwonderful.- Ann LandersWomen and cats will do as they please, and men and dogs should relax and get \n\nused to the idea.- Robert A. HeinleinIn order to keep a true perspective of one's importance, everyone should \n\nhave a dog that will worship him and a cat that will ignore him.- Dereke Bruce, Taipei, TaiwanOf all the things I miss from veterinary practice, puppy breath is one of \n\nthe most fond memories!- Dr. Tom CatThere is no psychiatrist in the world like a puppy licking your face.- Ben WilliamsWhen a man's best friend is his dog, that dog has a problem.- Edward AbbeyCat's motto: No matter what you've done wrong, always try to make it look \n\nlike the dog did it.- UnknownMoney will buy you a pretty good dog, but it won't buy the wag of his tail.- UnknownNo one appreciates the very special genius of your conversation as the dog \n\ndoes.- Christopher MorleyA dog is the only thing on earth that loves you more than he loves himself.- Josh BillingsMan is a dog's idea of what God should be.- Holbrook JacksonThe average dog is a nicer person than the average person.\n\n- Andrew A. RooneyHe is your friend, your partner, your defender, your dog. You are his life, \n\nhis love, his leader. He will be yours, faithful and true, to the last beat \n\nof his heart. You owe it to him to be worthy of such devotion.- UnknownIf you pick up a starving dog and make him prosperous, he will not bite you; \n\nthat is the principal difference between a dog and a man.- Mark TwainThings that upset a terrier may pass virtually unnoticed by a Great Dane.- Smiley BlantonI've seen a look in dogs' eyes, a quickly vanishing look of amazed contempt, \n\nand I am convinced that basically dogs think humans are nuts.- John Steinbeck", "A contestant on \"Who Wants to be a Millionaire?\" had reached the final plateau. If she answered the next question correctly, she would win $1,000,000. If she answered incorrectly, she would pocket only the 32,000 milestone money. And as she suspected it would be, the million-dollar question was no pushover. It was, \"Which of the following species of birds does not build its own nest, but instead lays its eggs in the nests of other birds?\n\nIs it A) the condor; B) the buzzard; C) the cuckoo; or D) the vulture?\"The woman was on the spot. She did not know the answer. And she was doubly on the spot because she had used up her 50/50 Lifeline and her Audience Poll Lifeline. All that remained was her Phone-a-Friend! Lifeline. The woman hoped she would not have to use it because ... her friend was, well .. blond. She had no alternative. She called her friend and gave her the question and the four choices. The blonde responded unhesitatingly: \"That's easy. The answer is C: The cuckoo.\"The contestant had to make a decision and make it fast. She considered employing a reverse strategy and giving Regis any answer except the one that her friend had given her. And considering that her friend was a blonde, that would seem to be the logical thing to do. On the other hand - the blonde had responded with such confidence, such certitude, that the contestant could not help but be persuaded.I need an answer,\" said Regis.Crossing her fingers, the contestant said, \"C: The cuckoo.\"\"Is that your final answer?\" asked Regis. \"Yes, that is my final answer.\"Two minutes later, Regis said, \"That answer is ... absolutely correct! You are now a millionaire!\"Three days later, the contestant hosted a party for her family and friends including the blonde who had helped her win the million dollars. \"Jenny, I just do not know how to thank you! ,\" said the contestant. \"How did you happen to know the right answer?\"\"Oh, come on,\" said the blonde. \"Everybody knows that cuckoos don't build nests. They live in clocks.\"", "A man was out walking a dog, and a woman stopped to admire\n\nthe animal.\"What's your dog's name?\" she asked.\"Herpes,\" replied the dog's owner.\"How....odd,\" said the woman. \"Why Herpes?\"\"Because he won't heel.\"", "One morning a blind bunny was hopping down the bunny trail and tripped over \n\na large snake and fell, kerplop right on his twitchy little nose.'Oh please excuse me,' said the bunny. 'I didn't mean to trip over you, but \n\nI'm blind and can't see.''That's perfectly all right,' replied the snake. 'To be sure, it was my \n\nfault. I didn't mean to trip you, but I'm blind too, and I didn't see you \n\ncoming. By the way what kind of animal are you?''Well, I really don't know,' said the bunny. 'I'm blind, and I've never seen \n\nmyself. Maybe you could examine me and find out.'So the snake felt the bunny all over, and he said, 'Well, you're soft, and \n\ncuddly, and you have long silky ears, and a little fluffy tail and a dear \n\ntwitch little nose. You must be a bunny rabbit.'The bunny said, 'I can't thank you enough. But, by the way, what kind of \n\nanimal are you?'The snake replied that he didn't know either, and the bunny agreed to \n\nexamine him, and when the bunny was finished the snake asked, 'Well, what \n\nkind of animal am I?'The bunny had felt the snake all over, and he replied, 'You're cold, you're \n\nslippery, and you haven't any balls............You must be a politician!'", "Two guys are out hiking. All of a sudden, a bear starts chasing them.They climb a tree, but the bear starts climbing up the tree after them. The first guy gets his sneakers out of his knapsack and starts putting them on.The second guy says, \"What are you doing?\"He says, \"I figure when the bear gets close to us, we'll jump down and make a run for it.\"The second guy says, \"Are you crazy? You can't outrun a bear.\"The first guy says, \"I don't have to outrun the bear. I only have to outrun you.\"", "If your dog is fat, you aren't getting enough exercise.- UnknownSome days you're the dog; some days you're the hydrant.- UnknownWhoever said you can't buy happiness forgot about puppies.- Gene HillIn dog years, I'm dead.- UnknownTo his dog, every man is Napoleon; hence the constant popularity of dogs.- Aldous HuxleyA dog teaches a boy fidelity, perseverance, and to turn around three times \n\nbefore lying down.- Robert BenchleyDid you ever walk into a room and forget why you walked in? I think that's \n\nhow dogs spend their lives.- Sue MurphyI loathe people who keep dogs. They are cowards who haven't got the guts to \n\nbite people themselves.- August StrindbergNo animal should ever jump up on the dining room furniture unless absolutely \n\ncertain that he can hold his own in the conversation.- Fran LebowitzEver consider what they must think of us? I mean, here we come back from a \n\ngrocery store with the most amazing haul -- chicken, pork, half a cow. They \n\nmust think we're the greatest hunters on earth!- Anne TylerI wonder if other dogs think poodles are members of a weird religious cult.- Rita RudnerMy dog is worried about the economy because Alpo is up to 99 cents a can.That's almost $7.00 in dog money.\n\n- Joe WeinsteinIf I have any beliefs about immortality, it is that certain dogs I have \n\nknown will go to heaven, and very, very few persons.- James ThurberYou enter into a certain amount of madness when you marry a person with \n\npets.\n\n- Nora EphronDon't accept your dog's admiration as conclusive evidence that you are \n\nwonderful.- Ann LandersWomen and cats will do as they please, and men and dogs should relax and get \n\nused to the idea.- Robert A. HeinleinIn order to keep a true perspective of one's importance, everyone should \n\nhave a dog that will worship him and a cat that will ignore him.- Dereke Bruce, Taipei, TaiwanOf all the things I miss from veterinary practice, puppy breath is one of \n\nthe most fond memories!- Dr. Tom CatThere is no psychiatrist in the world like a puppy licking your face.- Ben WilliamsWhen a man's best friend is his dog, that dog has a problem.- Edward AbbeyCat's motto: No matter what you've done wrong, always try to make it look \n\nlike the dog did it.- UnknownMoney will buy you a pretty good dog, but it won't buy the wag of his tail.- UnknownNo one appreciates the very special genius of your conversation as the dog \n\ndoes.- Christopher MorleyA dog is the only thing on earth that loves you more than he loves himself.- Josh BillingsMan is a dog's idea of what God should be.- Holbrook JacksonThe average dog is a nicer person than the average person.\n\n- Andrew A. RooneyHe is your friend, your partner, your defender, your dog. You are his life, \n\nhis love, his leader. He will be yours, faithful and true, to the last beat \n\nof his heart. You owe it to him to be worthy of such devotion.- UnknownIf you pick up a starving dog and make him prosperous, he will not bite you; \n\nthat is the principal difference between a dog and a man.- Mark TwainThings that upset a terrier may pass virtually unnoticed by a Great Dane.- Smiley BlantonI've seen a look in dogs' eyes, a quickly vanishing look of amazed contempt, \n\nand I am convinced that basically dogs think humans are nuts.- John Steinbeck", "NOTE: I don't know how anyone could write this with a straight face!\n\nThis was an actual memo sent at an unnamed computer company to its\n\nemployees. It went to all the company's field engineers, and it was in\n\nregard to a computer peripheral problem. The author of this memo was\n\nquite serious; the engineers rolled on the floor! (Especially note the\n\nlast sentence!)INSTRUCTIONS FOR REPLACING MOUSE BALLSMouse balls are now available as FRU (Field Replacement Unit).\n\nTherefore, if a mouse fails to operate or should it perform erratically,\n\nit may need a ball replacement. Because of the delicate nature of this\n\nprocedure, replacement of mouse balls should only be attempted by\n\nproperly trained personnel.Before proceeding, determine the type of mouse balls by examining the\n\nunderside of the mouse. Domestic balls will be larger and harder than\n\nforeign balls.Ball removal procedures differ depending upon the manufacturer of the\n\nmouse. Foreign balls can be replaced using the pop-off method. Domestic\n\nballs are replaced by using the twist-off method.Mouse balls are not usually static-sensitive. However, excessive handling\n\ncan result in sudden discharge.Upon completion of ball replacement, the mouse may be used immediately.\n\nIt is recommended each replacer have a pair of spare balls for maintaining\n\noptimum customer satisfaction. Any customer missing his balls should\n\ncontact the local personnel in charge of removing and replacing these\n\nnecessary items.", "Two robins were sitting in a tree.\"I'm really hungry,\" said the first one. \"Let's fly down and find some lunch.\"They flew down to the ground and found a nice plot of newly plowed ground that was full of worms. They ate and ate and ate till they could eat no more.\"I'm so full, I don't think I can fly back up into the tree,\" said the first one.\"Let's just lay back here and bask in the warm sun,\" said the second.\"OK,\" said the first.So they plopped down, basking in the sun. No sooner than they had fallen asleep, when a big fat tomcat came up and gobbled them up.As the cat sat washing his face after his meal, he thought...\"I JUST LOVE BASKIN ROBINS.\""]}